ยบ[
{"autor": ["admin"], "titulo": ["Grupos de Telegram de la comunidad de software, hardware y conocimiento libre en Granada"], "contenido": ["En los últimos meses han surgido una serie de grupos de Telegram centrados en el software y hardware libre en Granada y alrededores. Todos los grupos son abiertos, se puede acceder a ellos sin invitación y está bien conocerlos. Aunque todos tienen énfasis en un tema determinado, no hace falta tener un máster en el mismo, son grupos para todos los niveles."], "listaEtiquetas": [], "listaCategorias": [" Eventos ", " Mundo Libre ", " Software Libre "]},
{"autor": ["José Alonso"], "titulo": ["Formulario de solicitud  III Campaña UGR-UNIA de Ordenadores Libres con Software Libre"], "contenido": [], "listaEtiquetas": [], "listaCategorias": [" OSL "]},
{"autor": ["Cristina"], "titulo": ["Desarrollo de la Jornada dedicada a la Docencia para la Igualdad entre Mujeres y Hombres en Tecnología y Actuaciones para Mitigar el Abandono en los Primeros Cursos"], "contenido": ["El pasado viernes 30 de Junio, tuvo lugar la “Jornada dedicada a la Docencia para la Igualdad entre Mujeres y Hombres en Tecnología y Actuaciones para Mitigar el Abandono en los Primeros Cursos”, realizadas ", " la ", " de la ", " Española para la Ciencia y la Tecnología-Ministerio de Economía, Industria y Competitividad, el apoyo incondicional de la ", ".", "La jornada dio comienzo con la intervención de Joaquín Fernández Valdivia, director de la ETS de Ingenierías Informática y de Telecomunicación. El director hizo énfasis en la importancia de tomar medidas ante el importante descenso en la matriculación de mujeres en carreras del sector tecnológico. Éste, lejos de resolverse, se está agudizando con el paso del tiempo. El desequilibrio entre la participación de ambos géneros perjudica al sector de las TIC, ya que una importante cantidad de talentos femeninos van destinados a otros sectores de forma desproporcionada.", "A continuación y en representación de la Delegación de alumnos de la ETSIIT, Carmen Guidet Gómez hizo una presentación exponiendo evidencias de la baja motivación y los escasos estímulos que se ofrecen a las mujeres desde pequeñas, enfocados a incrementar su interés por la tecnología. La presentación dio pie a una serie de breves debates, en los que se intentaron diagnosticar las causas de la escasa participación femenina y proponer medidas para fomentarla. Su presentación puede consultarse ", ".", "Los grupos ", ", ", ", ", ", ", " y la ", " fueron los encargados de cerrar la jornada, incorporando más datos, ideas y puntos de vista acerca de la problemática tratada. Presentando a sus respectivos colectivos, fomentaron la  participación en las actividades que ofrecen para luchar contra la brecha participativa entre hombres y mujeres en el ámbito tecnológico. Las presentaciones se pueden descargar o consultar a través de los siguientes enlaces:", "Desde la oficina de software libre, animamos a todos los lectores a informarse acerca de la problemática y participar en las actividades que se proponen para resolverla. Vuestra participación e interés son los que marcan la diferencia."], "listaEtiquetas": [], "listaCategorias": [" Eventos "]},
{"autor": ["Bryan Moreno"], "titulo": ["Firefox Quantum: El zorro más veloz de Internet."], "contenido": ["Hace unos días, llegaba a nuestros equipos la nueva actualización del navegador de Mozilla, el denominado Firefox Quantum, bajo el lema ", " (Ahora Es Mejor) y con unos cuantos videos promocionales en clave de humorístico bajo la manga, con los que la compañía ha querido mostrarnos su nuevo producto.", "Si bien a simple vista parece el mismo navegador de siempre, cuando hacemos un análisis un poco más meticuloso vemos que hay notables mejorías que contamos a continuación de forma muy resumida.", "Para empezar, la gente de Mozilla ha decidido cambiar el motor del navegador por uno nuevo y, en teoría, más veloz que el anterior. Esto se ha realizado con múltiples cambios entre los que destacan el uso de un motor CSS multinúcleo (Stylo) así como un nuevo sistema de prioridades en cargas de pestañas y ventanas, además de preparaciones para futuras incorporaciones como ", " que harán de Firefox un navegador más rápido y fiable según promete la compañía.", "Si todo sale como la compañía espera, los cambios van a hacer que el navegador sea hasta dos veces más rápido y un 30% más ligero que su versión anterior e incluso que Google Chrome. Nosotros, después de unos días probando, no podemos afirmar que sea el doble de rápido, pero sí hemos notado una mejoría notable en la fluidez entre pestañas y ventanas.", "Tras unas breves pesquisas e indagaciones por numerosos blogs de tecnología, podemos ver que, si bien los cambios y mejoras suponen un paso adelante comparándolo con versiones anteriores, ", " sigue teniendo algunos problemas con el uso excesivo de memoria si se utilizan múltiples pestañas/ventanas. En la mayoría de los casos podemos ver que efectivamente sigue siendo más rápido que sus competidores directos, aunque aún queda un largo camino por recorrer. No obstante, parece que la compañía del zorro rojo se ha puesto manos a la obra e intenta quitar de su puesto de rey a su archienemigo Chrome, esperamos que en las siguientes versiones la velocidad y mejoras de rendimiento se noten aún más.", "Este navegador sigue siendo software libre y multiplataforma y esta nueva versión se puede descargar desde ", ".", " ", " "], "listaEtiquetas": [], "listaCategorias": [" Software Libre "]},
{"autor": ["José Alonso"], "titulo": ["III Campaña UGR-UNIA de Ordenadores Libres con Software Libre "], "contenido": ["Tras las múltiples peticiones en las dos campañas anteriores de asociaciones y ONGs, así como las necesidades específicas de las mismas, la ", " junto con la ", " (parte del ", ") y la ", " lanzan la III Campaña UGR-UNIA de ", ", las bases de la misma se pueden consultar ", "Se donarán 20 equipos informáticos con software libre asi como otro tipo de material informático (pantallas, proyectores, impresoras, portátiles)a diferentes asociaciones y ONGs, evaluadas según un orden de prioridad dentro de las solicitantes para lo que se estudiará las que tengan un mayor grado de necesidad para la realización de su actividad cotidiana. Para solicitar uno de estos lotes, solo hay que rellenar este ", " a partir del 3 de noviembre de 2017.", "Durante la primera semana de diciembre se comunicará a los solicitantes el resultado de su solicitud de concesión o no de dicho material informático. La recogida de los ordenadores se realizara en la Oficina de Software Libre, para lo que deberá acudir una persona responsable designada por los solicitantes a la Oficina de Software Libre (", "), tras un pequeño taller impartido por el personal de la propia Oficina de Software Libre en el que se explicará el sistema operativo y el resto de software libre instalados, los beneficiarios podrán proceder a retirar los equipos. La asistencia al taller es obligatoria, para cualquier duda o incidencia se puede consultar por correo a la dirección ", "."], "listaEtiquetas": [], "listaCategorias": [" OSL "]},
{"autor": ["Manu"], "titulo": ["Proyectos del Campus Tecnológico para Chicas Ugr "], "contenido": ["Hace tan sólo unos pocos días que finalizó el IV Campus Tecnológico UGR para chicas #sereingeniera17 y paso a contaros detalles, proyectos, etc, y muchas fotos.", "Lo primero es agradecer desde la Oficina de Software Libre a los patrocinadores que han apoyado esta iniciativa y sin la cual hubiese sido misión imposible llevar a cabo el proyecto:", "Aún así este año el Campus ha contado con profesoras que, o bien son estudiantes de la carrera Ingeniería Informática y  Telecomunicaciones,  o han terminado sus estudios graduándose en ella, siendo esta en la que se ha desarrollado dicho campus, ", " y al cual agradecemos tanto a su director D. Joaquín Valdivia, como a la Vicerrectora de ", "Las profesoras han sido ", ", ", ", ", "  que aparecen portando un ramo de flores, cortesía de la Oficina de Software Libre, y en particular de su Director ", ".", " ", "Foto por ", "Han realizado un trabajo impecable, tanto en el trato con las chicas como el propio desarrollo de los proyectos y en la enseñanza de programas como Scratch, Gimp, AppInventor, Inskcape, Atom, Firefox, todos ellos programas libres, al igual que la distribución que utilizaron, Ubuntu 16.04 LTS.", "Siendo unas 38 chicas las que han podido acceder al campus se quedaron fuera otras tantas en la criba de selección, por lo cual se realizo un Clinic de una tarde para enseñarles algunos programas y explicarles que se hace en un campus tecnológico y que se estudia en la carrera de Ingeniería Informática.", "Foto por ", "quedando todas ellas muy contentas de poder asistir y formar parte de una tarde de programas como ", ", ", " en programación orientada a objetos, hasta un algoritmo realizando", ".", "Sobre los proyectos realizados y presentados el día de la clausura tenemos:", " ", "2.", "Realizado con Arduino y que esquiva obstáculos en su camino por un sensor de ultrasonidos.", " ", "3.", "Videojuego realizado con Scratch y ", " que nos permite descubrir nuevos mundos en cada uno de sus niveles.", " ", "4.", "Pompero realizado con Arduino. Un sistema automático que nos permitía hacer pompas de jabón gracias a los dos servos que ejecutan el movimiento articulado del pompero y un ventilador que se activa para realizar las pompas.", " ", "5.", "Videojuego realizado en Scratch y Arduino Esplora. El objetivo de este  videojuego de plataforma es recoger todas las monedas posibles sin caer.", " ", "6.", "Aplicación realizada con ", ". Permite realizar fotografías a prendas de ropa y clasificarlas según su estilo para conformar una galería personalizada de nuestro armario de ropa.", " ", "7.”", "Coche realizado con Arduino que esquiva obstáculos en su camino y emite sonidos.", " ", " ", "8.", "Aplicación móvil realizada con AppInventor. Red social que nos permite  registrarnos, crear y leer archivos, realizar fotografías, visualizar la galería y también cuenta con un chat.", " ", "9.”", "” ", "Aplicación móvil multitemática realizada con AppInventor. Incluye una opción para ver los hits del momento en YouTube, una pestaña para juegos desde la cual se pueden lanzar videojuegos creados con Scratch. También permite tener una cuenta de usuario con login y su propio perfil.", "Esperamos que todas las alumnas de este Campus y el Clinic se lo hayan pasado muy bien y, sobre todo, hayan podido comprobar que realizar proyectos en equipo, con herramientas y programas libres, con programas para desarrollar programación, con Scratch, WoofJS, con placas Arduinos, sensores, baile e ilusión, todo es posible.", "Hasta el próximo Campus.", "P.D. La mayoría de fotos ha sido gracias a Braulio Vargas y Marta Gómez, ", "."], "listaEtiquetas": [" Formación ", " OSL ", " proyectos ", " scratch ", " Software Libre "], "listaCategorias": [" Formación ", " OSL ", " proyectos ", " scratch ", " Software Libre "]}
]
