{"autor": ["admin"], "titulo": ["Jornada dedicada a la Docencia para la Igualdad entre Mujeres y Hombres en Tecnología y Actuaciones para Mitigar el Abandono en los Primeros Cursos"], "contenido": ["\r\n              El viernes 30 de junio, y como preludio al Campus Tecnológico UGR para Chicas de este año, se celebrará la “Jornada dedicada a la Docencia para la Igualdad entre Mujeres y Hombres en Tecnología y Actuaciones para Mitigar el Abandono en los Primeros Cursos“.\n\nEl evento está coordinado por la Oficina de Software Libre de la UGR, y tendrá lugar en el Salón de Grados de la Escuela Técnica de Ingenierías Informática y de Telecomunicaciones, a partir de las 10:00 AM.\nEl programa constará de charlas mostrando diversas perspectivas sobre el tema y una mesa redonda.\n10:00 – 10:45 Joaquín Fernández Valdivia, director de la ETS de Ingenierías Informática y de Telecomunicación.\n10:45 – 11:15 Pausa.\n11:15 – 12:00 Carmen Guidet Gómez, estudiante de Telecomunicaciones, representante de la Delegación de Alumnos de la ETSIIT.\n12:00 – 13:30 Marta García Gomez, Python-Granada y G&amp;T Girls; Cristina Heredia de Geek&amp;Tech Girls, Paula de la Hoz de Interferencias, Ceci Merelo Molina, GDG y Cristina Martín Romera, Oficina de Software Libre.\nLa entrada es libre hasta que se agoten las localidades, pero se aconseja reservar plaza gratuitamente a través de Meetup.\n\n                                      "], "listaEtiquetas": [" campus tecnológico para chicas ", " diversidad ", " Tecnología "], "listaCategorias": [" Eventos ", " Mundo Libre "]}{"autor": ["Manu"], "titulo": ["Proyectos del Campus Tecnológico para Chicas Ugr "], "contenido": ["\r\n              Hace tan sólo unos pocos días que finalizó el IV Campus Tecnológico UGR para chicas #sereingeniera17 y paso a contaros detalles, proyectos, etc, y muchas fotos.\nLo primero es agradecer desde la Oficina de Software Libre a los patrocinadores que han apoyado esta iniciativa y sin la cual hubiese sido misión imposible llevar a cabo el proyecto:\n\n\n\n\nApariencia\nAún así este año el Campus ha contado con profesoras que, o bien son estudiantes de la carrera Ingeniería Informática y Telecomunicaciones, o han terminado sus estudios graduándose en ella, siendo esta en la que se ha desarrollado dicho campus, Escuela Técnica Superior de Ingenierías Informática y de Telecomunicación de la Universidad de Granada y al cual agradecemos tanto a su director D. Joaquín Valdivia, como a la Vicerrectora de Responsabilidad Social, Igualdad e Inclusión Doña. Teresa Ortega López y a D. Óscar Cordón Delegado de la Rectora para la Universidad Digital (DRUD) que intervinieron en la clausura del campus en el Salón de Actos.\nLas profesoras han sido Cristina, Marta Gómez, María e Irene Herrera que aparecen portando un ramo de flores, cortesía de la Oficina de Software Libre, y en particular de su Director D. Juan Julián Merelo Guervos.\n\nFoto por Braulio Vargas\nHan realizado un trabajo impecable, tanto en el trato con las chicas como el propio desarrollo de los proyectos y en la enseñanza de programas como Scratch, Gimp, AppInventor, Inskcape, Atom, Firefox, todos ellos programas libres, al igual que la distribución que utilizaron, Ubuntu 16.04 LTS.\nSiendo unas 38 chicas las que han podido acceder al campus se quedaron fuera otras tantas en la criba de selección, por lo cual se realizo un Clinic de una tarde para enseñarles algunos programas y explicarles que se hace en un campus tecnológico y que se estudia en la carrera de Ingeniería Informática.\nFoto por Manu\nquedando todas ellas muy contentas de poder asistir y formar parte de una tarde de programas como Scratch,WoofJS en programación orientada a objetos, hasta un algoritmo realizando programación con baile.\nSobre los proyectos realizados y presentados el día de la clausura tenemos:\n1.“Mini moto eléctrica” Moto realizada con Arduino y materiales reciclados. Cuenta con un sensor sigue-líneas que permitía detectar cuando se encuentra sobre un color oscuro para comenzar a andar, parándose al pasar a un color claro. Realizado por Carmen Rosillo, Susana Salvatierra, Sara Peña y Marie Diakhate\n\n\n2.“Coche esquiva-obstáculos”. Por Sara Muñoz, Lucía Quirós y Naiara Bouza.\nRealizado con Arduino y que esquiva obstáculos en su camino por un sensor de ultrasonidos.\n\n\n3.“Pony Land”. Por AnaCalín, Carmen Fajardo, Cristina García y Laura Rodríguez.\nVideojuego realizado con Scratch y Arduino Esplora que nos permite descubrir nuevos mundos en cada uno de sus niveles.\n\n\n4.“Pompero”. Por MaríaCortés, Elvira de Reyes, Julia Rodríguez y Anna Rodríguez.\nPompero realizado con Arduino. Un sistema automático que nos permitía hacer pompas de jabón gracias a los dos servos que ejecutan el movimiento articulado del pompero y un ventilador que se activa para realizar las pompas.\n\n\n5.“Videogame-project”. Por Esther García, Elisa Chami, Rosario Rodríguez y María Ángeles Frías.\nGitHub project\nVideojuego realizado en Scratch y Arduino Esplora. El objetivo de este videojuego de plataforma es recoger todas las monedas posibles sin caer.\n\n\n6.“My Closet”.  Por Ángela Pérez, Paola Barranco, Begoña Henríquez de Luna y PaulaMontero. \nAplicación realizada con AppInventor. Permite realizar fotografías a prendas de ropa y clasificarlas según su estilo para conformar una galería personalizada de nuestro armario de ropa.\n\n\n7.”Coche robot”. Por Clara Berenguel, Lucía Muñoz, Ángela Romero y Elena Tapia.\nGitHub coche robot\nCoche realizado con Arduino que esquiva obstáculos en su camino y emite sonidos.\n\n\n\n8.“Friendship”. Por Paula Riquelme, Carmen Roca, Lucía Díaz-Berbel y Silvia Castillo.\nAplicación móvil realizada con AppInventor. Red social que nos permite registrarnos, crear y leer archivos, realizar fotografías, visualizar la galería y también cuenta con un chat.\n\n\n9.”Aplicación móvil” Beatriz Arellano, Cristina Martín, Carolina Martín y Laura Moreno.\nAplicación móvil multitemática realizada con AppInventor. Incluye una opción para ver los hits del momento en YouTube, una pestaña para juegos desde la cual se pueden lanzar videojuegos creados con Scratch. También permite tener una cuenta de usuario con login y su propio perfil.\n\nEsperamos que todas las alumnas de este Campus y el Clinic se lo hayan pasado muy bien y, sobre todo, hayan podido comprobar que realizar proyectos en equipo, con herramientas y programas libres, con programas para desarrollar programación, con Scratch, WoofJS, con placas Arduinos, sensores, baile e ilusión, todo es posible.\n\nHasta el próximo Campus.\nP.D. La mayoría de fotos ha sido gracias a Braulio Vargas y Marta Gómez, el resto de fotos en nuestra galería.\n                                      "], "listaEtiquetas": [" appinventor ", " arduino ", " campus ", " chicas ", " game ", " gimp ", " granada ", " inkscape ", " robots ", " sensores ", " Tecnología ", " videojuegos ", " woojs "], "listaCategorias": [" Formación ", " OSL ", " proyectos ", " scratch ", " Software Libre "]}{"autor": ["admin"], "titulo": ["Libera tus apuntes con una licencia libre"], "contenido": ["\r\n              \nEn breve terminarán las clases y llega el momento de prepararse para el curso siguiente. Los apuntes se actualizan, se ponen al día, se limpian y es un buen momento para considerar liberarlos. Liberar los apuntes permite que más personas tengan acceso a ellos, desde dentro y fuera de la comunidad universitaria; además, siendo libres, la gente aportará a los mismos desde lo más simple, un enlace que ya no funciona, hasta aportaciones más complejas y significativas, que pueden enseñarnos cosas y ayudarnos a mejorar la materia que impartimos en nuestra universidad. La universidad es conocimiento y es universal, y cuanto más visibles y libres sean los apuntes más benefician a todo el mundo, inclusive a la persona que los ha liberado, que puede recibir citas en los mismos, incrementando ese número H al que todos le prestamos atención.\nY liberar unos apuntes es muy fácil. Sólo hay que elegir estos pasos.\n\nDecidir sobre la licencia. Para contenido la licencia más generalizada es la llamada CC o creative commons. Una licencia es un permiso de utilización con ciertas restricciones, codificadas en el nombre y logo de la licencia. Todas tienen la partícula by, que indica que la autoría se debe reconocer siempre. Pero además añade una serie de partículas. Desde la OSL aconsejamos que se libere con la provisión share alike, o compartir de la misma forma. Cualquier persona que modifique y publique esos apuntes o parte de ellos, aparte de reconocer la autoría, tendrá que liberar el conjunto con la misma licencia. Esta provisión viral preserva los derechos del autor y además se considera una licencia de cultura libre. Es importante en esta licencia respetar la de los contenidos que se incluyan: imágenes, trozos de código. Si una imagen tiene este tipo de licencia, estaremos obligados a usarla para respetarlo. Cualquier imagen con licencia creative commons se puede usar sin problemas, siempre acreditando al autor como sea posible. Si sólo tiene contenido propio, uno puede usar la licencia que desee.\nHay que publicar de forma efectiva esos apuntes de forma que estén accesibles en la web, y con la licencia bien visible; generalmente basta con incluir el icono en cada página donde se publique. Afortunadamente, publicar en la web hoy en día es bien fácil. Si tenemos los apuntes en cualquier formato de procesador de textos, todos tienen una opción de exportar a HTML o Web que te genera una serie de ficheros que puedes subir directamente, en HTML mejor que en PDF que no se puede visualizar directamente desde la web. Ahora, hay que alojar esos ficheros. Nuestro servicio de informática ofrece un servicio de alojamiento web que se puede usar. por parte de cualquier miembro de la comunidad universitaria, pero hay muchas más formas de hacerlo. Desde Google Sites, hasta hacerlos públicos desde Google Drive o Dropbox, pasando por usar servicios como Slideshare o Issuu para publicar directamente en formato de procesador de textos o presentación. Si usas git y GitHub, para nosotros es muy aconsejable publicarlos directamente en GitHub Pages, lo que también te permite gestionar fácilmente errores y peticiones de cambio.\nSi se usa una plataforma de enseñanza tal como Moodle o Swad, estos apuntes se pueden enlazar desde la misma para que estén disponibles para la clase; también se puede exportar a PDF o a cualquier otro formato e insertarlo en la plataforma, como es natural. Siempre será mejor tener una sola fuente, la publicada en abierto en la web, que tener varias que además habrá que actualizar cuando se cambie. De la misma forma, se puede publicar también en alguna plataforma como el DIGIBUG de la UGR o en plataformas de publicaciones como ResearchGate o Figshare, para obtener un identificador único y que pueda ser citada. En cualquiera de los lugares que se publique, conviene poner en lugar bien visible el nombre de los autores y el correo electrónico de contacto.\n\nDe todos estos pasos, en realidad sólo hacen falta los dos primeros. Y si te sientes atascado en cualquiera de ellos, para eso estamos la Oficina, nos puedes contactar por correo electrónico o teléfono interno, 20207 o 78394.\n                                      "], "listaEtiquetas": [" academia ", " apuntes ", " CC ", " ciencia abierta ", " creative commons ", " mundo universitario ", " open science "], "listaCategorias": [" OSL ", " Software Libre ", " software-liberado "]}{"autor": ["Chá Lucena"], "titulo": ["Guía rápida para editar en una editatón cuando eres virgen (en editatones)"], "contenido": ["\r\n              Como muchos sabréis, en la Oficina de Software Libre organizamos periódicamente editatones. La primera vez que escuché a Germán decir la palabra editatón, una nube de pánico nuclear se interpuso entre él y yo, especialmente cuando me enteré de que tenía que preparar una.\n¿edita-qué?\nAhora sé que una editatón es una maratón de ediciones de la Wikipedia sobre un tema determinado.\n\nSi tú también dices ¿¿editaqué?? cuando alguien te habla de venir a una, quizá te resulte útil la chuletica que me hice yo para mi primera vez:\n\n\n1. Crea una cuenta en Wikipedia.\n¿Ya la tienes y has editado previamente? ¡Perfecto! Ayuda a los que no.\n2. Decide en cuál/es de los artículos propuestos en el Wikiencuentro/Editatón quieres participar.\n¿Qué puedes hacer?\n\nAñadir contenido (texto o multimedia)\nTraducir\nCorregir errores\nMejorar la legibilidad\n\n3. Sigue estas reglas básicas:\nElige tu método de edición:\n\nOpción A: Editor Visual\n\nFunciona como un procesador de textos\nSelecciona el botón “Editar”\n¡ojo! Es intuitiva pero tiene algunas reestricciones\n\n\nOpción B: Wikitexto\n\nRequiere saber codificación básica\nSelecciona el botón “Editar código”\n\n\n\nCoordínate con aquellos que hayan decidido trabajar en el mismo artículo que tú:\n\nSi vas a editar un artículo, dilo en voz alta\nSi alguien ha dicho que está editando en ese momento, espera a que acabe. (NO EDITES SIMULTÁNEAMENTE, PORQUE SI NO, SE LÍA PARDA)\nMientras estés editando el artículo, indica en su cabecera {{enobras}}\n¡Acuérdate de guardar cuando tu edición te parezca adecuada y avisa al resto!\n\nCuando hayas terminado de editar, dale a Guardar la página:\n\nPuedes resumir tus ediciones para que cualquier wikipedista sepa qué has modificado\nY si te has centradoen la ortografía o el formato, marca tu edición como menor\nSi piensas: “Quiero que me avisen si hacen cambios en mi amado artículo sin pedírmelo de rodillas primero“, añade la página a tuLista de seguimiento\nOtras posibilidades: Revisar cambios yContinuar edición\n\nRecuerda que el estilo debe ser formal y objetivo:\n\nEscribe basándote en referencias, indica las citas y haz vínculos a los conceptos más importantes que se describen en otros artículos (enlaces internos) de la Wikipedia la primera vez que los mencionas utilizandodel botón que parece una cadenica\nLos enlaces externos (es decir, a otras páginas web) van en la parte inferior de la página. Para indicar alguno, usa Enlace externoe insertala URL\n\nPara citar:\n\nBusca fuentes fiables y verificables que contrasten la información original que tenías(sí, como en los TFG y demás)\nPuedes parafrasear, pero no copiar\n¡Pregúntanos! Y, si yasabes cómova citar correctamente, aporta lo que sabes a los demás\nHaz clic en“Citar”y podrás añadir, editar o volver a usar una referencia\n\nPara insertar imágenes:\n\nPasa tus fotos a un ordenador (pídenos el cablecico o tráete uno)\nAlmacena en Wikimedia Commons\nInserta: insertar &gt; multimedia &gt; subir\nAgrega título, descripción y categorías para que, si alguien quiere usartu foto, pueda buscarla\nAdvertencia: las imágenes alojadas en Wikimedia Commons no deben estar protegidas por derechos de autor de nadie excepto de quien las sube. Cuando se almacenan en Wikimedia Commons, se vuelven libres para que cualquier persona pueda usarlas con licencia Creative Commons.\nVe a tu amado, increíble y sensacional artículo de Wikipedia e inserta multimedia (busca y selecciona)\nnota al pie: config. generales y avanzadas (como en un blog)insertar&gt; aplicar\n\n4. Si tienes alguna duda:pregúntanos o mira la ayuda para la edición de la página de tu WikiEncuentro,( por ejemplo, aquíestá uno de los que hemos hecho)y desde ahí puedes acceder a ayudasfantásticas como esta.\n5. Sube a Granada Geek, nuestro grupo deMeetup fotos y comentarios.\n6. ¡Comparte tu experiencia en redes sociales y siéntete felizde difundir la cultura libre y de haber vivido esta experiencia en vez de quedarte en casica!\n\n\nEspero que os haya sido útil esta información.\n¡Nos vemos por las editatones! (no olvides perseguirme antes de irte del evento, porque suelo llevar regalicos) 🙂\n\n\n\n\n@chalucena\n                                      "], "listaEtiquetas": [" chá ", " editaton ", " Eventos ", " guía ", " howtos ", " wikipedia "], "listaCategorias": [" Eventos ", " Hackathon ", " Multimedia ", " OSL ", " Talleres "]}{"autor": ["German Martinez"], "titulo": ["Comienzo de Patrimonio Abierto "], "contenido": ["\r\n              El viernes pasado arrancó la iniciativa “Patrimonio Abierto” que hemos organizado en colaboración conel Vicerrectorado de Extensión Universitaria a través del Secretariado de Bienes Culturales y del Secretariado de Conservación y Restauración por medio de Patrimonio UGR. La idea es acercar elpatrimonio cultural de la UGRa la comunidad universitaria y a los estudiantes, pero también acercar a la misma comunidad al concepto de cultura libre y dominio público.\n\nPara esta primera actividad contamos con una visita guiada por Hospital Real (sede central de la Universidad de Granada, que además está accesible a todo el público en general) en la que a parte de poder recorrer el edificio, conocimos diferentes detalles de la historia de este Monumento Histórico Artístico que cuenta con el reconocimiento de Bien de Interés Cultural.\n\nA la vez que íbamos haciendo fotos pudimos conocer el motivo de que en la misma entrada ya podamos apreciar diferencias significativas entre el estilo de la puerta principal y del resto de la fachada o porqué no todos los patios tienen el mismo nivel de acabado e incluso tienen diferentes iniciales en los emblemas, entre muchas otras cosas.\n\nAl finalizar la visita y tras la pausa del desayuno, continuamos esta vez en el Centro de Enseñanzas Virtuales con un taller sobre cómo editar la Wikipedia y la cultura libre para contribuir añadiendo la información de la que habíamos tomado nota y subir las fotos que habíamos hecho en los diferentes artículos que desde la propia Wikipedia habían preparado como recomendación para este evento.\n\nYa están planificadas todas las actividades que se van a realizar dentro de esta iniciativa como podéis ver en el cartel de abajo, esta misma semana se repite esta actividad, pero con horario de tarde pero en cualquier caso serán anunciadas individualmente según se vaya acercando la fecha para recordarlo por nuestras diferentes vías decomunicación, además podéis seguir la actividad relacionada en Twitter desde aquí. Así que ya sabéis, lo importante es que participéis, os divirtáis y aprendáis; basta con que traigáis una cámara o simplemente un móvil para hacer fotos si queréis, aunque para contribuir a la Wikipedia no hace falta nada más ya que hay ordenadores disponibles en el propioCentro de Enseñanzas Virtuales.Habrá también merchandising proporcionado por la Fundación Wikimedia en España. Y todo ello, totalmente gratuito.\n\n                                      "], "listaEtiquetas": [" crónica ", " editaton ", " evento ", " hackaton ", " patrimonio "], "listaCategorias": [" Cronica ", " Eventos ", " Hackathon ", " Mundo Libre ", " Servicios ", " Software Libre "]}{"autor": ["Manu"], "titulo": ["Segundo Hackaton de ordenadores Libres con Lubuntu"], "contenido": ["\r\n              Se ha realizado el segundo Hackaton sobre la configuración e instalación de Software Libre en ordenadores recogidos en diversas facultades de la Universidad de Granada y departamentos.\nUn Hackaton es un evento en el que se reúnen personas para hacer cosas, definición de nuestro compañero y genio, Pablo, aca @psicobyte_\nLos hackatones pueden realizarse sobre diversas temáticas o actividades, desde el realizado hoy en el almacén del edificio del CEVUG, hasta sobre el certamen de Software Libre para ayudar y dar un empujón a los diferentes proyectos. También se pueden realizar hackatones de cualquier cosa, MiniBlip, App, programas informáticos, juegos, etc…\nLa idea de este hackaton en particular nació por la enorme cantidad de equipos informáticos que tenemos acumulados en el almacén y al que no damos a basto entre las tareas de la propia oficina. Se nos iban juntando cada vez más ordenadores, impresoras, pantallas, periféricos, etc., llegando a ocupar casi todo el almacén. También decir que otros muchos se han tenido que reciclar por una empresa que gestiona el departamento de calidad ambiental de la Universidad de Granada UCA, para chatarra. Estos son ya desechados sin nada que se pueda volver a reutilizar y/o aprovechar.\nTodo comienza cuando una vez rellenado nuestro formulario de petición de recogida (petición de recogida)nos lo remiten vía correo, y llegándonos una notificación por parte del departamento o facultad que desea dar de baja esos componentes informáticos, PC, pantallas, proyectores, periféricos, etc. Con esa petición y detallando lo que quieren desechar, lo pasamos a un sistema de tickets con Redmine para asignarnos esa tarea, gestionarla y darle un seguimiento interno.\nLas notificaciones de entrada van sincronizadas en un documento de Google y del que, por unos scripts, se envía día, código, personal y hora en el que nos pasaremos a realizar dicha recogida de material. Decir también que a veces nos llegan peticiones de material que no tiene nada que ver con lo informático, esas peticiones van directamente por notificación automática a la UCA para que avisen a la empresa de residuos directamente.\nA lo largo de estos años hemos realizado 20 campañas de donación y también hemos donado material a varios centros escolares. Dotándolos de un aula informática totalmente funcional con estos equipos. Destacar que gracias al trabajo de limpieza, configuración y a la instalación de distribuciones GNU/Linux, estos ordenadores funcionan perfectamente, dándoles una segunda oportunidad gracias al Software Libre y permitiendo que entidades sin ánimo de lucro o colegios con carencia de recursos, puedan beneficiarse de esta gran iniciativa por parte de la OSL.\n\n\t\t\n\t\t\t#gallery-1 {\n\t\t\t\tmargin: auto;\n\t\t\t}\n\t\t\t#gallery-1 .gallery-item {\n\t\t\t\tfloat: left;\n\t\t\t\tmargin-top: 10px;\n\t\t\t\ttext-align: center;\n\t\t\t\twidth: 33%;\n\t\t\t}\n\t\t\t#gallery-1 img {\n\t\t\t\tborder: 2px solid #cfcfcf;\n\t\t\t}\n\t\t\t#gallery-1 .gallery-caption {\n\t\t\t\tmargin-left: 0;\n\t\t\t}\n\t\t\t/* see gallery_shortcode() in wp-includes/media.php */\n\t\t\n\t\t\n\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\t\n\t\t\t\tHackaton4\n\t\t\t\t\n\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\t\n\t\t\t\tHackaton5\n\t\t\t\t\n\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\t\n\t\t\t\tHackaton\n\t\t\t\t\n\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\t\n\t\t\t\tHackaton6\n\t\t\t\t\n\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\t\n\t\t\t\tHackaton1\n\t\t\t\t\n\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\t\n\t\t\t\tHackaton2\n\t\t\t\t\n\t\t\t\n\t\t\t\t\n\t\t\t\n\t\t\t\t\n\t\t\t\tHackaton3\n\t\t\t\t\n\t\t\t\n\t\t\n\nEsperamos volver a repetir esta gran experiencia en la que, a parte de recibir un poco de ayuda para sacar adelante estos equipos, también se han beneficiado quienes acuden a él. Aprendiendo sobre hardware (limpieza y recambio de periféricos) y software (instalación y configuración) de una distribución GNU/Linux. En este caso hemos optado por instalarles Lubuntu, una distribución de Ubuntu con el escritorio LXDE y que precisamente permite que funcione muy bien en equipos con bajos recursos como los que tenemos, y a los que ya no soportan software privativo, como es Windows 7, 8 o 10.\nMientras tanto, JJ, Nuria, Pablo, José Alonso, Germán, Alejandro y un servidor seguiremos trabajando en pos del Software Libre, la transparencia, los datos abiertos, la liberación de proyectos, la ayuda y soporte a estudiantes, las charlas, los talleres, los campus de verano y en definitiva dando el callo día a día por un futuro más Libre.\nFelices fiestas.\n                                      "], "listaEtiquetas": [" almacén ", " distro ", " evento ", " hackaton ", " hardwarelibre ", " HDD ", " lubuntu ", " pantalla ", " PC ", " perifericos ", " ram ", " recicla ", " reciclaje ", " recogidas ", " reutilizar ", " SoftwareLibre ", " taller ", " ubuntu "], "listaCategorias": [" Distribuciones ", " Donación de equipos ", " Hackathon ", " hardware ", " Reciclaje ", " Software Libre ", " Talleres "]}{"autor": ["Manu"], "titulo": ["Próxima reunión de Perl (29 noviembre)"], "contenido": ["\r\n              Seguimos con las reuniones sobre este lenguaje de programación Perl, en la Oficina de Software Libre de la Universidad de Granada, edificio (CEVUG) Calle Real de Cartuja 36-38.\nPerl es un lenguaje “la navaja suiza de los lenguajes de programación”, cogiendo cosas de lenguajes como C o lenguaje interpretado Bourne Shell y en menor grado de otros lenguajes de programación.\nUn lenguaje con más de 20 años da una idea de la importancia y el enorme desarrollo que lleva a sus espaldas. Creado por Larry Wall anunciando la versión 1.0 el 18 de diciembre de 1987 mientras trabaja como programador en Unisys y expandiéndose rápidamente en los siguientes años.\nA partir de la versión 2 publicada en 1988 aportó un mejor motor de expresiones regulares, en la versión 3 del siguiente año, 1989, añadió soporte para datos binarios, con estos datos se puede observar como va mejorando a cada nueva versión.\n\nA día de hoy con la versión 6 totalmente completa y mantenida e incluyendo soporte Unicode, Hilos (threads), un soporte importante para la programación orientada a objetos.\nDestacar que en nuestra ciudad, Granada, se realizo hace un año el YAPC::Europe 2015. Un evento muy importante y que atrae a usuarios, desarrolladores, etc. de todas las partes del mundo. Dicho evento esta organizado por The Perl Foundation y se viene realizando desde el 24 de junio de 1999, celebrado en la Universidad Carnegie Mellon en Pittsburgh, Pensilvania.\nPróxima reunión\nDentro de las reuniones mensuales de los perl mongers de Granada, en esta ocasión veremos cómo se puede usar Git::Hooks para escribir todo tipo de “hooks” para nuestro repositorio en git, desde firmar con nombre completo los commits hasta comprobar la ortografía.\nComo todas las reuniones de Perl, te podrás llevar el portátil propio para probar. Se recomienda tener algún conocimiento de este lenguaje o de lenguajes con sintaxis similar, pero todo el mundo con cualquier conocimiento del lenguaje es bienvenido.\n29 de noviembre de 12:30 a 14:00h Metup “ganchos de git en Perl”\n                                      "], "listaEtiquetas": [" charla ", " code ", " granada ", " lenguaje ", " mongers ", " perl ", " programación ", " reunion "], "listaCategorias": [" OSL ", " Talleres "]}{"autor": ["Manu"], "titulo": ["Hackaton-instalación de Lubuntu 16.04.1"], "contenido": ["\r\n              \nEl día 13 de diciembre a las 9:30h., en el almacén de la Oficina de Software Libre, sito en el edificio CEVUG en C/ Real de Cartuja 36-38 bajos, vamos a realizar un hackaton sobre ordenadores recuperados de diversas facultades de la Universidad de Granada y que, después de enviarnos una orden de recogida, pasamos a recoger y trasladar a este almacén. Cómo realizamos el pasado hackaton día 19 de abril la participación es libre y puede venir quién quiera aunque no pertenezca a la Universidad de Granada.\n\nLo que planteamos es recuperar el mayor número posible de ordenadores, impresoras y periféricos. Los limpiaremos y añadiremos pasta térmica en los chipset para que disipen mejor el calor, ya que después de la larga vida de estos ordenadores y de un largo periplo por oficinas, salas, etc,. vienen algo deteriorados.\nVamos a instalar una imagen de Lubuntu 16.04.1 siendo esta distribución, basada en GNU/Linux, la última versión estable LTS y con soporte para unos cuantos años todavía.\nOptaremos por LXDE, ya que es un escritorio (shell) que no precisa de muchos recursos a nivel de hardware (procesador, memoria RAM).\nEsperamos que sea un día divertido cacharreando con piezas, carcasas, tornillos, ventiladores, etc, etc… Cómo fue el anterior hackaton, fotos en nuestra galería\n\nSe recomienda traer unos guantes finos para no lesionarse, cortarse sobre todo, ya que las tapas de los PC tienen mala baba.\nLas herramientas necesarias, el espacio y el buen rollo de los componentes de la OSL lo llevaremos por default 😀\nSólo pedimos una inscripción, no obligatoria, para tener una idea de cuántas personas acudirán a este hackaton:\nRegistro:\nhttps://www.meetup.com/es-ES/Granada-Geek/events/235730151/\n                                      "], "listaEtiquetas": [" cacharreo ", " GNU ", " granada ", " hackaton ", " impresoras ", " linux ", " lubuntu ", " ordenadores ", " perifericos ", " procesador ", " ram ", " ubuntu "], "listaCategorias": [" Distribuciones ", " Eventos ", " Hackathon ", " hardware ", " OSL ", " Reciclaje ", " Software Libre ", " Talleres "]}{"autor": ["Manu"], "titulo": ["Actualizar la Bios en un Lenovo Think Pad desde Ubuntu "], "contenido": ["\r\n              \nAlgo que siempre se ha asociado al sistema operativo Windows es, entre otras cosas, la actualización de la Bios.\nCuando adquirí mi portátil lo primero que hice, antes de eliminar Windows, fue actualizar todo lo actualizable desde ese sistema. Después ya instale Ubuntu 15.04 o la 15.10 con Gnome.\nPues bien, el tema esta en que una vez que la versión 16.04 ya paso a estable me salían un par de errores referentes a Intel, decir que mi portátil es un Think Pad X1 Carbon de 3ª generación con un Intel Core i7-5600U CPU @ 2.60GHz x 4 y que tiene menos de 1 año desde que lo compre. Decir también que funciona extraordinariamente bajo GNU/Linux y no hay nada que envidiar a otros sistemas operativos ni Hardware existentes en el mercado., pues bien, estuve buscando soluciones en la red y también expuse lo que me sucedía en Launchpad y foros especializados en GNU/Linux. Mi pequeña obsesión por tener siempre lo último, o lo más actualizado posible, me llevo a encontrar un tutorial sobre como actualizar la Bios desde GNU/Linux, cosa rara, ya que normalmente es algo peliagudo de realizar y ya no digamos desde cualquier distribución GNU/Linux.\nEste tutorial dice lo siguiente:\nEntrar en la web de Lenovo para descargar el archivo más reciente de nuestro modelo de portátil.\nDescargar el archivo ISO más reciente, nombrado como Bios Update (Bootable CD)\nConvertir ese archivo ISO en un .img con la utilidad geteltorito, si no la tienes instalar con un simple:\nsudo apt install genisoimage\nejemplo del comando para crear el bios.img:\ngeteltorito -o bios.img n14ur11w.iso\nInsertar una memoria USB, teniendo en cuenta que el .img que generamos no pesa más de 40 o 50 MB.\nComprobar muy bien donde nos monta el USB para crear con él un booteable con el bios.img, por ejemplo yo lo llevaba en Descargas:\ncd Descargas\nCon el comando dd realizamos el proceso:\ndd if=bios.img of=/dev/sdb bs=1M\nReiniciamos el portátil y con F12 booteamos.\nYo tuve que entrar en la Bios y volver a activar el Secure boot y cambiar al modo UEFI desde Legacy mode, ya que he preferido tenerlo así. Además es una tontería mantener una Bios con estos sistemas de control por parte de Windows.\nSi no cambiamos estos valores nos nos dejará bootear y por tanto actualizar la Bios.\n\nUna vez cambiando y guardado volvemos a reiniciar y entrar con el USB. Se nos abrirá un menú con 3 sub-menús.\nDejar el USB hasta después del reinicio que es cuando se actualizará la BIOS, de hecho yo no lo quite hasta cambiar de nuevo la BIOS al modo Legacy y estar ya en mi flamante Ubuntu 16.04 con Gnome.\nLa versión que tenía de la Bios era la 1.10:\nsudo dmidecode -s bios-version sudo dmidecode -s bios-release-date\nN14ET32W (1.10 )\n08/13/2015\nY ahora llevo la última 1.12, pero ha habido como 4 versiones intermedias entre una y otra:\nsudo dmidecode -s bios-version sudo dmidecode -s bios-release-date\nN14ET34W (1.12 )\n02/04/2016\nFeliz flasheo y leer siempre, siempre los Readme.\n                                      "], "listaEtiquetas": [" bios ", " bootear ", " dd ", " dmidecode ", " EFI ", " geteltorito ", " gnome ", " GNU ", " lenovo ", " linux ", " menus ", " secureboot ", " sudo ", " thinkpad ", " ubuntu ", " UEFI ", " windows "], "listaCategorias": [" Aplicaciones ", " Distribuciones ", " hardware ", " howtos ", " OSL ", " Software Libre "]}{"autor": ["German Martinez"], "titulo": ["Patrocinadores de la Oficina de Software Libre en el año 2017"], "contenido": ["\r\n              Desde la Oficina de Software Libre de la Universidad de Granada siempre hemos querido contribuir a la divulgación del conocimiento libre de una forma que fuera accesible a todo tipo de personas sin importar su procedencia o situación, solo el afán por adquirir conocimientos tecnológicos que puedan ayudar a contribuir a la sociedad; es por este mismo motivo que la gran mayoría de nuestras actividades son de carácter gratuito. Con la intención de que esto pueda seguir siendo así y además mejorar sustancialmente la oferta y variedad de dichas actividades nos hemos puesto en contacto con diferentes entidades para que valoraran la posibilidad de ofrecernos recursos a modo de patrocinio.\n\nTodas nuestras actividades tienen su correspondiente difusión antes, durante y después de las actividades mediante nuestros medios sociales:\n\nNuestra web, con unas 3000 visitas diarias y una posición destacada en las búsquedas de Google para los términos “oficina de software libre” o variantes de la misma como “software libre universidad” o “software libre hackathon”, y en la que igualmente compartimos las crónicas con las experiencias vividas de las actividades en las que participamos.\nNuestra página en Facebook con un alcance de algunos posts de 1500 personas, en la que también compartimos álbumes de fotos de nuestros eventos.\nNuestra cuenta de Twitter con más de seguidores, en la que además compartimos con regularidad una gran cantidad de noticias de actualidad e interés sobre el mundo tecnológico y social vinculados a la cultura libre.\nAsí como en el grupo de chat,usado tanto como medio de comunicación como para resolver dudas entre los más de 160 integrantes; el canal de noticias en Telegram, con más de 170 seguidores y más de 200 visualizaciones por mensajes; o el grupo Granada Geek en Meetup con 700seguidores a principios de marzo de 2017, usado generalmente como plataforma para gestionar y coordinar nuestros diferentes eventos. También participamos o hemos iniciado desde la OSL diferentes grupos de usuarios: Python, JavaScript, WordPress, Seguridad en Internet, Talleres de Robótica educativa y Chicas en la Tecnología.\nAdemás, también tienen difusión de forma habitual a través del Gabinete de Comunicación de la UGR y de forma puntual en la prensa nacional (La Vanguardia, El Mundo, ABC) y prensa local y regional (ABC de Sevilla, Ideal de Granada).\n\n\nActualmente contamos con 6niveles de patrocinio: silicio,cobre, bronce, plata, oro y estrella; estos distintos niveles obtienen desde el patrocinio participativo o exclusivo (en función del nivel de patrocinio) de actividades específicas como hackathones, jornadas o el certamen de proyectos libres hasta el patrocinio exclusivo y/o nombramiento del campus tecnológico de chicas, campus infantil de software libre o alguna de las campañas de recogida, reciclado y donación de material informático (más información sobre los niveles de patrocinio en este documento).Por el momento contamos con los siguientes patrocinadores:\nNivel oro:\n\nPerkinElmer: empresa estadounidense que opera en más de 150 países que tiene como principales campo de interés son la salud humana y ambiental, lo que incluye análisis ambiental, seguridad de productos alimenticios y de consumo, imágenes médicas, descubrimiento de fármacos, diagnósticos, biotecnología, aplicaciones industriales y ciencias de la vida. Además, producen instrumentos analíticos, pruebas genéticas y herramientas de diagnóstico, componentes de imágenes médicas, software, instrumentos y consumibles para múltiples mercados finales. Desde hace un tiempo, cada vez las empresas se preocupan más de analizar los factores inherentes que se encuentran en el entorno de la misma y que pueden tener algún impacto en su actividad, por eso una de las principales capacidades de Perkin Elmer se centra en ofrecer una amplia gama de tecnologías para apoyar la detección e identificación de enfermedades, contaminantes y vías biológicas que ayuden a los científicos, clínicos y profesionales de laboratorio a obtener las ideas necesarias para tomar decisiones importantes; usando para ello plataformas informáticas y de software que proporcionan flujo de trabajo eficiente, administración de datos, visualización y análisis para proporcionar información crítica y relevante. [Web / Twitter / Facebook]\nNivel plata:\n\nRTI (Real-Time Innovations): es una empresa con sede principal en California, pero que además cuenta con oficinas en Granada con una actividad centrada principalmente en el IoT (Internet of Things – Internet de las cosas), precisamente en este campo según publicaciones recientes como la revista Forbes, RTI fue nombrada como una de las 50 compañías más prometedoras en el campo del IoT, cuyoconcepto está relacionado con la posibilidad de que cualquier objeto pueda estar conectado a Internet, una idea impensable hace años al margen de ordenadores, y algo después en móviles y tablets, actualmenteha ampliado su ámbito a otros objetos cotidianos que puede ir desdepequeños o grandes electrodomésticos hasta vehículos o una casa por completo. En lo que IoT se refier, RTI se centra principalmente en el desarrollo de su solución “RTI Connext DDS”, una plataforma de conectividad para el IoT orientado a la industria profesional que destaca por surápidez, su capacidad para la escalabilidad, y todo ello en un entorno de gran seguridad. Todo este interés por la innovación se ve reflejado además en iniciativas como el Desafío Tecnológico de la ETSIIT, donde distintos grupos de alumnos estudiantes de carreras técnicas se enfrentan a problemas reales de ingeniería con el objetivo de encontrar la solución más óptima. [Web / Twitter / Facebook]\nNivel bronce:\n\nMicrosoft: aunque Microsoft no es especialmente conocida por tener un modelo de negocio abierto, sí es cierto y hay que decir en su defensa que cada vez realiza un mayor esfuerzo por poco a poco adaptarse a la filosofía open source en muchos de sus productos entre los que tenemos que recalcar sin duda Microsoft Azure (su plataforma abierta en la nube que destaca por permitir el uso de máquinas virtuales con distribuciones GNU/Linux). Todo esto se encuentra englobado dentro de la iniciativa Microsoft Openness, dando lugar también a la organización de eventos como DevOps OSS Azure Day, donde profesionales del mundo de la informática se reunen para conocer las nuevas tendencias DevOps haciendo un énfasis especial en el desarrollo open source en la nube. [Web / Twitter / Facebook]\n\nMagnolia CMS: sistema de gestión de contenidos que ha llegado a destacar por su gran facilidad de uso (algo que no es especialmente común en este sector), pero sin que eso impida obtener web complejas con un gran acabado profesional, contando con la ventaja de que a través de su página de edición el editor siempre sabrá que la vista del diseño actual es exactamente la misma que aparecerá para el visitante final de la web (sistema WYSIWYG, What You See Is What You Get – Lo Que Ves Es Lo Que Tienes). Esta flexibilidad ha hecho que Magnolia CMS sea la base de varias webs de instituciones gubernamentales tanto en los Estados Unidos como en España. Además, la apuesta que hacen por la innovación y el software libre (el propio CMS está basado en software libre) ha hecho que sean los patrocinadores de eventos como fue en I Certamen de Proyectos Libres de la UGR que organiza la propia OSL. [Web / Twitter / Facebook]\n\nUNIT4: es una multinacional de origen holandés que destaca por ofrecer sistemas ERP (Enterprise Resource Planning – Planificación de Recursos Empresariales) para la gestión global de las empresas y sus servicios asociados, pero que también ofrece soluciones para la dirección de finanzas y la dirección de recursos humanos. Un punto que hace destacar sus soluciones ERP es que son diseñadas y desarrolladas desde cero, pero siempre teniendo como eje central las personas que las van a utilizar, con eso en mente los resultados obtenido son rápidos de poner en marcha y cómodos en el uso diario; todo en única suite ERP integrada en la nube. Los beneficios de usar sus sistemas quedan palpables al comprobar que instituciones tan emblemáticas como la Universidad de Cambridge. [Web / Twitter / Facebook]\n\nFIDESOL: cuyo nombre completo es Fundación I+D del Software Libre, es una entidad sin ánimo de lucro vinculada con el software libre desde que este movimiento empezó a extenderse por Granada, siendo un centro de apoyo a la innovación tecnológica que ahora mismo cuenta con varias líneas de conocimiento que abarcan desde tecnologías móviles y aplicaciones ágiles en Internet hasta soluciones para empresas o virtualización entre otras. Ha colaborado con la propia OSL desde sus inicios habiendo patrocinado varios Certámenes de Proyectos Libres de la UGR entre otros eventos. [Web / Twitter / Facebook]\nNivel silicio:\n\nSI2 Soluciones: es también otra empresa granadina enfocada en el desarrollo web y de aplicaciones para empresas y profesionales que ha realizado trabajos para diferentes ayuntamientos, cajas de ahorros y universidades, partiendo siempre de un trabajo basado en el uso de tecnologías libres y estándares que les ayuden a proporcionar las mejores opciones a sus clientes. Es también un colaborador habitual de la OSL patrocinando eventos como el Certamen de Proyectos Libres de la UGR o el Campus Tecnológico UGR para Chicas. [Web / Twitter / Facebook]\n\nAxesor: es una empresa que se dedica al asesoramiento económico mediante la aportación de conocimiento y visión del entorno, de forma que facilite la toma de decisiones empresariales y el desarrollo de mercado así como la optimización de recursos de clientes. Además, ofrecen servicios de gestaría virtual y servicios de marketing que proporciona información nacional e internacional sobre empresas y autónomos para evitar riesgos de impagos y optimizar los tiempos de gestión haciéndose cargo de todas las gestiones con los organismos públicos. [Web / Twitter / Facebook]\n\nBitergia: empresa española dedicada al análisis de datos de comunidades de desarrollo de código abierto que cuenta con grandes clientes del sector tecnológico como son Red Hat, OpenStack o la fundación Wikimedia. Su trabajo consiste en producir datos y métricas sobre cómo se desarrolla un proyecto colaborativo, dichos datos pueden ser usados por los departamentos de recursos humanos para extraer conclusiones que les ayuden a optimizar los equipos de trabajo eligiendo a los componentes más adecuados para cada puesto. [Web / Twitter / Facebook]\n\nXimdex: es la empresa desarrolladora de la plataforma open source del mismo nombre, un gestor de contenido semántico que nos permite gestionar desde un mismo programa datos y contenido mediante servicios como buscadores inteligentes, agregadores de información o reconocimiento de imágenes y textos; consiguiendo así un acceso más simplificado a la información subyacente. Trabaja en distintos sectores como la administración, sanidad o educación con grandes clientes como la Administración General del Estado, Telefónica o la Junta de Andalucía. [Web / Twitter / Facebook]\nSiempre estamos abiertos y agradecidos de tener nuevos patrocinadores que nos ayuden en nuestra actividad diaria, por lo que continuamente tenemos activa como vía de contacto nuestro correo electrónico en caso de necesitar más información: osl@ugr.es.\n                                      "], "listaEtiquetas": [" patrocinadores ", " software libre "], "listaCategorias": [" Eventos ", " Mundo Libre ", " OSL ", " Reciclaje ", " Servicios ", " Software Libre "]}{"autor": ["admin"], "titulo": ["La Universidad de Granada, transparencia y datos abiertos."], "contenido": ["\r\n              A finales del año 2013, el equipo de Gerencia de la Universidad de Granada, encabezado por Andrés Navarro, encargó al Delegado del Rector para las TIC, D. José Luis Verdegay, la puesta en marcha del Portal de Transparencia de la UGRen vista de los malos indicadores de transparencia que tenía la UGR (según la Fundación Compromiso y Transparencia) y también del compromiso firme de la administración por mejorar esos indicadores y convertir nuestra universidad en una institución verdaderamente transparente.\nA diferencia de otras administraciones, que externalizaron la creación del portal de transparencia y del almacén de datos abiertos, nuestra Universidad de Granada apostó acertadamente por internalizarlo encargándonos a nosotros, la Oficina de Software Libre, la producción de ambos portales mientras que la producción y selección de los contenidos, como es natural, recaía en Secretaría General.\nInicialmente se trabajó con una serie de becarios en formación, como Jaime Torres, que hicieron un excelente trabajo y cuyo esquema se puede ver en esta presentación de 2014.\n\nNo solamente trabajamos en la transparencia, sino que lo hicimos desde el software libre, creando y liberando un portal de transparencia que todo el mundo puede usar, utilizando también para el portal de datos abiertos el estándar de la industria para datos abiertos: CKAN;así con nuestro software libre, todo el mundo puede crear su propio portal sin coste alguno. Está construido usando Node.js conrelativamente pocas dependencias, consiguiendo que se puedadesplegar fácilmente en cualquier servidor o incluso en sistemas PaaS como Heroku u OpenShift.\nCon este trabajo realizado aquí, en poco tiempo pasamos de ser una institución tan opaca como el resto de las instituciones granadinas a la institución pública más transparente de la provincia, como así reconocieron periodistas como Incho Cordero, que tituló ya en el año 2015 el artículo“La Universidad, el camino a seguir”. No sólo liberamos todos los conjuntos de datos recomendados por todas las administraciones y organismos (aparte de algunas peticiones específicas de la Mesa de Transparencia que se creó) y lo hicimos con un software libre, sino que además nos acercamos a la comunidad de activistas de los datos abiertos en una serie de hackathones, como el Open Data Day (con crónica en Granada en Datos) y otra serie de eventos destinados a llevar a cabo esas políticas activas de transparencia, como este portal que analiza todas las carreras y su diferencia por sexos y que llevamos a cabo en las jornadas del año siguiente.\nLa Rectora Dª Pilar Aranda ha seguido apostando por la transparencia, con la creación de un área específica dependiente de la Secretaría General con el que seguimos trabajando para mantener los datos vivos, porque una de las claves de la transparencia es que los datos sean relevantes y actuales, a la vez que apoyamos iniciativas como LiveMetrics, que como se puede ver cuando pulsas en Link Dataset Source en la página de indicadores se alimenta y trabaja con el portal de Open Data, producido y mantenido por la OSL.\n\nRecientemente, este esfuerzo de la UGR ha sido premiado por el último ránking de la Fundación Compromiso y Transparencia, reconociendo a la UGR como “Transparente” y no sólo eso, como una de las universidades que más ha aumentado en transparencia. Eso es gracias al trabajo colectivo de la Oficina de Software Libre con el apoyo inestimable del resto de la Delegación de la Rectora para la Univesidad Digital y la todo la UGR, incluyendo el CSIRC, Gerencia y por supuesto Secretaría General, que es la que lo coordina todo. Así que sirva este post para expresar nuestra alegría por el trabajo reconocido y también este agradecimiento al resto del colectivo universitario que nos ha ayudado en este camino.\nPD: Tenéis esta galería del OpenDataDay, donde trabajos los últimos conjuntos de datos indicados.\nPero no podemos pararnos ahí. Desde la OSL y el resto de la UGR seguimos trabajando en el tema y este mes de marzo celebraremos el siguiente Open Data Day, que anunciaremos próximamente y en que os animamos a participar. ¡Os esperamos!\n                                      "], "listaEtiquetas": [" datos abiertos ", " gobiernon abierto ", " open data ", " Open Data Day ", " transparencia "], "listaCategorias": [" Datos abiertos ", " Hackathon ", " medios ", " OSL "]}{"autor": ["Usuario Software Libre"], "titulo": ["XX Campaña “Ordenadores Libres con Software Libre”"], "contenido": ["\r\n              \n\n\n\n\n\nYa está abierta la decimoctava campaña de donación de material informático, tras las campañas I, II, III, IV, V, VI ,VII, VIII, IX, X, XI , XII , XIII , XIV , XV , XVI, XVII , XVIII y XIX en las que se han donado más de 490 equipos informáticos completos. En esta campaña, cuyas bases podéis consultar en la web, en esta Campaña contamos con ordenadores de sobremesa (Intel Celeron con 512 MB y Pentium IV con 1024 MB) e impresoras, que se pueden solicitar en el formulario .\nComo en la anterior campaña, se cuenta con el apoyo del resto de la Delegación de la Rectora para la Universidad Digital (DRUD), especialmente el CSIRC, Gerencia y la Unidad de Calidad Ambiental de la UGR. Los únicos requisitos para recibir la donación, aparte de lo indicado en las bases, es asistir al taller de formación sobre el uso de los equipos y comprometerse a retirar personalmente los equipos, a parte de documentar la instalación en la sede de la entidad receptora, mediante la publicación de una noticia de los equipos entregados y publicarlo en la web o los medios sociales de los que la entidad disponga. Siendo también necesario publicar la asignación de material antes del taller. La campaña termina el día 2 de diciembre de 2016, en los días siguientes a esa fecha de cierre de la campaña se les comunicará a las asociaciones solicitantes, mediante correo electrónico, los equipos que les han sido concedidos, y en los días sucesivos, según se confirmen o no las aceptaciones de las donaciones, al resto. El taller de introducción a Ubuntu 16.04 ó Q4OS tendrá lugar en la Oficina de Software Libre el 19 de diciembre de 2016. Aún así se comunicará el día mediante correo electrónico a las asociaciones beneficiadas, por si hubiese cambios de última hora. La asistencia al mismo es obligatoria y la publicación previa de la asignación en la web (como viene reflejado en las bases). Resumiendo:\n\nRellena elformulario solicitando los equipos que desees.\nPara facilitar el uso de los equipos se ha desarrollado un manual de usuario para esta XX Campaña y otro documento para configurar los equipos en red.\nPuedes ver un vídeo con uno de los equipos de campañas anteriores en funcionamiento.\nEn la galería de la OSL puedes encontrar fotografías tomadas en campañas anteriores.\n\n\n\n\n\n\n\n                                      ", "<section class=\"entry-content \"><a href=\"http://osl.ugr.es/wp-content/uploads/2016/11/photo51504960507062675.jpg\" class=\"grouped_elements\" rel=\"tc-fancybox-group7668\"><img class=\"size-medium wp-image-7669 aligncenter\" src=\"http://osl.ugr.es/wp-content/uploads/2016/11/photo51504960507062675-300x223.jpg\" alt=\"photo51504960507062675\" width=\"300\" height=\"223\" srcset=\"http://osl.ugr.es/wp-content/uploads/2016/11/photo51504960507062675-300x223.jpg 300w, http://osl.ugr.es/wp-content/uploads/2016/11/photo51504960507062675.jpg 400w\" sizes=\"(max-width: 300px) 100vw, 300px\"></a>Como en la <a href=\"http://osl.ugr.es/2016/10/06/xix-campana-ordenadores-libres-con-software-libre/\"><strong>anterior camp</strong><strong>aña</strong>,</a> se cuenta con el apoyo del resto de la <strong><a href=\"http://udigital.ugr.es/\">Delegación de la Rectora para la Universidad Digital (DRUD)</a></strong>, especialmente el <strong><a href=\"http://csirc.ugr.es\">CSIRC</a></strong>, <strong><a href=\"http://gerencia.ugr.es\">Gerencia</a></strong> y la <strong><a href=\"http://www.ugr.es/pages/servicios/uca\">Unidad de Calidad Ambiental</a></strong> de la <strong><a href=\"http://www.ugr.es\" target=\"_blank\">UGR</a></strong>. Los únicos requisitos para recibir la donación, aparte de lo indicado en las bases, es asistir al taller de formación sobre el uso de los equipos y comprometerse a retirar personalmente los equipos, a parte de documentar la instalación en la sede de la entidad receptora, mediante la <strong>publicación</strong> de una <strong>noticia</strong> de los equipos entregados y publicarlo en la web o los medios sociales de los que la entidad disponga. Siendo también necesario publicar la asignación de material antes del taller. La campaña termina el día <strong>2 de diciembre de 2016,</strong> en los días siguientes a esa fecha de cierre de la campaña se les comunicará a las asociaciones solicitantes, mediante correo electrónico, los equipos que les han sido concedidos, y en los días sucesivos, según se confirmen o no las aceptaciones de las donaciones, al resto. El taller de introducción a <strong><a href=\"http://es.m.wikipedia.org/wiki/Ubuntu\">Ubuntu 16.04</a> ó Q4OS </strong>tendrá lugar en la Oficina de Software Libre el <strong>19 de diciembre de 2016</strong>. Aún así se comunicará el día mediante correo electrónico a las asociaciones beneficiadas, por si hubiese cambios de última hora. <strong>La asistencia al mismo es obligatoria y la publicación previa de la asignación en la web </strong>(como viene reflejado en las bases). Resumiendo:\n<ul>\n<li>Rellena el<a href=\"https://goo.gl/forms/0PX38CRgqBi22K1D2\"> formulario </a>solicitando los equipos que desees.</li>\n<li>Para facilitar el uso de los equipos se ha desarrollado un <a href=\"https://docs.google.com/document/d/17YlUjaeCV-xlRec2LovJGzJSJm0wlJzsvOUVgOt2fUo/edit?usp=sharing\">manual de usuario</a> para esta XX Campaña y otro documento para <a href=\"http://sl.ugr.es/ConfiguracionRedPcDonados\">configurar los equipos en red</a>.</li>\n<li>Puedes ver un vídeo con uno de los <a href=\"http://www.youtube.com/watch?v=9bhCJ5zZgp8\" target=\"_blank\">equipos de campañas anteriores en funcionamiento</a>.</li>\n<li class=\"breadcrumb-trail breadcrumbs\">En la <a href=\"http://osl.ugr.es/galeria/index.php/\" target=\"_blank\">galería de la OSL</a> puedes encontrar fotografías tomadas en campañas anteriores.</li>\n</ul>\n</section>"], "listaEtiquetas": [" donación ", " GNU ", " linux ", " q4os ", " ubuntu "], "listaCategorias": [" OSL "]}