{"autor": ["admin"], "titulo": ["Jornada dedicada a la Docencia para la Igualdad entre Mujeres y Hombres en Tecnología y Actuaciones para Mitigar el Abandono en los Primeros Cursos"], "contenido": ["El viernes 30 de junio, y como preludio al ", " de este año, se celebrará la “", "“.", "El evento está coordinado por la ", ", y tendrá lugar en el Salón de Grados de la ", ", a partir de las 10:00 AM.", "El programa constará de charlas mostrando diversas perspectivas sobre el tema y una mesa redonda.", "10:00 – 10:45 Joaquín Fernández Valdivia, director de la ETS de Ingenierías Informática y de Telecomunicación.", "10:45 – 11:15 Pausa.", "11:15 – 12:00 Carmen Guidet Gómez, estudiante de Telecomunicaciones, representante de la ", ".", "12:00 – 13:30 Marta García Gomez, ", "y ", "; Cristina Heredia de ", ", Paula de la Hoz de ", ", Ceci Merelo Molina, ", " Cristina Martín Romera, ", ".", "La entrada es libre hasta que se agoten las localidades, pero se aconseja reservar plaza gratuitamente a través de ", "."], "listaEtiquetas": [" campus tecnológico para chicas ", " diversidad ", " Tecnología "], "listaCategorias": [" Eventos ", " Mundo Libre "]}{"autor": ["Manu"], "titulo": ["Proyectos del Campus Tecnológico para Chicas Ugr "], "contenido": ["Hace tan sólo unos pocos días que finalizó el IV Campus Tecnológico UGR para chicas #sereingeniera17 y paso a contaros detalles, proyectos, etc, y muchas fotos.", "Lo primero es agradecer desde la Oficina de Software Libre a los patrocinadores que han apoyado esta iniciativa y sin la cual hubiese sido misión imposible llevar a cabo el proyecto:", "Aún así este año el Campus ha contado con profesoras que, o bien son estudiantes de la carrera Ingeniería Informática y  Telecomunicaciones,  o han terminado sus estudios graduándose en ella, siendo esta en la que se ha desarrollado dicho campus, ", " y al cual agradecemos tanto a su director D. Joaquín Valdivia, como a la Vicerrectora de ", "Las profesoras han sido ", ", ", ", ", "  que aparecen portando un ramo de flores, cortesía de la Oficina de Software Libre, y en particular de su Director ", ".", " ", "Foto por ", "Han realizado un trabajo impecable, tanto en el trato con las chicas como el propio desarrollo de los proyectos y en la enseñanza de programas como Scratch, Gimp, AppInventor, Inskcape, Atom, Firefox, todos ellos programas libres, al igual que la distribución que utilizaron, Ubuntu 16.04 LTS.", "Siendo unas 38 chicas las que han podido acceder al campus se quedaron fuera otras tantas en la criba de selección, por lo cual se realizo un Clinic de una tarde para enseñarles algunos programas y explicarles que se hace en un campus tecnológico y que se estudia en la carrera de Ingeniería Informática.", "Foto por ", "quedando todas ellas muy contentas de poder asistir y formar parte de una tarde de programas como ", ", ", " en programación orientada a objetos, hasta un algoritmo realizando", ".", "Sobre los proyectos realizados y presentados el día de la clausura tenemos:", " ", "2.", "Realizado con Arduino y que esquiva obstáculos en su camino por un sensor de ultrasonidos.", " ", "3.", "Videojuego realizado con Scratch y ", " que nos permite descubrir nuevos mundos en cada uno de sus niveles.", " ", "4.", "Pompero realizado con Arduino. Un sistema automático que nos permitía hacer pompas de jabón gracias a los dos servos que ejecutan el movimiento articulado del pompero y un ventilador que se activa para realizar las pompas.", " ", "5.", "Videojuego realizado en Scratch y Arduino Esplora. El objetivo de este  videojuego de plataforma es recoger todas las monedas posibles sin caer.", " ", "6.", "Aplicación realizada con ", ". Permite realizar fotografías a prendas de ropa y clasificarlas según su estilo para conformar una galería personalizada de nuestro armario de ropa.", " ", "7.”", "Coche realizado con Arduino que esquiva obstáculos en su camino y emite sonidos.", " ", " ", "8.", "Aplicación móvil realizada con AppInventor. Red social que nos permite  registrarnos, crear y leer archivos, realizar fotografías, visualizar la galería y también cuenta con un chat.", " ", "9.”", "” ", "Aplicación móvil multitemática realizada con AppInventor. Incluye una opción para ver los hits del momento en YouTube, una pestaña para juegos desde la cual se pueden lanzar videojuegos creados con Scratch. También permite tener una cuenta de usuario con login y su propio perfil.", "Esperamos que todas las alumnas de este Campus y el Clinic se lo hayan pasado muy bien y, sobre todo, hayan podido comprobar que realizar proyectos en equipo, con herramientas y programas libres, con programas para desarrollar programación, con Scratch, WoofJS, con placas Arduinos, sensores, baile e ilusión, todo es posible.", "Hasta el próximo Campus.", "P.D. La mayoría de fotos ha sido gracias a Braulio Vargas y Marta Gómez, ", "."], "listaEtiquetas": [" appinventor ", " arduino ", " campus ", " chicas ", " game ", " gimp ", " granada ", " inkscape ", " robots ", " sensores ", " Tecnología ", " videojuegos ", " woojs "], "listaCategorias": [" Formación ", " OSL ", " proyectos ", " scratch ", " Software Libre "]}