{"autor": ["Maribel García Arenas"], "titulo": ["Felicita las Fiestas con Software Libre"], "contenido": ["\r\n              \nOs presentamos un generador de felicitaciones con motivos navideños hecho desde la Oficina de Software Libre para cualquier usuario, tanto de dentro de la Universidad de Granada como de fuera de ella.\nLos pasos a seguir son muy sencillos:\n\n . Elige la imagen que más te guste.\n . Personaliza el texto de tu felicitación.\n . Usa el botón “Actualizar Imagen” para ver cómo queda tu felicitación.\n . Usa el botón “Descargar Imagen” para descargarla y guardarla en formato jpg para enviarla a quien quieras.\nPulsa en la imagen que más te guste para comenzar.\n\n  \n\n\n\nRecuerda, si te ha gustado recomiéndalo y comparte con amigos y familiares, o puedes mandarnos tus comentarios a nuestras redes sociales:\n \nEl código de este generador lo podéis ver, consultar, descargar, mejorar y comentar en el repositorio de la Oficina de Software Libre.\n\n                                      "], "listaEtiquetas": [], "listaCategorias": [" OSL "]}{"autor": ["Bryan Moreno"], "titulo": ["El Software Libre se puede enseñar también con humor"], "contenido": ["\r\n              \n\nDesde esta oficina tenemos como principal objetivo enseñar y promocionar el Software Libre. Para ello no sólo lo enseñamos o lo recomendamos, sino que también lo usamos para hacer humor con él. Por esta razón, queremos presentar a JC Cabezacuadrada que será el personaje de nuestras tiras cómicas de ahora en adelante.\nJC es una persona reticente al cambio, que no le gusta que alguien le enseñe nada nuevo y que sigue anclado en una época en la que nada se mueve, sin darse cuenta de que todo evoluciona continuamente.\nEn nuestra primera tira, que agradecemos al CEPRUD, Centro de Producción de Recursos para la Universidad Digital, queremos poner de manifiesto que Android, el sistema operativo más utilizado en dispositivos móviles está basado en Linux, el Sistema Operativo Libre por excelencia.\nAndroid es un sistema operativo que Google dio a conocer en 2007 de la mano de la Open Handset Alliancey que se presentó con la garantía de estar basado en Linux. Lo que quiere decir, que si Android es bueno, Linux no será tan malo, puesto que el núcleo de Androidutiliza esta base.\nAún así, la mayoría de los usuarios, como JC Cabezacuadrada, noconocen esta realidad y piensan que Linux es un sistema operativo lejano a su vida diaria y al que no tienen ninguna vinculación. Para desmentir este hecho, sólo comentar dos datos de este mismo año, el primero es que el,1% de los dispositivos móviles vendidos a nivel mundial tienen Android y el segundoes que en España este porcentaje asciende hasta más del%.\nAndroid es un sistema operativo libre y de código abierto liberado con licencia Apache, pero en casi el 100% de los casos los fabricantes lo distribuyen con aplicacionesque no mantienen esa filosofía, aunque por eso no deja de ser un buen sistema operativo que ha triunfado en el mercado mundial.\nSi te ha gustado esta entrada, no olvides recomendarla a tus conocidos a través de tus redes sociales o siguiendo a nuestro personaje estrellaJC Cabezacuadradao simplemente díselo a su creador,JABque estará vinculado a nosotros en este proyecto.\n                                      "], "listaEtiquetas": [], "listaCategorias": [" humor ", " OSL "]}{"autor": ["José Alonso"], "titulo": ["Formulario de solicitud  III Campaña UGR-UNIA de Ordenadores Libres con Software Libre"], "contenido": ["\r\n              \nYa está abierto el plazo de solicitud de material informático para Asociaciones, ONGs o AMPAS en la III Campaña UGR-UNIA de Ordenadores Libres con Software Libre.\n\nInscríbete\nBases de la campaña\n                                      "], "listaEtiquetas": [], "listaCategorias": [" OSL "]}{"autor": ["José Alonso"], "titulo": ["Linux Lite 3.4. “Simple, fast, free”"], "contenido": ["\r\n              Desde la Oficina de Software Libre una de las actividades que más tiempo llevamos realizando es la donación de material informático reciclado y equipado con Software Libre. El fin es ayudar a asociaciones sin ánimo de lucro, ONGs o asociaciones de madres y padres de centros de enseñanza dotándolos con este material.\nEn estas campañas, patrocinadas por UGR SOLIDARIA o la Universidad Internacional de Andalucía, UNIA, se donan ordenadores, monitores, impresoras y proyectores para que puedan seguir desarrollando su labor social o educativa.\nSe trata de material descatalogado, principalmente por parte de la Universidad de Granada así como de diferentes particulares, que tras ser recogido, reparado (si fuera necesario) y puesto en funcionamiento con Software Libre por los técnicos de la Oficina permitiendo optimizar el rendimiento de estos equipos y devolver en muchos casos el material donado a su vida útil.\nPara el año 2017, se ha utilizado como sistema operativo Linux Lite 3.4. que como su mismo eslogan indica es Simple, rápido, libre (Simple, fast, free). Se trata de una distribución especialmente indicada para instalar en equipos con bajos recursos y que rinden mejor con este tipo de distribuciones.\n\n\nSi hablamos de Linux Lite, tenemos que comenzar señalando que es una distribución Gnu/Linux basada en Ubuntu 16.04.2 LTS (Long Term Support). Al ser una versión LTS, se ofrece soporte para al menos 5 años. Esta distribución posee un escritorio catalogado como Xfce (https://es.wikipedia.org/wiki/Xfce), que está especialmente indicado para usuarios que no han utilizado antes sistemas basados en Gnu/Linux o aquellos que quieren dar una segunda oportunidad a esos equipos almacenados en un armario.\nOtro punto a favor es que trae instaladas una gran variedad de herramientas (Firefox, LibreOffice, VLC y Thunderbird entre otros), lo que permite poder a trabajar con el equipo desde un primer momento.\nComo punto final, destacar que tan sólo es necesario 512 MB y un simple procesador de 700 MHz, y que se dispone tanto de una extensa documentación como de un un propio gestor de software, que nos facilita la tarea de tener nuestro equipo perfectamente actualizado.\nPara quienes se han decidido a probarla o quieren más información, en este enlace podrán descargarla. Más información en Linux Lite.\n                                      "], "listaEtiquetas": [], "listaCategorias": [" Distribuciones ", " Donación de equipos ", " OSL ", " Software Libre "]}{"autor": ["José Alonso"], "titulo": ["III Campaña UGR-UNIA de Ordenadores Libres con Software Libre "], "contenido": ["\r\n              Tras las múltiples peticiones en las dos campañas anteriores de asociaciones y ONGs, así como las necesidades específicas de las mismas, la Oficina de Software Libre de la UGR junto con la Unidad de Calidad Ambiental(parte delSecretariado deCampus Saludable)y la Universidad Internacional de Andalucía lanzan la III Campaña UGR-UNIA de Ordenadores Libres con Software Libre, lasbases de la misma se pueden consultar aquí.\nSe donarán 20 equipos informáticos con software libre asi como otro tipo de material informático (pantallas, proyectores, impresoras, portátiles)a diferentesasociaciones y ONGs, evaluadas según un orden de prioridad dentro de las solicitantespara lo que seestudiará las que tengan un mayor grado de necesidad para la realización de su actividad cotidiana. Para solicitar uno de estos lotes, solo hay que rellenar este formulario a partir del 3 de noviembre de 2017.\nDurante la primera semana de diciembre se comunicará a los solicitantes el resultado de su solicitud de concesión o no de dicho material informático. La recogida de los ordenadores se realizara en la Oficina de Software Libre, para lo que deberáacudir una persona responsabledesignada por los solicitantes a laOficina de Software Libre(Calle Real de Cartuja, 36-38, Edificio CEPRUD), tras un pequeño taller impartido por el personal de la propia Oficina de Software Libre en el que se explicará el sistema operativo y el resto de software libre instalados, los beneficiarios podrán proceder a retirar los equipos. La asistencia al taller es obligatoria, para cualquier duda o incidencia se puede consultar por correo a la direcciónosl@ugr.es.\n\n                                      "], "listaEtiquetas": [], "listaCategorias": [" OSL "]}{"autor": ["Pablo Hinojosa"], "titulo": ["El Certamen de Proyectos Libres de la UGR se declara desierto"], "contenido": ["\r\n              Todos los años se inscribe un número bastante elevado de participantes en el Certamen de Proyectos Libres de la UGR, la mayoría, lógicamente, alumnos de la propia universidad.\nEste año, concretamente, se han inscrito un total de 35 proyectos. \nSin embargo, el Certamen es un reto exigente, que requiere de un compromiso constante durante los meses en los que que se lleva a cabo. No se necesita una gran dedicación en tiempo o esfuerzo, pero sí una cierta constancia y proyección a largo plazo. En cierto modo, es una carrera de fondo. Es por esto que lo habitual es que muchos de los proyectos que se inscribieron en un principio vayan abandonándose, siendo olvidados o dejados un poco de lado por sus propios autores.\nAdemás los abandonos por baja voluntaria y declarada, el primer filtro para verificar qué proyectos continúan activos es, según se detalla en las bases del certamen, solicitar a los participantes que presenten un informe obligatorio en el que se describe el proyecto y los avances efectuados durante los meses del Certamen: La mayor parte de los que no presentan este informe (todos lo que no lo presentan, en realidad) es porque han abandonado el Certamen.\nEso mismo ha ocurrido este año: Algunos de los proyectos inscritos han abandonado el Certamen de forma activa, y otros muchos lo han hecho pasivamente al no enviar el informe final.\nDesafortunadamente, los pocos proyectos que han quedado no cumplen los requisitos mínimos de calidad y desarrollo que este Certamen exige (lo que no implica que sean malos o deficientes en sí mismos), por lo que el calendario de actos del Certamen de Proyectos Libres de la UGR deja de tener sentido y se cancela.\nSentimos las molestias que esto pueda causar.\nAdemás, lógicamente, los premios de este Certamen se declaran oficialmente desiertos.\n                                      "], "listaEtiquetas": [], "listaCategorias": [" Certamen UGR de proyectos Libres ", " OSL "]}{"autor": ["Cristina"], "titulo": ["Desarrollo de la Jornada dedicada a la Docencia para la Igualdad entre Mujeres y Hombres en Tecnología y Actuaciones para Mitigar el Abandono en los Primeros Cursos"], "contenido": ["\r\n              El pasado viernes 30 de Junio, tuvo lugar la “Jornada dedicada a la Docencia para la Igualdad entre Mujeres y Hombres en Tecnología y Actuaciones para Mitigar el Abandono en los Primeros Cursos”, realizadas con la colaboración de la Fundación Española para la Ciencia y la Tecnología-Ministerio de Economía, Industria y Competitividad, el apoyo incondicional de la ETSIIT.\nLa jornada dio comienzo con la intervención de Joaquín Fernández Valdivia, director de la ETS de Ingenierías Informática y de Telecomunicación. El director hizo énfasis en la importancia de tomar medidas ante el importante descenso en la matriculación de mujeres en carreras del sector tecnológico. Éste, lejos de resolverse, se está agudizando con el paso del tiempo. El desequilibrio entre la participación de ambos géneros perjudica al sector de las TIC, ya que una importante cantidad de talentos femeninos van destinados a otros sectores de forma desproporcionada.\n\nA continuación y en representación de la Delegación de alumnos de la ETSIIT, Carmen Guidet Gómez hizo una presentación exponiendo evidencias de la baja motivación y los escasos estímulos que se ofrecen a las mujeres desde pequeñas, enfocados a incrementar su interés por la tecnología. La presentación dio pie a una serie de breves debates, en los que se intentaron diagnosticar las causas de la escasa participación femenina y proponer medidas para fomentarla. Su presentación puede consultarse aquí.\n\nLos grupos Tech&amp;Girls, Python-Granada, Interferencias, GDG y la oficina de software libre fueron los encargados de cerrar la jornada, incorporando más datos, ideas y puntos de vista acerca de la problemática tratada. Presentando a sus respectivos colectivos, fomentaron la participación en las actividades que ofrecen para luchar contra la brecha participativa entre hombres y mujeres en el ámbito tecnológico. Las presentaciones se pueden descargar o consultar a través de los siguientes enlaces:\n\nMarta García Gomez (Python-Granada, G&amp;T Girls): Enlace a la presentación\nCristina Heredia (G&amp;T Girls): Enlace a la presentación\nPaula de la Hoz (Interferencias): Enlace a la presentación \nCecilia Merelo Molina (GDG): Enlace a la presentación\nCristina Martín Romera (OSL): Enlace a la presentación \n\nDesde la oficina de software libre, animamos a todos los lectores a informarse acerca de la problemática y participar en las actividades que se proponen para resolverla. Vuestra participación e interés son los que marcan la diferencia.\n                                      "], "listaEtiquetas": [], "listaCategorias": [" Eventos "]}{"autor": ["Pablo Hinojosa"], "titulo": ["El Gabinete de Acción Social oferta plazas para el Campus Tecnológico Infantil de Software Libre"], "contenido": ["\r\n              El Gabinete de Acción Social de la Universidad de Granada ha aprobado ofertar a todo el colectivo de empleados/as universitarios/as 100 plazas para los/as hijos/as de empleados/as universitarios/as en el Campus de Software Libre.\nPodrán solicitar estas plazas el personal de la Universidad de Granada que perciba sus retribuciones con cargo al Capítulo I y VI del presupuesto de la Universidad de Granada, contemplado en los criterios generales en el ámbito de personal aprobados por la Comisión de Acción Social, con fecha 11 de mayo de 2016.\nPara solicitar estas plazas es necesario realizar la inscripción en el Gabinete De Acción Social. Si ya se ha matriculado a través de nuestro formulario, inscríbase a través del G.A.S y comuníquenoslo para evitar duplicidades.\nLos detalles se pueden consultar en este enlace.\n                                      "], "listaEtiquetas": [], "listaCategorias": [" Campus infantil "]}{"autor": ["admin"], "titulo": ["Grupos de Telegram de la comunidad de software, hardware y conocimiento libre en Granada"], "contenido": ["\r\n              En los últimos meses han surgido una serie de grupos de Telegram centrados en el software y hardware libre en Granada y alrededores. Todos los grupos son abiertos, se puede acceder a ellos sin invitación y está bien conocerlos. Aunque todos tienen énfasis en un tema determinado, no hace falta tener un máster en el mismo, son grupos para todos los niveles.\n\nDatosGranada, centrados en ciencia de datos y datos abiertos\nInterferencias, centrado en privacidad, anonimato, white hat hacking\nSoftware Libre UGR, más general, relacionado con software libre\nAlhambra Makers, enfocado a la cultura maker y el hardware libre\nBeersJS Granada, dedicado a los múltiples aspectos del lenguaje JavaScript\nPython Granada, dedicado a este lenguaje de programación.\nSeminarios LibreIM, grupo centrado en el software libre de los alumnos del doble grado de Informática y Matemáticas.\nBioinformatics Granada, centrado en herramientas libres para bioinformática.\n\n                                      "], "listaEtiquetas": [], "listaCategorias": [" Eventos ", " Mundo Libre ", " Software Libre "]}{"autor": ["Bryan Moreno"], "titulo": ["Firefox Quantum: El zorro más veloz de Internet."], "contenido": ["\r\n              Hace unos días, llegaba a nuestros equipos la nueva actualización del navegador de Mozilla, el denominado Firefox Quantum, bajo el lema It’s Better Now (Ahora Es Mejor) y con unos cuantos videos promocionales en clave de humorístico bajo la manga, con los que la compañía ha querido mostrarnos su nuevo producto.\nSi bien a simple vista parece el mismo navegador de siempre, cuando hacemos un análisis un poco más meticuloso vemos que hay notables mejorías que contamos a continuación de forma muy resumida.\n\n\nPara empezar, la gente de Mozilla ha decidido cambiar el motor del navegador por uno nuevo y, en teoría, más veloz que el anterior. Esto se ha realizado con múltiples cambios entre los que destacan el uso de un motor CSS multinúcleo (Stylo) así como un nuevo sistema de prioridades en cargas de pestañas y ventanas, además de preparaciones para futuras incorporaciones como WebRender que harán de Firefox un navegador más rápido y fiable según promete la compañía.\nSi todo sale como la compañía espera, los cambios van a hacer que el navegador sea hasta dos veces más rápido y un 30% más ligero que su versión anterior e incluso que Google Chrome. Nosotros, después de unos días probando, no podemos afirmar que sea el doble de rápido, pero sí hemos notado una mejoría notable en la fluidez entre pestañas y ventanas.\nTras unas breves pesquisas e indagaciones por numerosos blogs de tecnología, podemos ver que, si bien los cambios y mejoras suponen un paso adelante comparándolo con versiones anteriores, Firefox Quantum sigue teniendo algunos problemas con el uso excesivo de memoria si se utilizan múltiples pestañas/ventanas. En la mayoría de los casos podemos ver que efectivamente sigue siendo más rápido que sus competidores directos, aunque aún queda un largo camino por recorrer. No obstante, parece que la compañía del zorro rojo se ha puesto manos a la obra e intenta quitar de su puesto de rey a su archienemigo Chrome, esperamos que en las siguientes versiones la velocidad y mejoras de rendimiento se noten aún más.\nEste navegador sigue siendo software libre y multiplataforma y esta nueva versión se puede descargar desde este enlace.\n\n\nFuentes:\nMuyComputer\nMuyLinux\nBlogMozilla\n                                      "], "listaEtiquetas": [], "listaCategorias": [" Software Libre "]}{"autor": ["José Alonso"], "titulo": ["II Campaña de donación de material informático “Ordenadores libres con software libre UGR Solidaria”"], "contenido": ["\r\n              \n\n\n\n\nYa está abierta la II Campaña de donación de material informático “Ordenadores libres con software libre UGR Solidaria”.\n\nEsta campaña tiene como fin la recogida y puesta a punto de equipos informáticos que se desechan desde las unidades de la Universidad de Granada para posteriormente donarlos a entidades y asociaciones sin animo de lucro de la provincia de Granada, prioritariamente las que provengan de las zonas del Barrio de La Paz y la Comarca Vega de Granada, que los destinan a diferentes proyectos de utilidad social.\n\nAdemás, se va a realizar una sesión formativa a los miembros de las asociaciones en software libre, con el fin de poder aprovechar al máximo los equipos donados.\n\n\n\n\n\n\n\n\n\n\n\nEn esta campaña, cuyas bases podéis consultar en la web, en esta Campaña contamos con ordenadores de sobremesa e impresoras, que se pueden solicitar en el formulario .\n\n\n\nComo en otras campañas de donación similares, se cuenta con el apoyo del resto de la Delegación de la Rectora para la Universidad Digital (DRUD), especialmente el CSIRC, Gerencia, Unidad de Calidad Ambiental y especialmente del Vicerrectorado de Responsabilidad Social, Igualdad e Inclusión de la UGR. Los únicos requisitos para recibir la donación, aparte de lo indicado en las bases, es asistir al taller de formación sobre el uso de los equipos y comprometerse a retirar personalmente los equipos, a parte de documentar la instalación en la sede de la entidad receptora, mediante la publicación de una noticia de los equipos entregados y publicarlo en la web o los medios sociales de los que la entidad disponga. Siendo también necesario publicar la asignación de material antes del taller. La campaña termina el día 25 de mayo de 2017, en los días siguientes a esa fecha de cierre de la campaña se les comunicará a las asociaciones solicitantes, mediante correo electrónico, los equipos que les han sido concedidos, y en los días sucesivos, según se confirmen o no las aceptaciones de las donaciones, al resto. El taller de introducción a Ubuntu 16.04 ó Q4OS tendrá lugar en la Oficina de Software Libre el 19 de junio de 2017. Aún así se comunicará el día mediante correo electrónico a las asociaciones beneficiadas, por si hubiese cambios de última hora. La asistencia al mismo es obligatoria y la publicación previa de la asignación en la web (como viene reflejado en las bases). Resumiendo:\n\nRellena elformulario solicitando los equipos que desees.\nPara facilitar el uso de los equipos se procederá a facilitar un manual de usuario para esta Campaña y otro documento para configurar los equipos en red.\nPuedes ver un vídeo con uno de los equipos donados en otras campañas anteriores en funcionamiento.\nEn la galería de la OSL puedes encontrar fotografías tomadas en otras campañas anteriores similares.\n\n \n\n\n\n\n\n\n                                      ", "<section class=\"entry-content \">Como en otras<strong><a href=\"http://osl.ugr.es/2017/04/24/taller-i-campana-de-donacion-de-material-informatico-ordenadores-libres-con-software-libre-ugr-solidaria/\"> campañas de donación similares</a>,</strong> se cuenta con el apoyo del resto de la <strong><a href=\"http://udigital.ugr.es/\">Delegación de la Rectora para la Universidad Digital (DRUD)</a></strong>, especialmente el <strong><a href=\"http://csirc.ugr.es\">CSIRC</a></strong>, <strong><a href=\"http://gerencia.ugr.es\">Gerencia</a></strong>, <strong><a href=\"http://www.ugr.es/pages/servicios/uca\">Unidad de Calidad Ambiental</a></strong> y especialmente del <a href=\"http://viceresponsabilidad.ugr.es/\"><strong>Vicerrectorado de Responsabilidad Social, Igualdad e Inclusión de la UGR</strong></a>. Los únicos requisitos para recibir la donación, aparte de lo indicado en las bases, es asistir al taller de formación sobre el uso de los equipos y comprometerse a retirar personalmente los equipos, a parte de documentar la instalación en la sede de la entidad receptora, mediante la <strong>publicación</strong> de una <strong>noticia</strong> de los equipos entregados y publicarlo en la web o los medios sociales de los que la entidad disponga. Siendo también necesario publicar la asignación de material antes del taller. La campaña termina el día <strong>25 de mayo de 2017,</strong> en los días siguientes a esa fecha de cierre de la campaña se les comunicará a las asociaciones solicitantes, mediante correo electrónico, los equipos que les han sido concedidos, y en los días sucesivos, según se confirmen o no las aceptaciones de las donaciones, al resto. El taller de introducción a <strong><a href=\"http://es.m.wikipedia.org/wiki/Ubuntu\">Ubuntu 16.04</a> ó Q4OS </strong>tendrá lugar en la Oficina de Software Libre el <strong>19 de junio de 2017</strong>. Aún así se comunicará el día mediante correo electrónico a las asociaciones beneficiadas, por si hubiese cambios de última hora. <strong>La asistencia al mismo es obligatoria y la publicación previa de la asignación en la web </strong>(como viene reflejado en las bases). Resumiendo:\n<ul>\n<li>Rellena el<a href=\"https://docs.google.com/forms/d/e/1FAIpQLSd_gygLo_huPH0tmvxxRqOd_fye7OA6nM6aIopCBg75VZ6T6w/viewform?c=0&amp;w=1\"> formulario </a>solicitando los equipos que desees.</li>\n<li>Para facilitar el uso de los equipos se procederá a facilitar  un manual de usuario para esta Campaña y otro documento para <a href=\"http://sl.ugr.es/ConfiguracionRedPcDonados\">configurar los equipos en red</a>.</li>\n<li>Puedes ver un vídeo con uno de los <a href=\"http://www.youtube.com/watch?v=9bhCJ5zZgp8\" target=\"_blank\">equipos donados en otras campañas anteriores en funcionamiento</a>.</li>\n<li class=\"breadcrumb-trail breadcrumbs\">En la <a href=\"http://osl.ugr.es/galeria/index.php/\" target=\"_blank\">galería de la OSL</a> puedes encontrar fotografías tomadas en otras campañas anteriores similares.</li>\n</ul>\n<p><a href=\"http://osl.ugr.es/wp-content/uploads/2014/01/UgrSolidaria.png\" class=\"grouped_elements\" rel=\"tc-fancybox-group8259\"><img class=\"wp-image-8070 alignleft\" src=\"http://osl.ugr.es/wp-content/uploads/2014/01/UgrSolidaria.png\" alt=\"\" width=\"228\" height=\"79\" srcset=\"http://osl.ugr.es/wp-content/uploads/2014/01/UgrSolidaria.png 400w, http://osl.ugr.es/wp-content/uploads/2014/01/UgrSolidaria-300x103.png 300w\" sizes=\"(max-width: 228px) 100vw, 228px\"></a> <a href=\"http://osl.ugr.es/wp-content/uploads/2014/01/Inclusi%C3%B3n-y-diversidad.jpg\" class=\"grouped_elements\" rel=\"tc-fancybox-group8259\"><img class=\"wp-image-8069 alignleft\" src=\"http://osl.ugr.es/wp-content/uploads/2014/01/Inclusi%C3%B3n-y-diversidad.jpg\" alt=\"\" width=\"200\" height=\"74\"></a><a href=\"http://osl.ugr.es/wp-content/uploads/2014/01/ugr-blanco.png\" class=\"grouped_elements\" rel=\"tc-fancybox-group8259\"><img class=\"wp-image-8072 alignleft\" src=\"http://osl.ugr.es/wp-content/uploads/2014/01/ugr-blanco.png\" alt=\"\" width=\"219\" height=\"69\"></a><a href=\"http://osl.ugr.es/wp-content/uploads/2014/01/osl-blanco.png\" class=\"grouped_elements\" rel=\"tc-fancybox-group8259\"><img class=\"wp-image-8071 alignleft\" src=\"http://osl.ugr.es/wp-content/uploads/2014/01/osl-blanco.png\" alt=\"\" width=\"179\" height=\"93\" srcset=\"http://osl.ugr.es/wp-content/uploads/2014/01/osl-blanco.png 311w, http://osl.ugr.es/wp-content/uploads/2014/01/osl-blanco-300x156.png 300w\" sizes=\"(max-width: 179px) 100vw, 179px\"></a></p>\n</section>"], "listaEtiquetas": [], "listaCategorias": [" OSL "]}{"autor": ["admin"], "titulo": ["Por qué, cómo, cuando y dónde debes liberar tu trabajo fin de grado/máster/tesis"], "contenido": ["\r\n              Vamos a empezar por lo más fácil: Cuando. La respuesta es muy simple: ahora\nEl mejor momento para liberar cualquier contenido, sea código, sea código con un informe explicativo o trabajo científico, siempre es ahora. Si lo que deseas es que su trabajo se conozca y también beneficiar a la comunidad que te ha dado financiación o simplemente apoyo, es mejor hacerlo desde el principio, desde la primera línea de código de un fichero README. El hacerlo ahora manda un mensaje claro: estoy abierto a cualquier sugerencia, y cualquiera puede copiar y mejorar mi trabajo en cualquier estadio de su desarrollo; también podéis sugerir cambios o mejoras y hacerlo durante el desarrollo del mismo, no al final cuando ni yo me puedo beneficiar ni posiblemente nadie porque la cantidad de información, código más informe, sea demasiado apabullante para que le sirva a nadie. Estamos en el mes de abril y te quedarán dos meses, quizás cinco si es en septiembre. Abre tu repositorio ya. Y si vas a empezarlo próximamente, crea el repositorio en abierto desde el principio y trabaja con él. Habla con tu tutor para que interaccione contigo también en abierto y a través del repositorio. Y, por supuesto, la liberación es un camino de dos vías. Si algún compañero tuyo también lo ha liberado, ayúdale, échale una mano, comprueba el código, hazle pull request. Nada más transparente que un repositorio para saber quién ha hecho qué. \nY el hecho de que se sepa que ese trabajo lo has hecho tú es precisamente uno de los porqués, el más importante. Las empresas usan tu repositorio como un currículum vitae, hasta el punto de que hay empresas que se dedican exclusivamente a hacer data mining de GitHub buscando a personas que tengan un perfil determinado, reflejado en lo que tienen publicado en GitHub. Seguramente estés usando una tecnología interesante en tu TFG/TFM/tesis que tenga demanda en el mercado. Ten por seguro que alguien lo va a ver, o que lo va a tener presente en la entrevista de trabajo para publicarlo o no. Git y GitHub es la herramienta que tienen en común todas las empresas y el hecho de que demuestres que lo conoces y lo usas también va a contar a tu favor. \nY finalmente, eso nos da el dónde. Hoy en día el sitio para liberar proyectos es GitHub. Las facilidades sociales y de gestión de proyectos que tienen no tienen ahora mismo igual. Aunque hay otros repositorios gratuitos como BitBucket o GitLab, este incluso libre, lo cierto es que tener un proyecto en un sitio popular como GitHub facilita su visilibidad y también que se interacciones con el resto de los programadores. Además, es el que se utiliza en ránkings provinciales como el de Israel Blancas; aparecer en ese ránking va a permitir también que conozcan tu trabajo y eventualmente que te den uno, que es de lo que se trata.\nNos queda un como. Liberar un trabajo es simplemente cuestión de asignarle una licencia. Y asignarle una licencia es tan fácil como colocar un fichero que se llame LICENSE en el directorio principal, que contenga los términos de la licencia; también se debe añadir una referencia a esa licencia en las cabeceras de todos los ficheros. Por ejemplo, Synapse de Marco Fernández Pranno (un proyecto liberado ya y que se leerá próximamente) tiene licencia MIT. Por otro lado, el texto en sí suele tener licencias Creative Commons, licencias específicas para contenido, como la tesis de Pablo García Sánchez, por ejemplo, que también se liberó desde el principio. Para no mezclar licencias el texto suele ir o en otro directorio o directamente en otro repositorio, aunque no pasa nada para que vayan juntos.\nPractica también la ciencia abierta. Si tu tesis tiene un componente de investigación, habrás hecho experimentos, tendrás ficheros de configuración, una bitácora de resultados, los datos. Eso también se puede, y se debe, liberar. Puedes ir publicando los datos y subiéndolos a Figshare o algún otro sitio que te permita asignarle un URL permanente y también citarlo como si de un trabajo se tratara. Esto se escapa de la temática estricta de esta historia, pero puedes informarte en esta presentación y esta otra que explica los conceptos y las herramientas que se pueden usar.\n¿A qué esperas pues para liberar tu TFM? Recuerda que el mejor momento siempre es ahora, y si necesitas ayuda y asesoramiento por parte de la Oficina de Software Libre, ya sabes donde encontrarnos. \n                                      "], "listaEtiquetas": [], "listaCategorias": [" howtos ", " Mundo Libre ", " proyectos ", " reflexiones ", " Software Libre ", " software-liberado "]}{"autor": ["German Martinez"], "titulo": ["Agenda de actividades 3 al 9 de abril de 2017"], "contenido": ["\r\n              ✴️ MARTES 4 ➡️ ‘Introducción al Big Data con el lenguaje R’.Perteneciente al Programa ETSIIT de capacitación profesional (asistencia libre para cualquier persona hasta completar aforo).\nEn la era de los datos es interesante extraer la mayor cantidad posible de conocimiento que se puedan ocultar a simple vista en su contenido, para esto necesitamos herramientas de análisis estadístico de datos que nos faciliten en la medida de lo posible esta tarea que puede tener cierta complejidad.\nR es un entorno y lenguaje de programación con un enfoque estadístico que nos permite hacer esto y que actualmente es uno de los lenguajes más utilizados para la investigación en campos como la minería de datos, la bioinformática y las matemáticas financieras. Gracias a ser software libre uno de los motivos de sus popularidad es la gran cantidad de librerías específicas creadas por la comunidad para ayudar en tareas complejas que se encuentran en estos campos de investigación.\n💬 ORGANIZA. Oficina de Software Libre de la Universidad de Granada\n🏢 LUGAR. Escuela Técnica Superior de Ingenierías Informática y de Telecomunicación (Aula -1.2 [Aula Polivalente]). Calle Periodista Daniel Saucedo Aranda, s/n.\n⏰ HORA. 12:30 – 13:30\n🎫 REGISTRO. https://www.meetup.com/es-ES/Granada-Geek/events/237493544/\n\n\n✴️ MIÉRCOLES 5 ➡️ ‘INTERFERENCIAS [Desparasita tu móvil: taller eliminar software inseguro o espía]’. ¿Usas Android? ¿Tienes la versión del sistema operativo de fábrica en tu teléfono? Además de llevar mucho software cerrado, que activamente recopila y reporta información, probablemente sea una versión muy desactualizada y vulnerable.\nEn este taller y te enseñaran a eliminar todo el software inseguro o espía de tu teléfono. Necesitarás:\n– Tu teléfono con Android (si tienes un iPhone, lo sentimos, pero no hay forma de ser libre usando eso).\n– Un ordenador con Linux.\n– Haber hecho copia de todos los archivos del teléfono que queramos conservar (lo suyo es formatear incluso la tarjeta SD, porque muchas aplicaciones tienen ahí la caché).\nTodos juntos, instalarán Lineage en los teléfonos, disfrutando así del proyecto abierto detrás de Android, es decir, teniendo la versión de Android libre y en constante desarrollo para los teléfonos.\nNota: es posible que algunos teléfonos no dispongan de versión de Lineage o que el proceso de instalación sea muy complicado y no sea posible (hay teléfonos que son un mundo). Si quieres asegurarte antes de venir al taller, contacta con t.me/Speedy diciendo el modelo de tu teléfono.\n💬 ORGANIZA. Interferencias\n🏢 LUGAR. Escuela Técnica Superior de Ingenierías Informática y de Telecomunicación (Sala de Juntas). Calle Periodista Daniel Saucedo Aranda, s/n.\n⏰ HORA. 11:30 – 13:30\n🎫 REGISTRO. https://www.meetup.com/es-ES/Granada-Geek/events/238595388/\n\n✴️ JUEVES 6 ➡️ ‘Básicos de la OSL: Programando con Python desde 0’. Taller rápido en el que se aprenderá cómo programar en Python desde 0.\nSi hoy en día tuviéramos que pensar en un lenguaje de programación sencillo de aprender este sería sin duda Python, ya que aunque es un lenguaje orientado a objetos como muchos otros, una de las cosas por la que se ha convertido en uno de los favoritos de las personas no-informáticas que se interesan por aprender programación es que su sintaxis es muy limpia y requiere menos código que otros en tareas sencillas.\nA esas ventajas se le puede añadir que es un lenguaje con una alta demanda, ya que empresas como Google lo utilizan en el desarrollo de sus infraestructuras, o que también está muy extendido en el ámbito web debido a la popularidad de frameworks como Django. Además, gracias a sus popularidad tiene una de las mayores comunidades detrás que fomentan el soporte y el desarrollo, en gran parte porque viene preinstalado en la mayoría de sistemas GNU/Linux ya que es necesario para el funcionamiento de este.\n💬 ORGANIZA. Oficina de Software Libre de la Universidad de Granada\n🏢 LUGAR. Escuela Técnica Superior de Ingenierías Informática y de Telecomunicación (Aula -1.2 [Aula Polivalente]). Calle Periodista Daniel Saucedo Aranda, s/n.\n⏰ HORA. 13:30 – 14:00\n🎫 REGISTRO. https://www.meetup.com/es-ES/Granada-Geek/events/237475933/\n\n✴️ VIERNES 7 ➡️ ‘Móntate tu propio IoT’. Mucho se habla últimamente del Internet of Things (IoT), que como su nombre indica (Internet de las Cosas) consiste en dotar de conectividad a cualquier objeto con el entorno que lo rodea, ya sean otros objetos o algo con unas posibilidades mucho mayores, un conexión a Internet. Esto ha adquirido especial importancia si pensado que objetos tradicionales como un libro o un frigorífico, consiguiendo que incluso estos artículos de andar por casa sean inteligentes e independientes, convirtiéndose en casi miniordenadores que interactúan con elementos de la vida real de forma natural, pasando desapercibidos ante cualquier persona.\nEn el ámbito del hogar, vemos casas en las que activamos remotamente la calefacción para que esté a la temperatura ideal justo cuando lleguemos; o podríamos pensar en que electrodomésticos como el frigorífico supieran cuando nos estamos quedando sin algún alimento y automáticamente lo pida adquiera por Internet, o que nos avise cuando otro esta cerca de su fecha de caducidad para que no nos olvidemos. Además hoy en día ya todos estamos acostumbrados a los “wearables“, dispositivos que se usamos en alguna parte de nuestro cuerpo y que interactúan con el usuario, como las pulseras inteligentes que además de darnos información de nuestra actividad física, podrían servirnos para abrir la puerta de nuestra casa o arrancar el motor de nuestro coche.\nPara que podáis aprender un poco más sobre IoT, el viernes 7 tenemos un taller básico para que aprendas a montarte tu propio IoT.\n💬 ORGANIZA. Oficina de Software Libre de la Universidad de Granada\n🏢 LUGAR. Escuela Técnica Superior de Ingenierías Informática y de Telecomunicación (Aula -1.2 [Aula Polivalente]). Calle Periodista Daniel Saucedo Aranda, s/n.\n⏰ HORA. 12:30 – 13:30\n🎫 REGISTRO.https://www.meetup.com/es-ES/Granada-Geek/events/238825400/\n\n                                      "], "listaEtiquetas": [], "listaCategorias": [" OSL "]}{"autor": ["José Alonso"], "titulo": ["Campus Tecnológico UGR para Chicas 2017"], "contenido": ["\r\n              ¿Tienes plan para este verano?¿Te gusta la tecnología?¿Quieres desarrollar tu creatividad? ¿Eres chica y estudias entre 3º de ESO a 2º Bachillerato?\nSi es así, queremos ofrecerte un plan de dos semanas en las que aprenderás de la mano de 4 fantásticas profesoras diferentes herramientas y lenguajes de programación, podrás crear tu primer juego para ordenador (si no lo has hecho ya), podrás descubrir que es una placa Arduino, a crear una aplicación para dispositivos móviles y mil cosas más con las que pasarás el verano de tu vida.\nEl campus tendrá lugar del 3 al 14 de julio de este año 2017 y se realizará en la Escuela Técnica Superior de Ingenierías Informática y de Telecomunicación.Se escogerán 25 alumnas de 3º de ESO a 2º de Bachillerato, que hayan elegido preferentemente o vayan a elegir Ciencias o Bachillerato Científico Técnico o Artístico.\n\nEste campus tecnológico tendrá el apoyo de la FECYT, la Delegación de la Rectora para la Universidad Digital y la propia ETSIIT, lugar donde se celebrará el Campus.\n\nTambién le da continuidad (y, de hecho, se solapará en el tiempo) con el Campus Infantil de Software Libre, que la Oficina de Software Libre organiza todos los años y que tendrá este año su décima edición.\n\nAdemás, el campus también contara con el apoyo de los patrocinadores de la Oficina de Software Libre, comoCodeko, PerkinElmer, RTI, Microsoft, Magnolia CMS, Badger Maps, Unit4, Fidesol, SI2 Soluciones, Createc 3D, Axesor, Bitergia, Ximdex e Inven.\n\n\nSi te interesa, pulsa aquí para la preinscripción.\n\n\nMás información en :\nCorreo electrónico: CampusUgr@gmail.com\nTwitter: twitter.com/UGRingenieras\nFacebook: facebook.com/campusugrgoogle\nWeb: http://sereingeniera.ugr.es/\n\n\n\n\n                                      "], "listaEtiquetas": [], "listaCategorias": [" OSL "]}{"autor": ["José Alonso"], "titulo": ["Taller I Campaña de donación de material informático “Ordenadores libres con software libre UGR Solidaria”"], "contenido": ["\r\n              El pasado día 19 de abril de 2017 tuvo lugar el taller de formación a las asociaciones que han obtenido material informático en la I Campaña de donación de material informático “Ordenadores libres con software libre UGR Solidaria”.\n\nEn el taller, se explicó a las asociaciones que es el software libre y que consiste, además se informó de la labor que desarrolla la Oficina de Software Libre y de los diferentes talleres y campañas que se llevan a cabo desde la misma.\nPara la realización del taller, se escogió una sala amplia y equipada con ordenadores para que pudieran asistir todos los representantes de las distintas asociaciones. El taller se impartió con un equipo de idénticas características a los que se va a donar a las diferentes asociaciones, con el fin de que pudieran comprobar de primera mano el magnífico rendimiento de los equipos, tras ser optimizados por el personal de la Oficina de Software Libre.\nDurante el taller, las diferentes asociaciones fueron informadas de todo el proceso de adecuación y optimización a los que han sido sometidos cada una de los equipos que se van a donar y de porque se ha escogido ese sistema operativo y las características y programas de los que se compone.\nPor otro lado, también se les facilito información y ayuda a todas las asociaciones asistentes en los diferentes programas y aplicaciones informáticas instaladas en el sistema operativo instalado en los equipos donados. Por último, las diferentes asociaciones explicaron las necesidades que tienen y se les asesoró acerca de los diferentes programas que van a necesitar para el desarrollo de sus tareas y de diferentes alternativas a los mismo de explicando que programas pueden usar para llevar a cabo las mi\nEn esta campaña, más de 15 asociaciones han podido recibir material informático, el cuál estamos seguros que va a ser de gran utilidad a la hora del desempeño de las magnificas tareas que las mismas realizan.\nEstas son algunas de las fotos del taller:\n                         \nDesde la Oficina de Software Libre queremos agradecer el apoyo del resto de la Delegación de la Rectora para la Universidad Digital (DRUD), especialmente el CSIRC, Gerencia, Unidad de Calidad Ambiental y especialmente del Vicerrectorado de Responsabilidad Social, Igualdad e Inclusión de la UGR, así como a las asociaciones que han formado parte de la campaña.\n                                      "], "listaEtiquetas": [], "listaCategorias": [" OSL "]}{"autor": ["José Alonso"], "titulo": ["I Campaña de donación de material informático “Ordenadores libres con software libre UGR Solidaria”"], "contenido": ["\r\n              \n\n\n\n\nYa está abierta la I Campaña de donación de material informático “Ordenadores libres con software libre UGR Solidaria”.\n\nEsta campaña tiene como fin la recogida y puesta a punto de equipos informáticos que se desechan desde las unidades de la Universidad de Granada para posteriormente donarlos a entidades y asociaciones sin animo de lucro de la provincia de Granada, prioritariamente las que provengan de las zonas del Barrio de La Paz y la Comarca Vega de Granada, que los destinan a diferentes proyectos de utilidad social.\n\nAdemás, se va a realizar una sesión formativa a los miembros de las asociaciones en software libre, con el fin de poder aprovechar al máximo los equipos donados.\n\n\n\n\n\n\n\n\n\n\n\nEn esta campaña, cuyas bases podéis consultar en la web, en esta Campaña contamos con ordenadores de sobremesa e impresoras, que se pueden solicitar en el formulario .\n\n\n\nComo en otras campañas de donación similares, se cuenta con el apoyo del resto de la Delegación de la Rectora para la Universidad Digital (DRUD), especialmente el CSIRC, Gerencia, Unidad de Calidad Ambiental y especialmente del Vicerrectorado de Responsabilidad Social, Igualdad e Inclusión de la UGR. Los únicos requisitos para recibir la donación, aparte de lo indicado en las bases, es asistir al taller de formación sobre el uso de los equipos y comprometerse a retirar personalmente los equipos, a parte de documentar la instalación en la sede de la entidad receptora, mediante la publicación de una noticia de los equipos entregados y publicarlo en la web o los medios sociales de los que la entidad disponga. Siendo también necesario publicar la asignación de material antes del taller. La campaña termina el día 31 de marzo de 2017, en los días siguientes a esa fecha de cierre de la campaña se les comunicará a las asociaciones solicitantes, mediante correo electrónico, los equipos que les han sido concedidos, y en los días sucesivos, según se confirmen o no las aceptaciones de las donaciones, al resto. El taller de introducción a Ubuntu 16.04 ó Q4OS tendrá lugar en la Oficina de Software Libre el 19 de Abril de 2017. Aún así se comunicará el día mediante correo electrónico a las asociaciones beneficiadas, por si hubiese cambios de última hora. La asistencia al mismo es obligatoria y la publicación previa de la asignación en la web (como viene reflejado en las bases). Resumiendo:\n\nRellena elformulario solicitando los equipos que desees.\nPara facilitar el uso de los equipos se procederá a facilitar un manual de usuario para esta Campaña y otro documento para configurar los equipos en red.\nPuedes ver un vídeo con uno de los equipos donados en otras campañas anteriores en funcionamiento.\nEn la galería de la OSL puedes encontrar fotografías tomadas en otras campañas anteriores similares.\n\n \n\n\n\n\n\n\n                                      ", "<section class=\"entry-content \">Como en otras<strong><a href=\"http://osl.ugr.es/2016/10/06/xix-campana-ordenadores-libres-con-software-libre/\"> campañas de donación similares</a>,</strong> se cuenta con el apoyo del resto de la <strong><a href=\"http://udigital.ugr.es/\">Delegación de la Rectora para la Universidad Digital (DRUD)</a></strong>, especialmente el <strong><a href=\"http://csirc.ugr.es\">CSIRC</a></strong>, <strong><a href=\"http://gerencia.ugr.es\">Gerencia</a></strong>, <strong><a href=\"http://www.ugr.es/pages/servicios/uca\">Unidad de Calidad Ambiental</a></strong> y especialmente del <a href=\"http://viceresponsabilidad.ugr.es/\"><strong>Vicerrectorado de Responsabilidad Social, Igualdad e Inclusión de la UGR</strong></a>. Los únicos requisitos para recibir la donación, aparte de lo indicado en las bases, es asistir al taller de formación sobre el uso de los equipos y comprometerse a retirar personalmente los equipos, a parte de documentar la instalación en la sede de la entidad receptora, mediante la <strong>publicación</strong> de una <strong>noticia</strong> de los equipos entregados y publicarlo en la web o los medios sociales de los que la entidad disponga. Siendo también necesario publicar la asignación de material antes del taller. La campaña termina el día <strong>31 de marzo de 2017,</strong> en los días siguientes a esa fecha de cierre de la campaña se les comunicará a las asociaciones solicitantes, mediante correo electrónico, los equipos que les han sido concedidos, y en los días sucesivos, según se confirmen o no las aceptaciones de las donaciones, al resto. El taller de introducción a <strong><a href=\"http://es.m.wikipedia.org/wiki/Ubuntu\">Ubuntu 16.04</a> ó Q4OS </strong>tendrá lugar en la Oficina de Software Libre el <strong>19 de Abril de 2017</strong>. Aún así se comunicará el día mediante correo electrónico a las asociaciones beneficiadas, por si hubiese cambios de última hora. <strong>La asistencia al mismo es obligatoria y la publicación previa de la asignación en la web </strong>(como viene reflejado en las bases). Resumiendo:\n<ul>\n<li>Rellena el<a href=\"https://docs.google.com/forms/d/e/1FAIpQLSdx6vEC-BrHnp68qbhVrFJHJc5wh0wwOAIDNePacyZ8bTkrzQ/viewform\"> formulario </a>solicitando los equipos que desees.</li>\n<li>Para facilitar el uso de los equipos se procederá a facilitar  un manual de usuario para esta Campaña y otro documento para <a href=\"http://sl.ugr.es/ConfiguracionRedPcDonados\">configurar los equipos en red</a>.</li>\n<li>Puedes ver un vídeo con uno de los <a href=\"http://www.youtube.com/watch?v=9bhCJ5zZgp8\" target=\"_blank\">equipos donados en otras campañas anteriores en funcionamiento</a>.</li>\n<li class=\"breadcrumb-trail breadcrumbs\">En la <a href=\"http://osl.ugr.es/galeria/index.php/\" target=\"_blank\">galería de la OSL</a> puedes encontrar fotografías tomadas en otras campañas anteriores similares.</li>\n</ul>\n<p><a href=\"http://osl.ugr.es/wp-content/uploads/2014/01/UgrSolidaria.png\" class=\"grouped_elements\" rel=\"tc-fancybox-group8067\"><img class=\"wp-image-8070 alignleft\" src=\"http://osl.ugr.es/wp-content/uploads/2014/01/UgrSolidaria.png\" alt=\"\" width=\"228\" height=\"79\" srcset=\"http://osl.ugr.es/wp-content/uploads/2014/01/UgrSolidaria.png 400w, http://osl.ugr.es/wp-content/uploads/2014/01/UgrSolidaria-300x103.png 300w\" sizes=\"(max-width: 228px) 100vw, 228px\"></a> <a href=\"http://osl.ugr.es/wp-content/uploads/2014/01/Inclusi%C3%B3n-y-diversidad.jpg\" class=\"grouped_elements\" rel=\"tc-fancybox-group8067\"><img class=\"wp-image-8069 alignleft\" src=\"http://osl.ugr.es/wp-content/uploads/2014/01/Inclusi%C3%B3n-y-diversidad.jpg\" alt=\"\" width=\"200\" height=\"74\"></a><a href=\"http://osl.ugr.es/wp-content/uploads/2014/01/ugr-blanco.png\" class=\"grouped_elements\" rel=\"tc-fancybox-group8067\"><img class=\"wp-image-8072 alignleft\" src=\"http://osl.ugr.es/wp-content/uploads/2014/01/ugr-blanco.png\" alt=\"\" width=\"219\" height=\"69\"></a><a href=\"http://osl.ugr.es/wp-content/uploads/2014/01/osl-blanco.png\" class=\"grouped_elements\" rel=\"tc-fancybox-group8067\"><img class=\"wp-image-8071 alignleft\" src=\"http://osl.ugr.es/wp-content/uploads/2014/01/osl-blanco.png\" alt=\"\" width=\"179\" height=\"93\" srcset=\"http://osl.ugr.es/wp-content/uploads/2014/01/osl-blanco.png 311w, http://osl.ugr.es/wp-content/uploads/2014/01/osl-blanco-300x156.png 300w\" sizes=\"(max-width: 179px) 100vw, 179px\"></a></p>\n</section>"], "listaEtiquetas": [], "listaCategorias": [" OSL "]}{"autor": ["German Martinez"], "titulo": ["Agenda de actividades 27 de febrero al 5 de marzo de 2017"], "contenido": ["\r\n              Esta semana puede que sea corta (sobre todo si tenéis puente), pero intensa. Aparte de una charla/taller diaria, durante el fin de semana tenemos uno de los grandes eventos del año, el Open Data Day. Así que sin más, pasamos anunciar las actividades.\n\n✴️ MIÉRCOLES 1 ➡️ ‘Programa ETSIIT de capacitación profesional: “Introducción a las bases de datos NoSQL con MongoDB”’. Las bases de datos son una de las partes más importantes de la informática ya que representan toda la información contenida bajo el mismo contexto de un sistema de forma organizada para que pueda ser usada de forma posterior sin representar una gran dificultad. Aunque su uso es habitual desde hace varias décadas, podríamos decir que hoy son más importantes que nunca debido a la importancia que tienen en la actualidad los datos en la sociedad; esto a su vez a llevado a la aparición de distintos tipos de bases de datos orientadas a un uso concreto de la información.\nConcretamente las bases de datos NoSQL aparecieron debido a la alta escalabilidad necesaria para poder abarcar toda la información que se genera diariamente por todas las aplicaciones web y los servicios en la nube, algo que con modelos relacionales es muy complejo de gestionar (en el mejor de los casos) o directamente imposible (en el peor de los casos), pero que es relativamente simple bajo esquemas NoSQL debido precisamente a la ausencia de esquemas.\nExisten como es lógico varios sistemas de bases de datos NoSQL, sin embargo, de entre todos uno que destaca mucho es MongoDB debido a numerosas ventajas como permitir escalar de formar horizontal sin complicaciones mediante los “shards”, realizar consultas de agregación similares a las tradicionales en SQL y que además permite realizar de forma nativa consultas utilizando JavaScript.\n💬 ORGANIZA. Oficina de Software Libre de la Universidad de Granada\n🏢 LUGAR. Escuela Técnica Superior de Ingenierías Informática y de Telecomunicación (Salón de Grados). Calle Periodista Daniel Saucedo Aranda, s/n.\n⏰ HORA. 19:30 – 20:30\n🎫 REGISTRO. https://www.meetup.com/es-ES/Granada-Geek/events/237479163/\n \n\n✴️ JUEVES 2 ➡️ ‘Básicos de la OSL: “Control de Versiones con Git desde 0”’. Taller rápido en el que se aprenderá a usar una herramienta que permite trabajar colaborativamente en proyectos tales como trabajos científicos o de otro tipo o aplicaciones informáticas, evitando conflictos y simplificando el flujo de trabajo. Aprenderemos, en resumen, a cómo usar el Control de Versiones con Git desde 0.\nA lo largo del desarrollo de cualquier proyecto podemos estar seguros de que se producirán una gran cantidad de cambios según vaya evolucionando, cambios que serán mucho más numerosos si en ese mismo proyecto trabajan además varias personas. Otra cosa segura, es que si no tenemos un sistema mediante el que gestionar dichos cambios, tarde o temprano empezaremos a tener problemas.\nPrecisamente para evitar estos problemas es para lo que aparecieron los sistemas de control de versiones, para tener un sistema que nos permita guardar una copia de todos los estados anteriores de nuestro proyecto de forma que si, por ejemplo, se produce un error irreparable, fácilmente volver a un estado anterior en el que todo funcionaba correctamente.\nDe entre los sistemas de control de versiones podemos destacar por su simpleza y gran funcionalidad Git, un sistema de control de versiones distribuido donde cada integrante del proyecto tiene una copia local sobre la que trabaja para finalmente contribuir con sus modificaciones al original de forma que el resto de integrantes también reciban dichas modificaciones. Además, para más reconocimiento, es el sistema de control de versiones que se utiliza en el desarrollo del kernel de Linux.\n💬 ORGANIZA. Oficina de Software Libre de la Universidad de Granada\n🏢 LUGAR. Escuela Técnica Superior de Ingenierías Informática y de Telecomunicación (Aula -1.2 [Aula Polivalente]). Calle Periodista Daniel Saucedo Aranda, s/n.\n⏰ HORA. 13:30 – 14:00\n🎫 REGISTRO. https://www.meetup.com/es-ES/Granada-Geek/events/237473200/\n\n\n✴️ VIERNES 3 ➡️ ‘Interferencia­s: “BITCOINS – La moneda del futuro”’. El Bitcoin es una moneda que podemos usar en nuestras compras como cualquier otra, pero con la diferencia de que los Bitcoins son una divisa electrónica cuyas ventajas principales son su seguridad y sus facilidad para ser intercambiadas. Además, es una moneda descentralizada, que no depende de ningún gran emisor central como las monedas tradicionales, si no que es producida por personas y empresas de todo el mundo que a través de la minería generan una gran inversión en informática (lo que además asegura la red).\nAl no pertenecer a ningún país, pueden usarse libremente en todo el mundo, pudiendo cambiar de Bitcoins a euros, dólares o cualquier otra divisa que fuera necesario sin ningún problema; y como no existen intermediarios, si no que las transferencias se hacen directamente de persona a persona mediante Internet, por lo que no tienen el problema de que las transferencias se vean altamente encarecidas por diferentes tasas o comisiones que pudiera que ser obligatorio pagar a cualquier banco, institución financiera o empresa.\nPero lo mejor de todo, es que cuenta con una seguridad mucho mayor a ninguna otra moneda tradicional. Por un lado tenemos la posibilidad de las que nuestras operaciones sean anónimas, por lo que no tenemos que desvelar ninguna información, evitando así que esta sea robada y además, las transacciones son irreversibles, lo que ayuda a evitar estafas. Pero lo mejor que tiene esta monedad es que es imposible que sean falsificadas o duplicadas gracias a su sofisticado sistema criptográfico.\n💬 ORGANIZA. Interferencias\n🏢 LUGAR. Escuela Técnica Superior de Ingenierías Informática y de Telecomunicación (Sala de Usos Múltiples). Calle Periodista Daniel Saucedo Aranda, s/n.\n⏰ HORA. 12:30 – 13:30\n🎫 REGISTRO. https://www.meetup.com/es-ES/Granada-Geek/events/237673021/\n\n\n✴️ SÁBADO 4 – DOMINGO 5 ➡️ ‘Open Data Day 2017’. El Open Data Day es un acontecimiento anual que reúne a interesados en los datos abiertos y el activismo ciudadano para conocer iniciativas de extracción y apertura de datos, periodismo de datos y ciudades inteligentes. En Granada se ha organizado varios años consecutivos desde la Oficina de Software Libre, y este año de nuevo organizaremos diferentes talleres, actividades, y un hackatón de datos abiertos usando los datos de la ciudad y provincia de Granada y del portal de datos abiertos de la Universidad de Granada.\nEn este caso, nos vamos a centrar en varios conjuntos de datos:\n• Datos de la universidad, género y procedencia geográfica: de dónde proceden los estudiantes, cuál es el porcentaje de los diferentes géneros por carrera, cómo ha evolucionado. También datos de investigación: qué temas de investigación son más productivos, qué se produce por año. Si tienes algún otro tema relacionado con opendata.ugr.es, háznoslo saber en los comentarios.\n• Datos de contaminación atmosférica: Evaluación de la contaminación atmosférica en las diferentes ciudades andaluzas y su correlación con otra serie de datos como lluvia, temperatura y datos de enfermedades, si se pueden obtener. Creación de un observatorio de contaminación atmosférica y de un API para trabajar con esos datos fácilmente. Se trabajará con conjuntos de datos tales como este, oficiales de la Junta.\n• En otras ocasiones hemos trabajado con datos electorales y de contratos del Ayuntamiento. Si tienes algún proyecto interesante, proponlo en comentarios y lo consideraremos para incorporarlo.\n• Dentro de la actividad “Patrimonio Abierto”, trabajaremos con datos del patrimonio de la Universidad para incorporarlos a Wikidata. Una vez incorporados los datos, se realizarán aplicaciones sobre los mismos para relacionarlos. Se puede trabajar con datos geográficos, pero también estilos, autores, relación con otra serie de actividades. El objetivo es hallar relaciones entre diferentes objetos del patrimonio y completar los datos de la Universidad en la Wikipedia y su apartado Wikidata.\nHorario de actividades:\nSábado, 4 de marzo:\n10:00 – 11:00: Recepción, presentación, puesta a punto de conexión WiFi, networking.\n11:00 – 13:00: Patrimonio Abierto, actividades de apertura y liberación de datos relacionadas con el Patrimonio de la UGR.\n13:00 – 14:00: Datos abiertos en Granada, mesa redonda con representantes de las instituciones de la ciudad y provincia para discutir y ver diferentes enfoques al tema de los datos abiertos.\n14:00 – 16:00: Hack &amp; Beers. Cervezas por el Realejo.\nA partir de las 16:00: Hackatón por grupos, en la Corrala de Santiago (o en el lugar donde lo decidan los grupos participantes). Cada grupo expondrá su proyecto en 10 minutos y los participantes elegirán un proyecto en el que trabajar con el resto del hackatón.\nDomingo, 5 de marzo:\nTodo el día: Trabajo sobre los diferentes proyectos de datos abiertos. Al final del día, presentación y publicación de los informes y demás.\nA partir de las 20:00: Hacks &amp; Beers, de nuevo.\nMicrosoft colaborará en esta actividad con cupones de Azure que permitirán a los asistentes desplegar aplicaciones en la nube durante un mes.\n💬 ORGANIZA. Oficina de Software Libre de la Universidad de Granada\n🏢 LUGAR.Corrala de Santiago. Calle Santiago, 5.\n⏰ HORA. Ambos días a partir de las 10\n🎫 REGISTRO. https://www.meetup.com/es-ES/Granada-Geek/events/236840299/\n\n                                      "], "listaEtiquetas": [], "listaCategorias": [" OSL "]}{"autor": ["José Alonso"], "titulo": ["Campus Tecnológico Infantil de Software Libre 2017 "], "contenido": ["\r\n              \nTodos los años y este no iba a ser distinto tiene lugar el Campus Tecnológico Infantil de Software Libre en la ETTSIT.\nEste año tiene lugar la décima edición del Campus y como en todas las anteriores, estamos seguros de que los asistentes vivirán una experiencia inolvidable.\nLos niños se dividen en grupos que, por costumbre, se denominan de “grandes”, “medianos” y “pequeños” aunque, en realidad, a la hora de asignar un niño a un grupo también se tiene en cuenta la experiencia de años anteriores o los conocimientos del niño, y no sólo su edad. Si en un grupo hay demasiados niños para atenderlos correctamente, este se desdobla y se distribuyen los alumnos entre los dos nuevos.\nDesde el día 26 de junio de 2017 al 21 de julio de 2017, se celebrará el campus infantil de software libre 2017 en dos turnos, el primero del 26 de junio a 7 de julio de 2017, en horario de 9:00 a 14:00 horas y el segundo turno del 10 de julio al 21 de julio de 2017, en horario de 09:00 a 14:00. Si perteneces a la comunidad universitaria, consulta esta historia donde se anuncian las ayudas del GAS. Si no,\n\nEl campus está orientado a niños de entre siete y trece años, y el horario es de nueve a dos (aunque, para facilitar a los padres el traer y llevar a los niños, se ha flexibilizado el horario de llegada desde las ocho y el de fin a las tres).\nEl objetivo del campus es enseñar a los niños una serie de habilidades TIC usando Software Libre, para que puedan aplicar en casa lo que aprenden aquí.\n\nEn el mismo, los asistentes aprenderán a trabajar en equipo, a desarrollar sus habilidades de programación, diseño, ofimática y a manejar un equipo informático, todo ello siempre con software libre. En todo momento, estarán acompañados por profesores y monitores que les ayudaran y enseñaran todo lo necesario.\nEl monitor se ocupa de atender las necesidades de los niños, mantener el orden y dos profesores encargados de impartir las materias, atender dudas, resolver cuestiones y, en general, ayudar a los niños en todo lo que tenga que ver con los contenidos del campus. Los profesores pueden cambiar de grupo ocasionalmente en función de las necesidades docentes, pero cada monitor tiene asignado un grupo concreto del que es responsable y lo acompaña continuamente, tanto durante las clases como en las horas de recreo.\nLos contenidos que se enseña a los niños (y la profundidad y el detalle con que se hace) son variados y dependen del grupo y del nivel de los niños. En algunas materias todos los grupos usan herramientas comunes (aunque, naturalmente, ajustando el nivel a cada grupo) pero otras se imparte con software específicamente concebido para un nivel determinado.\nEnlace al formulario \nTambién puedes acceso a imágenes de campus anteriores galería de fotos.\n                                      "], "listaEtiquetas": [], "listaCategorias": [" Campus infantil "]}{"autor": ["German Martinez"], "titulo": ["Agenda de actividades 20 al 26 de marzo de 2017"], "contenido": ["\r\n              \n✴️ LUNES 20 ➡️ ‘Básicos de la OSL: “Robótica con Arduino desde 0”’. Un robot es una máquina capaz de llevar a cabo una serie compleja de acciones de forma automática, y aunque pueden tener distintos aspectos (actualmente se busca que los más avanzados tenga incluso apariencia cercana a la humana) la mayoría son diseñados para realizar una tarea sin tener en cuenta cómo se ven, ya que en la robótica tiene un mayor importancia centrarse tanto en su diseño y su construcción como en sus sistemas de control, manejo de los sensores y procesamiento de información, que es lo que va a hacer al fin y al cabo que el ordenador “cobre vida” y funcione de la forma que queremos.\nAdemás, como en todo aspecto tecnológico, tarde o temprano llega un componente que permite que una tecnología se vuelva libre y se popularice por la facilidad que presenta, en el caso del hardware libre esto sería sin duda alguna Arduino, una pequeña placa de circuito impreso con un microcontrolador. Podemos hacer programas con el entorno Processing de forma que fácilmente podamos usar nuestro Arduino para distintos proyectos como pueden ser desde automatizar las luces de nuestra casa o nuestra casa entera, crear robots capaces de pintar, montar un sistemas de riego automático, desarrollar un simulador de terremotos… cualquier cosa que se nos ocurra y que se pueda hacer mediante robótica.\n💬 ORGANIZA. Oficina de Software Libre de la Universidad de Granada\n🏢 LUGAR. Escuela Técnica Superior de Ingenierías Informática y de Telecomunicación (Aula -1.2 [Aula Polivalente]). Calle Periodista Daniel Saucedo Aranda, s/n.\n⏰ HORA. 12:30 – 13:30\n🎫 REGISTRO. https://www.meetup.com/es-ES/Granada-Geek/events/238464035/\n\n✴️ MARTES 21 ➡️ ‘Programa ETSIIT de capacitación profesional: “Introducción al uso de expresiones regulares”’. Las expresiones regulares son secuencias de caracteres que forman un patrón de búsqueda de forma que podamos fácilmente buscar o reconocer cadenas de texto concretas. A parte de la utilidad que esto presenta para búsquedas tradicionales de cadenas en textos planos, también puede ser especialmente útil en la administración de sistemas informáticos o en los lenguajes de programación.\nEn la parte de administración de sistemas informáticos podemos usar las expresiones regulares para, por ejemplo, analizar las salidas de los comandos de forma que solo se nos muestre la parte que nos interesa o modificar la salida de forma que se redirija al contenido de un archivo. De entre los lenguajes de programación, las expresiones regulares son especialmente útiles en lenguajes como JavaScript donde tradicionalmente se han usado para validar los formularios en los navegadores o en otros lenguajes como Perl, donde las expresiones regulares son algo básico en su uso cotidiano y han hecho que se extiendan enormemente hasta llegar a otros lenguajes de programación más generales como C++ o Python.\n💬 ORGANIZA. Oficina de Software Libre de la Universidad de Granada\n🏢 LUGAR. Escuela Técnica Superior de Ingenierías Informática y de Telecomunicación (Salón de Grados). Calle Periodista Daniel Saucedo Aranda, s/n.\n⏰ HORA. 12:30 – 13:30\n🎫 REGISTRO. https://www.meetup.com/es-ES/Granada-Geek/events/237493138/\n\n✴️VIERNES 24➡️ ‘Interferencias: “EFF, defendiendo tus derechos en el mundo digital”’. La Electronic Frontier Foundation es una organización sin ánimo de lucro con el objetivo declarado de dedicar sus esfuerzos a conservar los derechos de libertad de expresión en el ámbito de Internet. Su inicio se remonta al año 1990 en Estados Unidos, cuando tener una conexión a internet en el propio hogar era algo que no tiene nada que ver a lo que tenemos hoy en día, y además, solo muy pocas personas tenían acceso a la red. Aún así, después que se produjera la filtración de un documento que describía el funcionamiento del servicio 911 de emergencias del país, el Servicio Secreto de los Estados Unidos registró las casas de varias personas invadiendo su privacidad de forma arbitraria, ya que la legislación en esta materia era practicamente inexistente.\nSteve Jackson, un editor de Texas, fue una de las personas que sufrieron este registro donde todos sus equipos informáticos de su oficina fueron requisados, dejando su negocio al borde de la ruina; pero además, cuando los ordenadores le fueron devueltos comprobaron que todos los correos electrónicos habían sido leídos y eliminados. Este caso fue el primero, pero hubo otros que llamaron la atención de Mitch Kapor, John Gilmore y John Perry Barlow, que se conocían de las primitivas comunidades en el Internet de la época y además compartían un gran interés por los derechos digitales, decidieron que tenían que hacer algo para garantizar las libertades civiles de los usuarios de nuevas tecnologías. Así fue como nació la EFF y empezó a llevar a cabo las batallas legales donde los internautas luchan por sus derechos, batallas que a día de hoy se siguen librando.\nDesde Interferencias, unas de cosas que queremos es que todo el mundo sea consciente del peligro que que implica el desconocer nuestros “derechos digitales” y como continuamente se están vulnerando mediante la invasión de la privacidad y la vigilancia masiva, es por eso que vamos a organizar una charla en la que dar a conocer la Electronic Frontier Foundation, que además de pelear por nuestros derechos como hemos explicado, cuenta con una cantidad de descomunal de recursos que podemos utilizar, disponibles para todo el que quiera hacer uso de ellos.\n💬 ORGANIZA. Interferencias\n🏢 LUGAR. Escuela Técnica Superior de Ingenierías Informática y de Telecomunicación (Sala de Usos Múltiples). Calle Periodista Daniel Saucedo Aranda, s/n.\n⏰ HORA. 12:30 – 13:30\n🎫 REGISTRO. https://www.meetup.com/es-ES/Granada-Geek/events/238434361/\n\n                                      "], "listaEtiquetas": [], "listaCategorias": [" OSL "]}{"autor": ["German Martinez"], "titulo": ["Agenda de actividades 6 al 12 de marzo de 2017"], "contenido": ["\r\n              Ya estamos entrando en marzo, y aunque no sepamos si el tiempo acompañará, las actividades tenemos seguro que sí, prueba de ello es todo lo que hay organizado esta semana, especialmente las relacionadas con el “Día Internacional de la Mujer Trabajadora”. Además, siguiendo la racha de hackatones este fin de semana tenemos el primer hackatón Certamen de Proyectos Libres de la UGR.\n\n✴️ MARTES 7 ➡️ ‘Programa ETSIIT de capacitación profesional: “Introducción al Cloud Computing”’. Tradicionalmente para montar la infraestructura hardware de un sistema (en el mejor de los casos) se hace un análisis de requerimientos en el que se contemplan los recursos que se estiman que serán necesarios para el correcto funcionamiento de la plataforma. El problema que se presenta con esto es que tenemos una infraestructura estática en la que si de repente los recursos necesarios crecen lo suficiente, el sistema no podrá aguantar la carga e irremediablemente se vendrá abajo aunque sea de forma momentánea.\nEsta situación que de por si misma ya representa un gran problema, puede que no tenga una fácil solución si el único remedio es añadir elementos hardware más potentes (lo que no siempre es posible) o añadir más máquinas (lo que puede ser una solución inviable para situaciones puntuales).\nLa solución sería tener un sistema con una gran cantidad de recursos compartidos de forma invisible que sea capaz de provisionar y configurar sistemas de forma automática y rápidamente en función de las necesidades en un momento determinado; esta es la idea de la computación en la nube, ofrecer todo un sistema informático como un servicio dinámico accesible desde cualquier lugar con independencia del dispositivo o la ubicación desde el que se accede.\n💬 ORGANIZA. Oficina de Software Libre de la Universidad de Granada\n🏢 LUGAR. Escuela Técnica Superior de Ingenierías Informática y de Telecomunicación (Salón de Grados). Calle Periodista Daniel Saucedo Aranda, s/n.\n⏰ HORA. 12:30 – 13:30\n🎫 REGISTRO. https://www.meetup.com/es-ES/Granada-Geek/events/237481323/\n\n✴️ MIÉRCOLES 8 ➡️ ‘Editatón “Mujeres y UGR 2017″’. En el Día Internacional de la Mujer Trabajadora, de nuevo trataremos de visibilizar el trabajo de las profesoras, investigadoras y artistas de Granada y la Universidad con un nuevo editatón de la Wikipedia. En un editatón nos centramos en crear contenido para la Wikipedia: texto, imágenes y datos; se crean páginas si no existen y se mejoran las páginas existentes con imágenes, referencias y datos adicionales. En el editatón se hará una breve introducción a la Wikipedia, cómo editarla y qué requisitos tiene su contenido, para a continuación se tratar de editar las páginas que se elijan, coordinándonos entre los presentes para no “pisarnos” el trabajo. La sala no tiene ordenadores, por lo que conviene que te traigas tu propio portátil. Nosotros proporcionamos la conexión de Internet.\nPor limitaciones de la propia Wikipedia, se aconseja que se abra cuenta en la misma previamente al evento. Las páginas que se han preseleccionado están en esta página del encuentro: https://es.wikipedia.org/wiki/Wikipedia:Encuentros/Mujeres_y_UGR_2017\nTambién puedes participar desde tu casa. Simplemente añade tu firma a la lista de participantes.\n💬 ORGANIZA. Oficina de Software Libre de la Universidad de Granada\n🏢 LUGAR. Escuela Técnica Superior de Ingenierías Informática y de Telecomunicación (Sala de Juntas). Calle Periodista Daniel Saucedo Aranda, s/n.\n⏰ HORA. 11:30 – 13:30\n🎫 REGISTRO. https://www.meetup.com/es-ES/Granada-Geek/events/238145532/\n\n✴️ MIÉRCOLES 8 ➡️ ‘Mesa redonda: Día Internacional de la Mujer Trabajadora’. Desde la Delegación de Estudiantes de la ETSIIT se ha organizado una mesa redonda con motivo del Día Internacional de la Mujer Trabajadora, para hablar sobre el carácter decreciente en la cantidad de chicas matriculadas en las carreras de ingeniería y sus razones. Hablaremos de los datos de matriculación y compartiremos experiencias.\nAsistencia libre, ¡apúntate!\n💬 ORGANIZA. Delegación de Estudiantes de la ETSIIT\n🏢 LUGAR. Escuela Técnica Superior de Ingenierías Informática y de Telecomunicación (Salón de Actos). Calle Periodista Daniel Saucedo Aranda, s/n.\n⏰ HORA. 13:30\n🎫 REGISTRO. https://www.meetup.com/es-ES/Granada-Geek/events/238139583/\n\n✴️ MIÉRCOLES 8 ➡️ ‘Patrimonio Abierto. Mujeres Creadoras: Homenaje a Carmen Jiménez’. Continuando con el programa “Patrimonio abierto” que hacen conjuntamente el Vicerrectorado de Extensión Universitaria a través del Secretariado de Bienes Culturales en colaboración con la Oficina de Software Libre de la Universidad de Granada tenemos esta vez “Mujeres Creadoras: Homenaje a Carmen Jiménez”.\nEste evento forma parte de un programa denominado “Patrimonio Abierto” cuyos principales objetivos son la divulgación y accesibilidad al patrimonio cultural universitario por parte de la comunidad, en el convencimiento de que el primer paso para su conservación es su conocimiento.\nEste acto consitirá en un homenaje a las mujeres creadoras centrado sobre todo en la figura de Carmen Jiménez y otras creadoras con obras en la colección de la UGR.\nPonentes:\n\nM. Luisa Bellido Gant. Directora del Secretariado de Bienes Culturales.\nFrancisco J. Sánchez Montalbán. Director de la Colección de Arte Contemporáneo de la Universidad de Granada.\nA. Fernandez Moreno\n\n💬 ORGANIZA. Oficina de Software libre de la Universidad de Granada / Secretariado de Bienes Culturales [Vicerrectorado de Extensión Universitaria de la Universidad de Granada]\n🏢 LUGAR. Facultad de Bellas Artes Alonso Cano (Aula Informática 3).Avenida de Andalucía, s/n.\n⏰ HORA. 18:00 – 20:00\n🎫 REGISTRO. https://www.meetup.com/es-ES/Granada-Geek/events/237494801/\n\n✴️ VIERNES 10 – LUNES 13 ➡️ ‘Primer hackatón Certamen de Proyectos Libres de la UGR’. Desde hace varios años realizamos el Certamen de Proyectos Libres de la UGR con el objetivo de promover la producción, el conocimiento y el uso del software, hardware y documentación libres y la filosofía de colaboración y comunidad asociada a ellos, premiando a proyectos y colaboraciones realizadas en el ámbito académico y educativo. Las bases del propio certamen están publicadas aquí.\nPrecisamente para ayudar a fomentar esa filosofía de colaboración, todos los años realizamos al menos un hackatón en el que cada uno de los grupos participantes exponen la idea de su proyecto, así todo el mundo puedo conocerlos mejor y de paso encontrar colaboradores que les ayuden de cualquier forma, ya sea completando tareas concretas necesarias para la realización del proyecto o dándoles nuevas ideas para el planteamiento del mismo.\nPara empezar el viernes en la ETSIIT se harán las presentaciones de los proyectos que vayan a participar en el hackatón, una vez hayan sido presentados todos los proyectos los participantes del hackatón decidirán en que proyecto quieren colaborar y la tarde de ese mismo día pueden comenzar a trabajar. Durante el sábado y el domingo, la Corrala de Santiago nos ha cedido sus salas para que los participantes puedan reunirse allí y seguir con el trabajo. Para finalizar, el lunes se hará una presentación de resultados sobre la evolución del proyecto durante el hackatón.\n💬 ORGANIZA. Oficina de Software libre de la Universidad de Granada\n🏢 LUGAR. Escuela Técnica Superior de Ingenierías Informática y de Telecomunicación (Sala de Usos Múltiples). Calle Periodista Daniel Saucedo Aranda, s/n.\n⏰ HORA. A partir de las 09:30.\n🎫 REGISTRO. https://www.meetup.com/es-ES/Granada-Geek/events/238185217/\n\n✴️ SÁBADO 11 ➡️ ‘Reunión Interferencias Marzo’. Reunión mensual del grupo Interferencias para tratar temas de actualidad sobre privacidad, derechos en Internet y temas similares. Como en todas las reuniones primero hablaremos sobre los proyecto actuales del grupo, de entre los que destacan el ciclo de charlas que están llevando a cabo (introducción a la privacidad, redes Tor y moneda Bitcoin) que próximamente estarán disponibles en vídeo y el podcast que están gestionando para empezar a funcionar, además del evento que tienen en proyecto montar sobre los temas de interés del grupo.\nTambién como el grupo cada vez es más numeroso y de puntos geográficos bastante distantes entre si, están buscamos formas de colaborar más activamente entre todos los integrantes sin que la distancia sea un problema. Para terminar se realizará un debate sobre temas de actualidad como hacen en todas las reuniones, concretamente en la reunión anterior hablaron sobre las políticas invasivas de la privacidad llevas a cabo por Estados Unidos, el bloqueo de acceso a Internet en las regiones angloparlantes de Camerún o la inimaginablemente fácil que podría ser “robar” tus huellas dactilares mediante las fotos que subes a tus redes sociales.\n💬 ORGANIZA. Interferencias\n🏢 LUGAR. Continental Café Pub Granada. Calle Seminario, 11\n⏰ HORA. 20:00 – 22:00\n🎫 REGISTRO. https://www.meetup.com/es-ES/Granada-Geek/events/238188284/\n\n                                      "], "listaEtiquetas": [], "listaCategorias": [" OSL "]}{"autor": ["German Martinez"], "titulo": ["Agenda de actividades 13 al 19 de marzo de 2017"], "contenido": ["\r\n              \n✴️ MARTES 14➡️ ‘Programa ETSIIT de capacitación profesional: “Plataforma como servicio, publicando tus aplicaciones en la web”’. Casi sin darnos cuenta todo lo que nos rodea hoy en día son aplicaciones web, la gran expansión que han sufrido está vinculado al auge de Internet, pero es que además presentan grandes ventajas: son accesibles desde cualquier dispositivo con conexión a Internet y además no es necesario instalar nada en nuestro sistema. Hoy en día cualquiera puede realizar una aplicación y publicarla de forma que sea accesible a todo el mundo, pero además todo esto de un forma relativamente fácil y sin tener que montar una infraestructura dedicada para ello; se trata de usar un PaaS.\nUn PaaS (Platform as a Service – Plataforma como Servicio) es una plataforma que ya cuenta con el entorno necesario para que nosotros simplemente tengamos que desplegar en ella nuestra aplicación, sin que tengamos que preocuparnos de la configuración del sistema operativo, el almacenamiento o el acceso a la red; solo tenemos que preocuparnos de que nuestra aplicación sea funcional, el proveedor del servicio (OpenShift, Heroku, Bluemix, Google App Engine…) se encarga del resto por nosotros.\n💬 ORGANIZA. Oficina de Software Libre de la Universidad de Granada\n🏢 LUGAR. Escuela Técnica Superior de Ingenierías Informática y de Telecomunicación (Aula -1.2 [Aula Polivalente]). Calle Periodista Daniel Saucedo Aranda, s/n.\n⏰ HORA. 12:30 – 13:30\n🎫 REGISTRO. https://www.meetup.com/es-ES/Granada-Geek/events/237483362/\n\n✴️ MARTES 14 ➡️ ‘Taller de Edison para docentes’. Taller para docentes de Educación Primaria y Secundaria sobre el robot educativo Edison. El robot Edison cuenta con dos motores de velocidad y varios sensores que puede ser programados fácilmente mediante un sistema de arrastrar y soltar iconos gráficos que permiten que indicar las instrucciones que tiene que seguir el robot sea fácil y divertida, pudiendo funcionar bajo cualquier sistemas operativo en sistemas de sobremesa o móviles ya que utiliza utiliza un sistema basado.\nAdemás, como ventaja a la hora de enseñar a los más pequeños, es muy resistente y soporta sin problemas caídas y presiones. Puede detectar señales de control remoto y su diseño exterior es compatible con LEGO, por lo que se pueden usar sus elementos como complementos al propio Edison, pero lo mejor es que se pueden combinar varios robots Edison para funcionar conjuntamente, ampliando así sus posibilidades\nPara inscribirse acceder a este formulario. Disponibilidad de 20 plazas por riguroso orden de inscripción.\n💬 ORGANIZA. Club de Tecnología, Programación y Robótica Granada\n🏢 LUGAR. Centro del Profesorado de Granada. Camino de Sta. Juliana, 3.\n⏰ HORA. 17:00 – 19:00\n🎫 REGISTRO. https://www.meetup.com/es-ES/Granada-Geek/events/237783389/\n\n✴️ MIÉRCOLES 15➡️ ‘Google Cloud Next ’17’.Llega el evento de Google sobre cloud computing. Durante los días del 8 al 10 de marzo, diversas conferencias y actividades se realizarán en la sede del gigante de Internet.\nDesde GDG Granada, os invitamos a reunirnos el 15 de marzo en el Salón de Actos de la Escuela Técnica Superior de Ingenierías Informática y Telecomunicación para traeros las últimas novedades.\nEl evento es totalmente gratuíto.\n\nPresentación de las novedades cloud\nStreaming\nCharlas técnicas de 20 min\n\n¿Te lo vas a perder?\n💬 ORGANIZA. Google Developer Groups Granada\n🏢 LUGAR. Escuela Técnica Superior de Ingenierías Informática y de Telecomunicación (Salón de Actos). Calle Periodista Daniel Saucedo Aranda, s/n.\n⏰ HORA. 17:00 – 19:00\n🎫 REGISTRO. https://www.meetup.com/es-ES/GDG_Granada/events/237867716/\n\n✴️ JUEVES 16 ➡️ ‘Básicos de la OSL: “Creando páginas web con HTML desde 0″’. Lo primero para crear páginas web es conocer el lenguaje HTML (HyperText Markup Language – Lenguaje de Marcas de Hipertexto), un lenguaje muy simple con el que podremos realizar la descripción de una página web y cómo están estructurados todos sus elementos dentro de la misma, tanto su texto como el resto de elementos: imágenes, sonidos, vídeos, etc…\nPara definir esta estructura se utilizan lo que se conocen como etiquetas o marcas, por eso este tipo de lenguajes se conocen como lenguajes de marcado. Además de aprender a cómo crear una página web, también se darán ejemplos de dónde se pueden albergar pequeñas páginas personales que pueden sernos útiles para utilizarlas como un pequeño blog personal o como portafolio para mostrar nuestros proyectos al mundo.\n💬 ORGANIZA. Oficina de Software Libre de la Universidad de Granada\n🏢 LUGAR. Escuela Técnica Superior de Ingenierías Informática y de Telecomunicación (Aula -1.2 [Aula Polivalente]). Calle Periodista Daniel Saucedo Aranda, s/n.\n⏰ HORA. 13:30 – 14:00\n🎫 REGISTRO. https://www.meetup.com/es-ES/Granada-Geek/events/236041736/\n\n✴️ VIERNES 17 ➡️ ‘Jornadas RSME-AMAT para curiosos de la matemáticas’. Esta es una iniciativa que surge de la colaboración entre a Real Sociedad Matemática Española (RSME) y la Asociación de Estudiantes de Matemáticas de la Universidad de Granada (AMAT). Gratuitas y abiertas a todo el público, estas jornadas se realizan en un ambiente inigualable donde estudiantes y profesorado se unen para hablar y hacer talleres sobre matemáticas a todos los estudiantes de todos los grados interesados por esta maravillosa rama científica.\nSi te interesan las matemáticas y quieres pasar una mañana muy entretenida aprendiendo más sobre ellas y sus sorprendentes aplicaciones, no lo dudes y pásate, te esperan el viernes 17 de Marzo en el Salón de Grados (edificio de Matemáticas) de la Facultad de Ciencias a las 10:00.\nOs recomendamos seguirlos por Twitter @AMATugr para estar informados de cualquier novedad. En la web https://sites.google.com/view/jornadasrsmeamat/ podréis encontrar información de las jornadas, horarios, lugares y el programa. También podéis acceder por allí al formulario para todos aquellos que queráis diploma de asistencia.\n💬 ORGANIZA. Asociación de Estudiantes de Matemáticas de la Universidad de Granada / Real Sociedad Matemática Española\n🏢 LUGAR. Facultad de Ciencias (Salón de Grados – Edificio Matemáticas). Avenida Fuente Nueva, s/n.\n⏰ HORA. A partir de las 10\n🎫 REGISTRO. https://www.meetup.com/es-ES/Granada-Geek/events/238266111/\n\n                                      "], "listaEtiquetas": [], "listaCategorias": [" OSL "]}{"autor": ["admin"], "titulo": ["Mini-tutorial de edición de Wikidata"], "contenido": ["\r\n              En el editatón del día de la mujer y la ciencia nos hemos propuesto aumentar la visibilidad y la riqueza de los datos de las mujeres relacionadas con la universidad de Granada. Es básico editar, y para eso está el manual para trabajar en el editatón de Chá. Pero también cada vez más la Wikipedia se usa para procesar y extraer información automáticamente, y para eso está Wikidata. Además de editar una entrada, conviene que le añadamos datos. A continuación voy a explicar cómo se puede añadir la referencia de que una persona estudió en la Universidad de Granada.\nVayamos a una entrada tal tomo la de Carmen Batanero, actualmente la mujer con más citas a sus trabajos científicos de la Universidad de Granada. Debajo de la ficha que se encuentra en el lateral, se pincha en editar datos en wikidata para acceder a los datos almacenados sobre ella.\nEn esta nueva página nos encontraremos información estructurada: nombres, porejemplo, y descripciones procedentes de diferentes instancias de la Wikipedia, la española y la inglesa. Y a continuación, Statements o afirmaciones sobre ella. Queremos añadir la afirmación de que estudió en la Universidad de Granada, así que nos vamos al final de esa sección, justo antes de donde pone identifiers, y presionamos +add.\nAparecerá un cuadro con property y un desplegable. Si queremos añadir que estudió en la Universidad de Granada, buscamos studied at y nos aparecerá educated at (studied at), educational institution attended by the subject. Lo presionamos para añadirlo y el formulario colocará el cursor en la entrada siguiente, donde tendremos que indicar “University of Granada”. Según vayamos tecleando aparecerá un desplegable de donde podemos seleccionar cuando aparezca el nombre de la universidad. A continuación tenemos que presionar en “Save” para guardarlo, pero no queda la cosa ahí, porque hay que cualificar dónde se ha obtenido esa información. Si es un dato que aparece en la misma página de la wikipedia, presionamos en +add reference. En el primer campo del formulario indicamos “imported from” para indicar donde se ha obtenido el dato y a continuación Spanish Wikipedia si es de esa versión de la Wikipedia donde se ha hallado. Conviene que todos los datos estén contrastados, de la misma forma que en la Wikipedia. Para terminar de añadir la referencia, se pulsa una vez más save que aparece justo encima de las referencias, con lo que estará el dato añadido. Se puede comprobar mediante esta petición a Wikidata si se ha hecho correctamente, aunque normalmente los cambios tardan algo en propagarse a los resultados de la búsqueda.\nDe la misma forma se pueden añadir otras afirmaciones. Os animo a que sigáis enriqueciendo la Wikipedia con datos en Wikidata, especialmente de mujeres en esta semana de las mujer y la niña en la ciencia\n                                      "], "listaEtiquetas": [], "listaCategorias": [" OSL "]}{"autor": ["Manu"], "titulo": ["Ubuntu Hackathon con tablets BQ"], "contenido": ["\r\n              El viernes pasado realizamos en la Oficina de Software Libre de la Universidad de Granada un Hackathon sobre Ubuntu touch (phone). La empresa BQ, una empresa española que lleva años apostando y desarrollando con móviles, tablets e impresoras 3D, no cedió dos tablet Aquarius M10 con Ubuntu Edition para un par de meses.\n\nEn este Hackathon, tanto las personas que acudieron como los que estamos todos los días en la oficina, comenzamos con la instalación del SDK, esto conlleva unos pasos previos, ya que cada uno traía su propia distribución y/o versión de GNU/Linux.\nSeguimos como iniciación al desarrollo el excelente tutorial de Miguel, en Twitter mimecar\nhttps://mimecar.gitbooks.io/curso-de-programacion-de-ubuntu-phone-touch/content/chapter-02-sdk.html\nAunque lo idóneo hubiese sido que cada uno trajese ya instalado el SDK, porque cuando se programa en cualquier lenguaje se utiliza un SDK (Software Development Kit), no fue el caso y aprendimos a resolver diferentes inconvenientes y problemas de dependencias, esto se quiera o no te ayuda para futuras instalaciones y/o configuraciones del SDK de Ubuntu en distintas distribuciones y escritorios de GNU/Linux.\nEste es el comienzo de una serie de eventos-hackathones que pensamos realizar mientras dispongamos de estas dos tablets, la idea o un reto es conseguir realizar una app importante, utilizando una API abierta y que no este en la tienda de Ubuntu.\nVídeo sobre las dos tablets Aquais M10 de BQ con Ubuntu Edition publicado en nuestro Facebook, que esperas para seguirnos 😀\n\n(function(d, s, id) {  var js, fjs = d.getElementsByTagName(s)[0];  if (d.getElementById(id)) return;  js = d.createElement(s); js.id = id;  js.src = \"//connect.facebook.net/es_ES/sdk.js#xfbml=1&version=v2.3\";  fjs.parentNode.insertBefore(js, fjs);}(document, 'script', 'facebook-jssdk'));\n\nUnboxings de la OSL: Tablet BQ Aquarius m10 Ubuntu edition\nEn este vídeo hablamos de las Bq readers con Ubuntu que estamos probando en la Oficina de Software Libre de la Universidad de Granada. Próximamente, escribiremos sobre ello en nuestro blog http://osl.ugr.es/¡Gracias a Incho Cordero y Jara Catalán por la ayuda!¿a que salimos guapos? 😀\nPublicado por Oficina de Software Libre de la Universidad de Granada en Viernes, 17 de febrero de 2017\n\n                                      "], "listaEtiquetas": [], "listaCategorias": [" OSL "]}{"autor": ["Alejandro García Montoro"], "titulo": ["Autodesk EAGLE, un ejemplo de por qué preferimos software libre "], "contenido": ["\r\n              Que el software libre es mejor en muchos aspectos lo sabemos bien en esta oficina. Pero hoy queríamos hablaros de lo que ha ocurrido con EAGLE en las últimas semanas; un problema para miles de usuari_s que refleja muy bien una de las muchas razones por las que free as in freedom no es sólo un lema.\nEAGLE es un software destinado al diseño de placas de circuito impreso (PCBs) que, históricamente, ha jugado un papel muy importante en el círculo maker/hacker por ser una de las primeras opciones con licencias gratuitas limitadas. Sin ir más lejos, los archivos de diseño de Arduino están publicados en su formato y, además, es una de las pocas opciones en el mundo de la automatización de diseño electrónico con soporte para Linux.\nEs un buen software con múltiples facilidades para el diseño de PCBs, es multiplataforma y tiene una buena comunidad de usuarios detrás que liberan gran cantidad de proyectos para usarlos o estudiarlos.\nSin embargo, EAGLE no es software libre.\nEsto no sólo hace imposible que puedas estudiar el código del programa, mejorarlo, poder compartirlo con tu compañera de laboratorio o con tu vecino que está aprendiendo electrónica; también da lugar a cambios inesperados como el que anunció Hackaday el 19 de enero: EAGLE pasa a tener un sistema de suscripción mensual. En su versión limitad(ísim)a ahora cuesta 15$ al mes o 100$ al año. Si necesitas manejar más de dos esquemáticos o pretendes construir una PCB con un área mayor a 160cm2 —características muy necesarias si pretendes hacer un proyecto con algo más de envergadura— la suscripción asciende a 65$ al mes o 500$ al año.\nEsto sorprende más aún cuando echamos la vista atrás y vemos lo que dijo Autodesk sobre el sistema de suscripciones al comprar CadSoft —la empresa que desarrolla EAGLE— en el verano de 2016. En un artículo en el que explicaban la compra y lo que supondría a los usuarios, escribieron una serie de preguntas frecuentes y sus respuestas; entre ellas estaba la siguiente, en la que parecían dejar claro que un sistema de suscripciones era impensable para EAGLE:\nWill I be required to pay ‘maintenance’?\nSimply put, no.\nDe hecho, el problema no reside tanto en el precio —aunque la subida con respecto al sistema de compra anterior es notable— como en el hecho de que, a partir de ahora, nunca vas a ser el dueño del programa. Simplemente estás alquilando su uso por algún tiempo. Si dentro de unos años Autodesk deja de mantener sus servidores o no tienes el suficiente dinero para renovar la suscripción, olvídate de editar tus antiguos proyectos. Y es que, incluso si los servidores están activos y tienes el dinero suficiente, basta con que te quedes sin conexión a Internet para que la autenticación con el servicio de licencias falle y el acceso a un programa que debería ser tuyo te sea denegado.\nA esto es a lo que nos referimos cuando decimos que el software privativo juega con tu libertad.\nSin embargo, el panorama no es tan desolador y siempre hay alternativas libres de igual o mayor calidad que, esta vez sí, están de parte de los usuarios. Es el caso de Kicad, en cuyo desarrollo colaboramos desde la OSL junto con el equipo del CERN.\nDiseño en Kicad de la placa libre IceZUM Alhambra.\nAdemás de trabajar en aspectos técnicos para mejorar el código de Kicad, en estos momentos estamos colaborando en una característica clave para usuarios de EAGLE: la posibilidad de importar sus proyectos a Kicad, de manera que ningún usuario se quede sin acceso a su trabajo por oponerse a una política de suscripciones privativas que no favorecen a nadie. Probablemente ni siquiera a Autodesk, que previsiblemente perderá usuarios en favor de alternativas libres como Kicad.\nAsí que ya sabéis, si alguna vez alguien os pregunta si preferís usar software privativo en vez de software libre, pensad en las libertades que están en juego y responded: Simply put, no.\n                                      "], "listaEtiquetas": [], "listaCategorias": [" Aplicaciones ", " hardware ", " Mundo Libre ", " OSL ", " reflexiones ", " Software Libre "]}{"autor": ["German Martinez"], "titulo": ["Agenda de actividades 13 al 19 de febrero de 2017"], "contenido": ["\r\n              Ya terminado el periodo de exámenes (que esperamos que os hayan salido estupendamente, seguro que sí) volvemos al mismo ritmo de actividades al que os teníamos acostumbrados, así que aprovechad ahora que al principio del cuatrimestre la carga de trabajo es menor y nos dudéis en asistir a cualquiera de las actividades programadas. ¡Todo súper interesante!\n✴️MARTES 14➡️ ‘Programa ETSIIT de capacitación profesional: Introducción al lenguaje de programación Python’.Si hoy en día tuviéramos que pensar en un lenguaje de programación sencillo de aprender este sería sin duda Python, ya que aunque es un lenguaje orientado a objetos como muchos otros, una de las cosas por la que se ha convertido en uno de los favoritos de las personas no-informáticas que se interesan por aprender programación es que su sintaxis es muy limpia y requiere menos código que otros en tareas sencillas.A esas ventajas se le puede añadir que es un lenguaje con una alta demanda, ya que empresas como Google lo utilizan en el desarrollo de sus infraestructuras, o que también está muy extendido en el ámbito web debido a la popularidad de frameworks como Django. Además, gracias a sus popularidad tiene una de las mayores comunidades detrás que fomentan el soporte y el desarrollo, en gran parte porque viene preinstalado en la mayoría de sistemas GNU/Linux ya que es necesario para el funcionamiento de este.\n💬 ORGANIZA. Oficina de Software Libre de la Universidad de Granada / ETS de Ingenierías Informática y de Telecomunicación de la UGR\n🏢 LUGAR. Escuela Técnica Superior de Ingenierías Informática y de Telecomunicación. Salón de Grados. Calle Periodista Daniel Saucedo Aranda, s/n.\n⏰ HORA.:30 – 13:30\n🎫 REGISTRO.https://www.meetup.com/es-ES/Granada-Geek/events/237476688/\n\n\n✴️MIÉRCOLES 15➡️ ‘La Iglesia de Emacs #granada: “Aprendamos a usar el Org mode”’.Org mode es un modo de edición del editor (y súper programa en general) Emacs que nos permite editar documentos jerárquicos en texto plano, con lo que podemos conseguir realizar fácilmente listas de cosas por hacer (TO-DO) y planificación de proyectos con un sistema de textos simple, rápido y eficaz. Además también tiene elementos preestablecidos orientados a la programación literaria y la ciencia reproducible. Su objetivo es que sea posible mantener el contenido de archivos grandes de una forma bien estructurada: si queremos crear tablas podemos un editor de tablas integrado, podemos usar enlaces en texto plano para conectar con sitios web, emails, mensajes de Usenet, entradas de la Big Brother Database y cualquier archivo relacionado con los proyectos. Además, desde este modo cómodamente podemos exportar a una gran cantidad de formatos como HTML, LaTeX, Open Document o Markdown, pudiendo añadir nuevos formatos por nuestra cuenta; y por si todo esto es poco, también reconoce bloques de código fuente, por lo que también es muy cómodo para realizar documentos técnicos en los que añadir código de ejemplo.\n💬 ORGANIZA.Oficina de Software Libre de la Universidad de Granada\n🏢 LUGAR. Escuela Técnica Superior de Ingenierías Informática y de Telecomunicación. Sala de Usos Múltiples. Calle Periodista Daniel Saucedo Aranda, s/n.\n⏰ HORA.:30 – 12:30\n🎫 REGISTRO.https://www.meetup.com/es-ES/Granada-Geek/events/237509990/\n\n✴️MIÉRCOLES 15➡️ ‘Te espían, te estudian, te controlan: dale importancia a tu privacidad en la red’.Inicio del ciclo de charlas sobre privacidad, los derechos digitales y la seguridad informática organizado por el grupo Interferencias. La primera charla va a tratar sobre conocimientos básicos que deberías tener para proteger tu privacidad cuando navegas por Internet, ya que la privacidad no es solo importante para las “malas personas”; para nosotros, para ti, y para cualquier debería ser algo que todos deberíamos preocuparnos por proteger siempre, ya que si no nos podemos expresar como personas libres no podremos desarrollarnos como personas de forma plena y mulitidimensional, siempre nos encontraremos cohibidos por “el que mira”. Además, este es un escenario de continuo cambio en la que las leyes existentes son todavía muy ambiguas y hay todavía muchas por hacer, es por eso que si permitimos que pisoteen nuestros derechos en la Red de hoy, no nos espera un futuro agradable en el mañana.¿Qué es la privacidad en la red? ¿Por qué debería importarnos? ¿Cuánta información producimos? ¿En qué sentido nos hace vulnerables? ¿Qué más da que me vigilen si no hago nada malo? ¿De quién debemos defendernos? ¿Qué herramientas tenemos para ello? ¿Quién está de nuestro lado? Errores preconcebidos sobre ella. Costumbres básicas sobre privacidad, recursos (p. ej. Tor). FSF, EFF…\n💬 ORGANIZA. Interferencias\n🏢 LUGAR.Facultad de Ciencias. Aula G11. Avenida Fuente Nueva, s/n.\n⏰ HORA.:00 – 19:00\n🎫 REGISTRO.https://www.meetup.com/es-ES/Granada-Geek/events/237510170/\n\n✴️JUEVES 16➡️ ‘Básicos de la OSL: Intérprete de comandos Bash desde 0’.Taller rápido en el que se aprenderá cómo usar un intérprete de comandos Bash desde 0. Si hay algo que caracteriza los los sistemas operativos es el poder administrar todo el sistema desde un terminal con un intérprete de comandos, y si además tenemos que destacar alguno ese sería sin duda Bash, el interprete de comandos por defecto en la mayoría de las distribuciones GNU/Linux. Usando en conjunto el intérprete de comandos Bash con otros programas que encontramos por defecto en la mayoría de las distribuciones GNU/Linux podremos automatizar la mayor parte de las tareas necesarias para la gestión de nuestro sistemas, ya que estos comandos nos permiten realizar operaciones tanto sobre los archivos y directorios como sobre los usuarios y procesos, sin olvidarnos tampoco de los dispositivos en el sistema de un forma local o remota.\n💬 ORGANIZA.Oficina de Software Libre de la Universidad de Granada\n🏢 LUGAR.Escuela Técnica Superior de Ingenierías Informática y de Telecomunicación. Aula -1.2 (Aula Polivalente). Calle Periodista Daniel Saucedo Aranda, s/n.\n⏰ HORA.:30 – 14:00\n🎫 REGISTRO.https://www.meetup.com/es-ES/Granada-Geek/events/237472631/\n\n✴️VIERNES 17➡️ ‘Patrimonio Abierto: #UnidosxElPatrimoni­o’.#UnidosxElPatrimonio es un movimiento mundial impulsado por la UNESCO cuyo objetivo es celebrar y salvaguardar el patrimonio y la diversidad culturales en todo el mundo. La campaña, puesta en marcha en respuesta a los ataques sin precedentes contra el patrimonio ocurridos recientemente, es un llamamiento a todas las personas para que hagan frente al extremismo y la radicalización celebrando los lugares, los objetos y las tradiciones culturales que otorgan al mundo riqueza y dinamismo. Este evento forma parte de un programa denominado Patrimonio Abierto cuyos principales objetivos son la divulgación y accesibilidad al patrimonio cultural universitario por parte de la comunidad, en el convencimiento de que el primer paso para su conservación es su conocimiento. La actividad se dividirá en un taller informativo sobre el uso de licencias libres para creadores de contenidos, y una ruta por el centro de la ciudad para fotografiar edificios monumentales universitarios y publicarlas en las redes sociales añadiendo algún adjetivo que describa el significado que éste tiene para ti, incluyendo previamente los hastags #PatrimonioAbiertoUGR y #UnidosxElPatrimonio.\n💬 ORGANIZA.Oficina de Software Libre de la Universidad de Granada /Secretariado de Bienes Culturales [Vicerrectorado de Extensión Universitaria] de la Universidad de Granada\n🏢 LUGAR.Centro de Enseñanzas Virtuales de la Universidad de Granada. Aula Darro.Calle Real de Cartuja, 36-38.\n⏰ HORA. A partir de las 12:00\n🎫 REGISTRO.https://www.meetup.com/es-ES/Granada-Geek/events/237494616/\n\n✴️ VIERNES 17 ➡️ ‘Taller sobre Python y Django’. Desde Geek &amp; Tech Girls organizan un taller sobre Python y Django. La sencillez de Python para programar se complementa perfectamente con Django, un framework open source para hacer aplicaciones web de forma rápida y sencilla, además gracias a que cuanta con un sistema de administración que viene activado por defecto simplifica su configuración. Otra gran ventaja es que mediante su ORM (Object-Relational Mapping, Mapeo Objeto-Relacional) podemos realizar consultas a la base de datos sin tener que usar consultas en ningún lenguaje, todo mediante uso de métodos y parámetros. El taller será el viernes 17 de febrero por la tarde en la ETSIIT. En el taller podéis participar de dos formas distintas: como alumn@s o como tutoras/es. El objetivo es tener el máximo número posible de tutoras/es, para poder así hacer subgrupos por nivel. La participación es totalmente gratuita. Para apuntarte como alumn@, rellena este formulario. Y para apuntarte como tutor, este otro.\n💬 ORGANIZA. Geek &amp; Tech Girls\n🏢 LUGAR. Escuela Técnica Superior de Ingenierías Informática y de Telecomunicación. Aula 3.7. Calle Periodista Daniel Saucedo Aranda, s/n.\n⏰ HORA.:00\n🎫 REGISTRO. https://geekandtechgirls.github.io/eventos/2017/01/12/Taller-sobre-python-django.html\n\n                                      "], "listaEtiquetas": [], "listaCategorias": [" OSL "]}{"autor": ["German Martinez"], "titulo": ["Agenda de actividades 20 al 26 de febrero de 2017"], "contenido": ["\r\n              Esperamos que ya hayáis vuelto a coger el ritmo con la primera semana de clase, porque esta semana viene cargada de actividades, ¡no hay un día de la semana que no haya alguna actividad!. Coged vuestro calendario y empezar a reservar fechas:\n✴️LUNES 20 ➡️ ‘Interferencias: “Te espían, te estudian, te controlan: dale importancia a tu privacidad en la red”’.Inicio del ciclo de charlas sobre privacidad, los derechos digitales y la seguridad informática organizado por el grupo Interferencias. La primera charla va a tratar sobre conocimientos básicos que deberías tener para proteger tu privacidad cuando navegas por Internet, ya que la privacidad no es solo importante para las “malas personas”; para nosotros, para ti, y para cualquier debería ser algo que todos deberíamos preocuparnos por proteger siempre, ya que si no nos podemos expresar como personas libres no podremos desarrollarnos como personas de forma plena y mulitidimensional, siempre nos encontraremos cohibidos por “el que mira”. Además, este es un escenario de continuo cambio en la que las leyes existentes son todavía muy ambiguas y hay todavía muchas por hacer, es por eso que si permitimos que pisoteen nuestros derechos en la Red de hoy, no nos espera un futuro agradable en el mañana. ¿Qué es la privacidad en la red? ¿Por qué debería importarnos? ¿Cuánta información producimos? ¿En qué sentido nos hace vulnerables? ¿Qué más da que me vigilen si no hago nada malo? ¿De quién debemos defendernos? ¿Qué herramientas tenemos para ello? ¿Quién está de nuestro lado? Errores preconcebidos sobre ella. Costumbres básicas sobre privacidad, recursos (p. ej. Tor). FSF, EFF…\n💬 ORGANIZA.Interferencias\n🏢 LUGAR.Escuela Técnica Superior de Ingenierías Informática y de Telecomunicación (Sala de Usos Múltiples). Calle Periodista Daniel Saucedo Aranda, s/n.\n⏰ HORA. 12:30 – 13:30\n🎫 REGISTRO.https://www.meetup.com/es-ES/Granada-Geek/events/237510307/\n\n✴️MARTES 21 ➡️ ‘BeerJS Granada: React Native’.React es un framework JavaScript con licencia libre desarrollado por Facebook muy usado actualmente para el trabajo en frontend de diversas plataformas web; el propio Facebook la utiliza en partes de su plataforma y en otras plataformas de su propiedad como es Instagram. A diferencia de otras frameworks como Angular o Backbone, React no es un framework para el desarrollo del cliente, más bien es un framework para crear interfaces de usuarios, encargándose solo del renderizado de las vistas de una aplicación web, haciéndolo además con un mayor rendimiento que otros frameworks. Basándose en esto nos encontramos React Native, un framework (también libre) orientado a construir aplicaciones móviles usando solo JavaScript. Para conseguir esto React Native se basa en NodeJS, el entorno de ejecución de JavaScript en servidores. La ventaja principal es disponer de el ecosistema de JavaScript para usarlo en una aplicación móvil, esto a su vez facilita el desarrollo de aplicaciones híbridas que tradicionalmente habían tenido el problema añadido del pobre rendimiento que presentaban. Si quieres aprender más sobre esta tecnología no dudes en venir a la charla, ya que una vez finalizada podemos intercambiar diferentes puntos de vista sobre el uso de JavaScript en la actualidad con una cerveza (o lo que cada uno quiera) en la mano.\n💬 ORGANIZA.Oficina de Software Libre de la Universidad de Granada\n🏢 LUGAR.Escuela Técnica Superior de Ingenierías Informática y de Telecomunicación (Sala de Usos Múltiples). Calle Periodista Daniel Saucedo Aranda, s/n.\n⏰ HORA. 19:00 – 20:00\n🎫 REGISTRO.https://www.meetup.com/es-ES/Granada-Geek/events/237725877/\n\n✴️MIÉRCOLES 22 ➡️ ‘Interferencias: “Tor, ¿la herramienta definitiva de anonimato?”’.Desde Interferencias nos presentan una de las herramientas más conocidas para permanecer anónimo en Internet, si se usa de manera correcta. Es vital que todos los usuarios conozcan el hecho de que no somos anónimos en la red y que, de base, no estamos seguros. Quieren que se tome conciencia de este hecho y en este caso queremos también enseñarnos cómo podemos defendernos desde nuestro papel de usuario. Tor no es sólo un navegador (aunque se haya hecho famoso por ello) sino que cualquiera de nuestras aplicaciones puede funcionar bajo dicho protocolo. Es importante conocerlo bien, incluyendo cómo funciona, sus fallos y defectos y, cómo usarlo de la mejor manera. Entre las cosas que se tratarán estarán: ¿Cuál es la arquitectura de la red Tor? ¿Cómo ocultan mi identidad en la red? Vulnerabilidades y fallos de seguridad de Tor, Buenas prácticas a la hora de navegar con Tor, Tor en acción con demostraciones.\n💬 ORGANIZA.Interferencias\n🏢 LUGAR.Escuela Técnica Superior de Ingenierías Informática y de Telecomunicación (Sala de Usos Múltiples). Calle Periodista Daniel Saucedo Aranda, s/n.\n⏰ HORA. 12:30 – 13:30\n🎫 REGISTRO.https://www.meetup.com/es-ES/Granada-Geek/events/237523054/\n\n✴️JUEVES 23 ➡️ ‘Microsoft Tour en la Univesidad de Granada’. ¿Eres un estudiante técnico? ¿Apasionado de la tecnología? ¿Interesado en ella? ¿Un tanto geek? ¿Futurista? Microsoft Academic Tour llega a la UGR gracias al Club .NET para enseñarte las últimas novedades en herramientas cross-platform, que tienes a tu alcance y que están usando la gran parte de empresas y startups. Entre las diferentes charlas se hablará de las últimas tecnologías que podemos usar para potenciar nuestra carrera, cómo combinar Xamarin (la API para crear aplicaciones multiplataforma en C#/.NET) o el Internet of Things (cualquier dispositivo de uso cotidiano al que se le incorpora conectividad a Internet) con Azure (el servicio en la nube de código abierto de Microsoft), y por último, cómo a traves de Cognitive Services se hizo uso de inteligencia artificial para la creación de bots que hacen posible la interacción mediante la visión, la voz, el lenguaje y el conocimiento.\n💬 ORGANIZA.Clubs .NET Spain (Microsoft DX España)\n🏢 LUGAR.Escuela Técnica Superior de Ingenierías Informática y de Telecomunicación (Salón de Actos). Calle Periodista Daniel Saucedo Aranda, s/n.\n⏰ HORA. 10:30 – 13:00\n🎫 REGISTRO.https://www.meetup.com/es-ES/Clubs-NET-Spain/events/235927809/\n\n✴️JUEVES 23➡️ ‘Workshop Xamarin is Coming en UGR’.¿Te imaginas poder crear un Whatsapp 2.0? ¿Y un Pokemon Go 2.0? Es más fácil de lo que te imaginas, y te queremos a enseñar cómo. ¿Por qué lo hacemos? Porque queremos animarte a que no solo seas consumidor de bienes digitales… sino también creador de ellos. ¿Y cómo lo haremos? A través de Xamarin y de profesionales de su tecnología, que te irán explicando el paso a paso y ayudando en todo lo que necesites. Xamarin, que está basado en el entorno de desarrollolibre MonoDevelop que nos permite desarrollar en Linux, OS X y Windows, es un complemento que se añade al entorno de desarrolloMicrosoft Visual Studio y nos permite desarrollar aplicaciones que pueden ser portadas a Android, iOS y Windows.\n💬 ORGANIZA.Clubs .NET Spain (Microsoft DX España)\n🏢 LUGAR.Escuela Técnica Superior de Ingenierías Informática y de Telecomunicación (Aula 1.8). Calle Periodista Daniel Saucedo Aranda, s/n.\n⏰ HORA. 16:00 – 18:00\n🎫 REGISTRO.https://www.meetup.com/es-ES/Clubs-NET-Spain/events/236633516\n\n✴️JUEVES 23➡️ ‘Google Hash Code 2017’. Google está organizando Hash Code, una competición de programación por equipos a nivel internacional para estudiantes universitarios y profesionales del sector.Se plantean una serie de retos de ingeniería en la vida real, cada equipo tiene que resolverlos eligiendo para ello el lenguaje de programación que prefiera. Después de escribir un programa que genere una solución a dicho programa, esta será enviada al sistema de jueces online. Los equipos que obtengan las máximas puntuaciones además de recibir varios regalos de Google se clasificaran para la Ronda Final de que se celebrará en las oficinas de Google París el 1 de Abril.\n💬 ORGANIZA.Google Developers Group Granada\n🏢 LUGAR.Corrala de Santiago. Calle Santiago, 5.\n⏰ HORA. 18:30 – 22:30\n🎫 REGISTRO.https://www.meetup.com/es-ES/GDG_Granada/events/236826125/\n\n✴️VIERNES 24 ➡️ ‘Geek &amp; Tech Girls: “Invisible o desaparece…”’.Desde Geek &amp; Tech Girls tienen como invitada este mes a Isabel Cabezas, “Technical evangelist” en Microsoft y que además estudió Ingeniería Informática en la ETSIIT de la UGR. El futuro es la computación ubicua, que es la integración de la informática en el entorno de la persona, de forma que los ordenadores no se perciban como objetos diferenciados. La idea es interactuar de manera natural con sus dispositivos y realizar cualquier tarea de manera completamente transparente, un paso más allá en el paradigma del uso de los ordenadores de sobremesa. La revolución invisible está aquí y tenemos que estar preparados. Para utilizar cualquier dispositivo, en cualquier localización o formato nos basaremos en el IoT, en sensores, en mini placas que pasen desapercibidos en objetos del día a día, que además conectan a la nube y se comunican por Bluetooth con artilugios no utilizados habitualmente para estos fines. Olvida las pantallas, el ratón y otras interfaces de usuario artificiales, porque además veremos cómo funcionan y consumiremos las grandes herramientas de la comunicación natural: los cognitive services para crear lo que desde hace poco nominamos “inteligencia ambiental”. Tecnologías que se utilizarán en la demo: Intel Edison y NodeJS para programarlo, Cognitive Services (Text Analytics API), Bluetooth, Web Jobs, IoT Hub.\n💬 ORGANIZA. Geek &amp; Tech Girls\n🏢 LUGAR.Escuela Técnica Superior de Ingenierías Informática y de Telecomunicación (Salón de Grados). Calle Periodista Daniel Saucedo Aranda, s/n.\n⏰ HORA. 10:00 – 11:00\n🎫 REGISTRO.https://www.meetup.com/es-ES/Granada-Geek/events/237577541/\n\n                                      "], "listaEtiquetas": [], "listaCategorias": [" OSL "]}{"autor": ["German Martinez"], "titulo": ["Agenda de actividades 23 al 29 de enero de 2017"], "contenido": ["\r\n              Como se acerca el periodo de exámenes, esta semana es bastante más ligera en cuanto a eventos. En cualquier caso, si el calendario te lo permite, tenemos un par de actividades que te pueden ser de interés.\n✴️ MARTES 24 ➡️ ‘BeerJS Granada: Enero 2017’. Después de un parón de un par de meses por Navidad volvemos a juntarnos para una reunión de BeerJS Granada de entusiastas de la tecnología y sobretodo JavaScript. Para esta reunión a parte de ponernos al día con los diferentes proyectos que estamos llevando a cabo y a raíz de un par de sugerencias de la reunión anterior uno de los temas a tratar serán diferentes librerías JavaScript relacionadas con el mundo de las matemáticas como GeoGebra, MathJax, JSXGraph, Viz.js y Algebrite. Como queremos que sea un grupo de todos, puedes sugerir temas más específicos que te resulten de interés (que seguramente también lo sean de más gente) puedes comentar en este issue de GitHub. Además, con la intención de crear comunidad en un ambiente tranquilo y como es costumbre en todas las reuniones de BeerJS a nivel mundial, la idea es que cada uno lleve algo de comer o beber para compartirlo mientras que también compartimos opiniones y puntos de vista.\n💬 ORGANIZA. Oficina de Software Libre de la Universidad de Granada\n🏢 LUGAR. Escuela Técnica Superior de Ingenierías Informática y de Telecomunicación. Calle Periodista Daniel Saucedo Aranda, s/n.\n⏰ HORA. 12:30 – 13:30\n🎫 REGISTRO. https://www.meetup.com/es-ES/Granada-Geek/events/236872670/\n\n✴️ MIÉRCOLES 25 ➡️ ‘Talleres de Software Libre Multimedia: Scribus’. Último de los talleres de software multimedia orientados a presentar a estudiantes interesados diferentes herramientas libres orientadas principalmente al ámbito multimedia, dibujo, imagen y sonido. Esta semana toca hablar sobre Scribus, un programa libre que nos permite realizar la maquetación de todo tipo de documentos (pequeños periódicos y revistas, carteles, folletos, trípticos, boletines de noticias, libros…) de una forma profesional. Scribus cuenta con una interfaz amigable que nos permite diseñar y organizar los elementos de nuestra publicación a golpe de ratón, sabiendo que tenemos una visión directa del resultado actual de nuestra edición gracias a su característica WYSIWYG (what-you-see-is-what-you-get, lo que ves es lo que obtienes), para terminar dándonos la opción de exportar nuestros proyectos a formatos listos para realizar directamente la impresión. El taller será impartido por César González, Licenciado en Bellas Artes e Investigador en el grupo “Creación, Edición y Conservación de la Imagen” del Departamento de Dibujo de la Facultad de Bellas Artes de la UGR.\n💬 ORGANIZA. Oficina de Software Libre de la Universidad de Granada / Facultad de Bellas Artes de la Universidad de Granada\n🏢 LUGAR. Facultad de Bellas Artes Alonso Cano. Aula T3. Calle Periodista Eugenio Selles, s/n.\n⏰ HORA. 18:00 – 21:00\n🎫 REGISTRO. https://www.meetup.com/es-ES/Granada-Geek/events/236844501/\n\n                                      "], "listaEtiquetas": [], "listaCategorias": [" OSL "]}{"autor": ["German Martinez"], "titulo": ["Agenda de actividades 1 al 12 de febrero de 2017"], "contenido": ["\r\n              Como es periodo de exámenes, tocan un par de semanas algo relajadas, pero eso no significa que no haya ninguna actividad a la que tengas que estar atento.\n✴️JUEVES 9➡️ ‘Foto de Ingenieras y Científicas de la ETSIIT. Día Internacional de la Mujer y la Niña en la Ciencia’. Con motivo de la celebración del Día Internacional de la Mujer y la Niña en la Cienciaque desde el 2015 la Asamblea General de las Naciones Unidas decide proclamar el 11 de febrero de cada año, por eso mismo este año desde el 6 al 19 de febrero se realizarán diferentes actividades en todo el mundo para su celebración. En Granada, el grupoGeek &amp; Tech Girls ha propuesto la realización de una foto en grupo en el anfiteatro de la Escuela Técnica Superior de Ingenierías Informática y de Telecomunicación de la Universidad de Granada de todas las mujeres que tienen relación con esta Escuela, sea cual sea la relación que hayan tenido con la misma:profesoras, investigadoras, alumnas, ex-alumnas y personal de administración y servicios.\n💬 ORGANIZA. Geek &amp; Tech Girls\n🏢 LUGAR. Escuela Técnica Superior de Ingenierías Informática y de Telecomunicación (Anfiteatro – Patio de la Escuela). Calle Periodista Daniel Saucedo Aranda, s/n.\n⏰ HORA. 13:00\n🎫MÁS INFO.http://sereingeniera.ugr.es/celebremos-el-11-de-febrero/ |https://11defebrero.org/2017/01/25/foto-de-ingenieras-y-cientificas-de-la-etsiit/\n\n\n✴️VIERNES 10➡️ ‘Hackatón Ubuntu Touch phone’. Ubuntu es uno de los sistemas operativos GNU/Linux con mayor popularidad en la actualidad ya que ha conseguido acerca ese mundo a personas que no tienen un gran conocimiento de la informática. Por otro lado, hoy en día los teléfonos móviles se asemejan más a pequeños ordenadores superpotentes que al clásico teléfono cuya única utilidad era recibir y enviar llamadas o mensajes, de ahí el nombre de “smartphones”; precisamente para gestionar como es debido esa “inteligencia” y sacarle el máximo provecho se utilizan sistemas operativos que nada tienen que envidiar a los de los ordenadores de sobremesa, y aunque los más conocidos son los sistemas de Google y Apple, siendo estos Android y iOS respectivamente, no son ni mucho menos los únicos. Tenemos Ubuntu Touch, que es un sistema operativo móvil basado en esta misma distribución y que además tiene una característica quelo hace especial, es totalmente libre ya que está completamente liberado bajo una licencia GPL; como además también tenemos muchas ganas de probar cosas, hemos decidido realizar un hackatón para ver como se pueden hacer aplicaciones para este sistema, si tú también quieres ver que puedes hacer, aquí te esperamos.\n💬 ORGANIZA. Oficina de Software Libre de la Universidad de Granada\n🏢 LUGAR. Oficina de Software Libre de la Universidad de Granada (Centro de Enseñanzas Virtuales de la Universidad de Granada. Planta Baja). Calle Real de Cartuja, 36-38.\n⏰ HORA.:00 – 14:00\n🎫REGISTRO.https://www.meetup.com/es-ES/Granada-Geek/events/237133141/\n\n\n✴️VIERNES 10➡️ ‘Editatón “Día internacional de la Mujer y la Niña en la Ciencia”’. También dentro de las actividades para celebrar elDía Internacional de la Mujer y la Niña en la Ciencia,desde la Universidad de Granada y su Oficina de Software Libre convocamos un editatón, es decir, un encuentro de edición de la Wikipedia.Nos centraremos en una serie de páginas relacionadas con las mujeres y la ciencia en Granada y su Universidad, empezando por las listadas en el encuentro, pero abiertos a sugerencias siempre que tengan la misma temática. Al comienzo del taller se dará una serie de directivas sobre qué es la Wikipedia y cómo editarla, y a continuación trabajaremos en grupo o individualmente. El encuentro tendrá lugar en un aula con ordenadores, pero te puedes traer el tuyo propio si lo deseas, daremos acceso a Internet por Wifi a quien lo solicite. Buscamos especialmente imágenes relacionadas con las entradas, pero también texto y datos. Si quieres conocer a las mujeres en la ciencia en Granada y aportar lo que tú conozcas.\n💬 ORGANIZA. Oficina de Software Libre de la Universidad de Granada\n🏢 LUGAR. Centro de Enseñanzas Virtuales de la Universidad de Granada. SalaDarro. Calle Real de Cartuja, 36-38.\n⏰ HORA.:00 – 19:00\n🎫REGISTRO.https://www.meetup.com/es-ES/Granada-Geek/events/237074139/\n\n                                      "], "listaEtiquetas": [], "listaCategorias": [" OSL "]}{"autor": ["German Martinez"], "titulo": ["Programas de actividades para el siguiente semestre"], "contenido": ["\r\n              Si estáis apuntados a nuestro Meetup, Granada Geek, seguramente habréis visto que en estos últimos días os habrán llegado un montón de correos con próximas actividades. Esto se debe a que además de los eventos individuales que realizamos (talleres, charlas, cursos…) vamos a participar en una serie de programas que cuenta con varias actividades:\n\nPatrimonio abierto: elVicerrectorado de Extensión Universitaria a través del Secretariado de Bienes Culturales en colaboración con la Oficina de Software Libre de la Universidad de Granadaorganiza este programa con la idea es acercar elpatrimonio cultural de la UGRa la comunidad universitaria y a los estudiantes, pero también acercar a la misma comunidad al concepto de cultura libre y dominio público.\n\n#UnidosxElPatrimoni­o\nViernes 17 de febrero de 2017. 12:00 – 13:00.\nhttps://www.meetup.com/es-ES/Granada-Geek/events/237494616/\nPatrimonio Abierto, actividades de apertura y liberación de datos relacionadas con el Patrimonio de la UGR (dentro del Open Data Day 2017)\nSábado 4 de marzo de 2017. 11:00 – 13:00.\nhttps://www.meetup.com/es-ES/Granada-Geek/events/236840299/\nMujeres Creadoras: Homenaje a Carmen Jiménez\nMiércoles 8 de marzo de 2017. 18:00 – 20:00.\nhttps://www.meetup.com/es-ES/Granada-Geek/events/237494801/\nIntroducción a las aplicaciones OpenSource y repositorios abiertos del Patrimonio con motivo del Día Documento Libre\nJueves 30 de marzo de 2017. 12:30 – 14:30.\nhttps://www.meetup.com/es-ES/Granada-Geek/events/237494919/\nEditatón patrimonio europeo con motivo del Día Internacional de Monumentos y Sitios\nMartes 18 de abril de 2017. 18:00 – 20:00.\nhttps://www.meetup.com/es-ES/Granada-Geek/events/237494976/\nEditatón patrimonio europeo con motivo del Día Cultura Libre + European Art History Challenge\nViernes 19 de mayo de 2017. 11:00 – 14:00.\nhttps://www.meetup.com/es-ES/Granada-Geek/events/237495038/\nVisita a la Facultad de Medicina + Editatón Facultad de Medicina\nViernes 9 de junio de 2017. 10:00 – 13:30.\nhttps://www.meetup.com/es-ES/Granada-Geek/events/237495149/\nVisita a la Facultad de Medicina + Editatón Facultad de Medicina\nViernes 23 de junio de 2017. 17:00 – 20:30.\nhttps://www.meetup.com/es-ES/Granada-Geek/events/237495244/\n\n\n\n\nPrograma ETSIIT de capacitación profesional: con el fin de complementar la formación obtenida en las titulaciones de la ETSIIT, se oferta a los alumnos la posibilidad de participar en este programa para adquirir nuevos conocimientos. La Oficina de Software Libre de la Universidad de Granada participa en este programa mediante la impartición de una serie de charlas técnicas de diferentes temáticas. Aunque el programa estará orientado a estudiantes de últimos años de las titulaciones disponibles en la propia ETSIIT, nuestras charlas están abiertas a cualquier público asistente hasta completar aforo.\n\nIntroducción al lenguaje de programación Python\nMartes 14 de Febrero. 12:30 – 13:30.\nhttps://www.meetup.com/es-ES/Granada-Geek/events/237476688/\nIntroducción a las bases de datos NoSQL con MongoDB\nMiércoles 1 de Marzo. 12:30 – 13:30.\nhttps://www.meetup.com/es-ES/Granada-Geek/events/237479163/\nIntroducción al ‘Cloud Computing’\nMartes 7 de Marzo. 12:30 – 13:30.\nhttps://www.meetup.com/es-ES/Granada-Geek/events/237481323/\nPlataforma como servicio, publicando tus aplicaciones en la web\nMartes 14 de Marzo. 12:30 – 13:30.\nhttps://www.meetup.com/es-ES/Granada-Geek/events/237483362/\nIntroducción al uso de expresiones regulares\nMartes 21 de Marzo. 12:30 – 13:30.\nhttps://www.meetup.com/es-ES/Granada-Geek/events/237493138/\nIntroducción al Big Data con el lenguaje R\nMartes 4 de Abril. 12:30 – 13:30.\nhttps://www.meetup.com/es-ES/Granada-Geek/events/237493544/\nProgramación concurrente en Go\nMartes 2 de Mayo. 12:30 – 13:30.\nhttps://www.meetup.com/es-ES/Granada-Geek/events/237494221/\nGestión de proyectos de programación con Git\nMartes 9 de Mayo. 12:30 – 13:30.\nhttps://www.meetup.com/es-ES/Granada-Geek/events/237494381/\n\n\n\n\nBásicos de la OSL: una serie de talleres breves que ya empezamos a organizar hace unos meses desde laOficina de Software Libre de la Universidad de Granada con el objetivo de que los asistentes hayan aprendido conceptos básicos que puedan poner en práctica fácilmente desde el mismo momento que termine el taller.\n\nIntérprete de comandos Bash desde 0\nJueves 16 de febrero de 2017. 13:30 – 14:00.\nhttps://www.meetup.com/es-ES/Granada-Geek/events/237472631/\nControl de Versiones con Git desde 0\nJueves 2 de marzo de 2017. 13:30 – 14:00.\nhttps://www.meetup.com/es-ES/Granada-Geek/events/237473200/\nCreando páginas web con HTML desde 0\nJueves 16 de marzo de 2017. 13:30 – 14:00.\nhttps://www.meetup.com/es-ES/Granada-Geek/events/236041736/\nProgramando con Python desde 0\nJueves 6 de abril de 2017. 13:30 – 14:00.\nhttps://www.meetup.com/es-ES/Granada-Geek/events/237475933/\nAnálisis estadísticos con R desde 0\nJueves 20 de abril de 2017. 13:30 – 14:00.\nhttps://www.meetup.com/es-ES/Granada-Geek/events/237476351/\n\n\n\n¡No dudéis en apuntaros a cualquiera que veáis interesante!\n                                      "], "listaEtiquetas": [], "listaCategorias": [" OSL "]}{"autor": ["German Martinez"], "titulo": ["Agenda actividades 16 al 22 de enero de 2017"], "contenido": ["\r\n              Ya una vez con el año bien empezado, vamos a seguir con másactividades para seguir aprendiendo libremente.\n✴️ MIÉRCOLES 18 ➡️ ‘Talleres de Software Libre Multimedia: FreeCAD’. FreeCAD es un modelador 3D paramétrico que nos permite realizar diseño asistido por ordenador con el que representar objetos de la vida real de cualquier tamaño, siendo cada elemento del dibujo un objeto en si mismo. Es una aplicación libre altamente personalizable, gracias a una arquitectura de software modular, permitiendo añadir de forma sencilla funcionalidades mediante scripts en Python sin tener que cambiar el núcleo del sistema. El resultado final es que tenemos una aplicación que se puede usar en multitud de ámbitos desde aficionados hasta profesionales, tanto personas sin conocimientos previos como usuarios experimentados.\n💬 ORGANIZA. Oficina de Software Libre de la Universidad de Granada / Facultad de Bellas Artes de la Universidad de Granada\n🏢 LUGAR. Facultad de Bellas Artes Alonso Cano. Aula T3. Calle Periodista Eugenio Selles, s/n.\n⏰ HORA. 18:00 – 21:00\n🎫 REGISTRO. https://www.meetup.com/es-ES/Granada-Geek/events/236840824/\n\n✴️ VIERNES 20➡️ ‘Programa “Patrimonio Abierto”: Editatón de la Wikipedia, tema “Hospital Real”’. Continúa el programa “Patrimonio Abierto” que hacen conjuntamente el Vicerrectorado de Extensión Universitaria a través del Secretariado de Bienes Culturales y del Secretariado de Conservación y Restauración por medio de Patrimonio UGR en colaboración con la Oficina de Software Libre de la Universidad de Granada. La idea es acercar el patrimonio cultural de la UGR a la comunidad universitaria y a los estudiantes, pero también acercar a la misma comunidad al concepto de cultura libre y dominio público. En esta primera actividad se hará una visita guiada al Hospital Real, sede central de la Universidad de Granada, donde se podrán hacer fotos y tomar notas para, a continuación, pasar a un aula en el Centro de Enseñanzas Virtuales donde se impartirá un taller sobre la Wikipedia y la cultura libre, conociendo la forma de la que cualquier pueda colaborar fácilmente y pudiendo además subir las fotos realizadas para más adelante trabajar sobre entradas de la Wikipedia relacionadas con el Hospital Real y la Universidad de Granada como las enlazadas un poco más arriba.\n💬 ORGANIZA. Oficina de Software Libre de la Universidad de Granada / Vicerrectorado de Extensión Universitaria de la Universidad de Granada\n🏢 LUGAR. Hospital Real (Puerta principal). Avenida del Hospicio, s/n.\n⏰ HORA. 16:00 – 19:30\n🎫 REGISTRO. https://www.meetup.com/es-ES/Granada-Geek/events/236240867/\n\n✴️ VIERNES 20➡️ ‘Geek &amp; Tech Girls: “No es sólo texto y enlaces, la web no tiene límites”’. Geek &amp; Tech Girls es una comunidad que a través del Software Libre acerca la tecnología a mujeres de todas las edades, a la vez que lucha por una sociedad igualitaria e inclusiva. Esta ocasión han organizado una charla para hablar de desarrollo web, de la mano de Patricia Juarez, Senior Software Engineer en Badger Maps. Se hará una charla-debate sobre desarrollo web, su origen, tecnologías, tendencias y recursos; hablando también de varias mujeres que influenciaron desde los inicios de la web hasta la actualidad.\n💬 ORGANIZA. Geek &amp; Tech Girls\n🏢 LUGAR. Facultad de Ciencias. Aula B1 (Edificio Biología). Avenida Fuente Nueva, s/n.\n⏰ HORA. 19:00 – 20-30\n🎫 REGISTRO. https://www.meetup.com/es-ES/Granada-Geek/events/236787520/\n\n                                      "], "listaEtiquetas": [], "listaCategorias": [" OSL "]}{"autor": ["Pablo Hinojosa"], "titulo": ["Inscritos en el Certamen de Proyectos de Software Libre de la UGR"], "contenido": ["\r\n              Estos son los 24 equipos inscritos en el Certamen de Proyectos de Software Libre de la Universidad de Granada:\n\nSMS\nA web app to speed up processes in an educational centers with data analysis and pattern recognition thinked to be deployed in cloud with minimal costs.\nRepositorio del Proyecto\n\nTeletorrent\nTelegram bot that allows you to add and manage torrents on your computer, remotely.\nRepositorio del Proyecto\n\nfifator\nOrganizador de torneos personalizados de videojuegos de futbol.\nRepositorio del Proyecto\n\nQUEUEme\nAplicación web para la gestión de turnos. Un usuario puede registrarse y crear una cola. Otro usuario (no necesariamente registrado) puede unirse a la cola. El propietario de la cola podrá ir viendo los usuarios inscritos e ir atendiéndolos llegado el momento. El propietario podrá realizar diferentes funciones sobre la cola.\nRepositorio del Proyecto\n\nBot de Telegram para la ayuda con dietas alimenticias.\nTendrá como objetivo ayudar con el seguimiento de dietas a través del acceso fácil al menú tanto diario como semanal, pudiendo añadir dietas personales.\nRepositorio del Proyecto\n\ndlvisR\nHerramienta para visualizaciones de técnicas de Deep Learning no supervisado\nRepositorio del Proyecto\n\nDiedricoApp\n“Durante el curso de Bachillerato tuve un profesor de dibujo técnico que se negó a enseñar Diédrico (parte de dibujo técnico que entra en PAU) con lo que me vi obligado a crear alguna herramienta para enseñar diédrico a mi clase, ¡Si no enseña el profesor enseño yo! Vi una oportunidad perfecta para crear una herramienta capaz de mejorar la vista espacial de la gente que no era capaz de ver la geometría descriptiva, y así es como nació DiedricoApp.\nDiedricoApp se trata de una aplicación para dispositivos móviles que enseña de una forma interactiva como funciona la geometría descriptiva. Lo que vemos en el libro pasa a ser 3D donde el alumno puede tocar, mover, experimentar, etc. Además tiene la opción de echar una foto a una lámina de diédrico y pasarla a tres dimensiones, así ayuda a la gente que no es capaz de ver una lámina más a allá de un plano.\nPor supuesto, uno de los pilares del proyecto es que se 100% software libre, ya que si el objetivo es aprender, que mejor forma que liberar el código para que surjan nuevos proyectos basados en este para conseguir el mismo objetivo. -La unión hace la fuerza.\nPD: Este proyecto empezó a desarrollarse a finales de mi curso de bachillerato, más info en el github, pero a día de hoy (octubre de 2016) no está terminada y me gustaría terminarla durante este curso académico para que los presentes alumnos de bachiller puedan disfrutar de esta herramienta.”\nRepositorio del Proyecto\n\nGuía de la Tapa\nAplicación web que permite a los usuarios encontrar bares a visitar, localizarlos y consultar las tapas que hay disponibles, también se permitirá a los usuarios votar sobre las tapas y bares, registrarse y probablemente hacer reservas.\nRepositorio del Proyecto\n\ntorrent_music_player\nreproductor de musica de archivos torrents\nRepositorio del Proyecto\n\nContentTaskMS\nProyecto de prácticas para la asignatura Cloud Computing de primer curso del master profesional en ingeniería informática de la UGR. Tratará sobre una aplicación web, para la gestión de un magazine web o webzine basado en algún sistema de gestión de contenidos colaborativo.\nRepositorio del Proyecto\n\nsmall disjuncts\nImplementación de un paquete en R para clasificación desbalanceada\nRepositorio del Proyecto\n\nTripBot\nBot de Telegram para la gestión y consulta de excursiones y rutas.\nRepositorio del Proyecto\n\nAPRIL\nUna aventura de texto con puzles lógicos en c++\nRepositorio del Proyecto\n\nCleLex\nScript para corregir fallos de estilo en c/c++\nRepositorio del Proyecto\n\nThe Spyder Girl\nHerramienta para analizar las interacciones que recibimos en nuestras redes sociales y poder determinar el perfil medio que interactúa con nosotros. El objetivo es saber si estamos llegando al público objetivo que queríamos inicialmente como asociación en Geek and Tech Girls o no.\nRepositorio del Proyecto\n\nEmojidō\nSistema para la creación y difusión de textos compuestos exclusivamente por emojis\nRepositorio del Proyecto\n\nBots Without Telegram\nCrearemos una aplicación en Java orientada al modelo cliente/servidor que nos permitirá disfrutar de algunos bots de Telegram sin la necesidad de tener Telegram instalado en nuestro dispositivo.\nRepositorio del Proyecto\n\nPEÑAS DEPORTIVAS BOT\nEste bot será para llevar las estadísticas de una peña deportiva. Se podrán añadir jugadores, tras estar dentro de la peña una serie de jugadores, se podrán sortear equipos seleccionándolos mediante una conversación y tras finalizar el partido se podrán añadir estadísticas del mismo, como el resultado, o incluir la cantidad de goles que ha marcado cada jugador. Tras introducir el resultado se repartirán los puntos para cada jugador en función del resultado. También se podrán consultar clasificación por puntos o clasificación por goles.\nRepositorio del Proyecto\n\nPiano Educativo\nPiano creado mediante arduino, con el que se pretende acercar a los más pequeños al mundo de la eléctronica.\nRepositorio del Proyecto\n\nApuntes DGIIM\nApuntes colaborativos del Doble Grado en Informática y Matemáticas.\nRepositorio del Proyecto\n\npradobot\nBot de Telegram para la gestión académica en diferentes plataformas, principalmente moodle.\nRepositorio del Proyecto\n\nOpen Community\nPlataforma para la administración de grupos\nRepositorio del Proyecto\n                                      "], "listaEtiquetas": [], "listaCategorias": [" Certamen UGR de proyectos Libres ", " Concursos "]}{"autor": ["nuria"], "titulo": ["Aprende a utilizar la Pizarra Digital"], "contenido": ["\r\n              El próximo mes de enero comenzará el curso “AULA 2.0: HERRAMIENTAS TIC PARA LA DOCENCIA” que estará dedicado a aprender a utilizar la pizarra digital.\nEste curso se enmarca dentro del Plan FIDOen su VII CONVOCATORIA PARA LA REALIZACIÓN DE ACTIVIDADES DE FORMACIÓN DOCENTE EN CENTROS, TITULACIONES Y DEPARTAMENTOS, y está convocado y financiado por la Unidad de Calidad, Innovación y Prospectiva.La formación del plan FIDO va dirigida a todo el profesorado de la UGR, becarios/as e investigadores/as y a colaboradores externos con responsabilidad docente en esta Universidad.\nEsta acción formativa surge como respuesta a la necesidad de incorporar en ladocencia universitaria el uso de las nuevas herramientas tecnológicas disponibles en laactualidad, con el fin de mejorar y facilitar la transmisión de conocimientos y mejorar ypotenciar las capacidades del profesorado; contestando a una peticiónexpresada en diferentes forosy reuniones de profesores de distintoscentros,quienes manifiestan un grandesconocimiento del funcionamiento de las mismas.\nUso de pizarra electrónica\nEl objetivo de esta acción formativa es que los docentes aprendan a utilizar de formaeficiente las nuevas herramientas TIC disponibles en el aula, de forma que se favorezca la labordocente.\nLa metodología de enseñanza se basa en una breve exposición teórica básica de los elementos delos recursos TIC y la puesta en práctica de actividades que favorezcan el manejo de los mismos. Esta puesta en práctica se realizará através del desarrollo de proyectos que hagan uso de las herramientas TIC disponibles en elaula, principalmente la pizarra electrónica interactiva.\n\nNúmero de horas: 30 (18 horas presenciales / 12 no presenciales)\nHorario:\n◦ lunes 23 de enero de 9:30 a 11:30\n◦ miércoles 25 de enero de 9:30 a 11:30\n◦viernes 27 de enero de 9:30 a 11:30\n◦lunes 30 de enero de 9:30 a 11:30\n◦miércoles 1 de febrero de 9:30 a 11:30\n◦viernes 3 de febrero de 9:30 a 11:30\n◦lunes 6 de febrero de 9:30 a 11:30\n◦miércoles 8 de febrero de 9:30 a 11:30\n◦viernes 10 de febrero de 9:30 a 11:30\nLugar de celebración: Facultad de Ciencias de la Educaciónde la Universidad de Granada\nEvaluación:se requiere asistencia a las sesiones presenciales (obligatorio asistir al 80% de las sesiones presenciales). Se evaluará la realización de un proyecto con los recursos TIC aprendidos o diseño de un recurso.\nInscripciones: rellenando el formulariohttps://goo.gl/forms/UiS0NsJJhk4grq9y1\nNúmero de plazas:un máximo de 30 plazas. En caso de que las solicitudes superen el número de plazas, éstas se adjudicarán por riguroso orden de llegada. La lista de admitidos se enviará por correo a los interesados antes del comienzo del curso.\n\nContacto:Nuria Rico Castro, Subdirectora de la Oficina de Software Libre de la Universidad de Granada.\n\n                                      "], "listaEtiquetas": [], "listaCategorias": [" OSL "]}{"autor": ["Alejandro Alcalde"], "titulo": ["Cómo configurar la VPN SSL desde Linux para la UGR"], "contenido": ["\r\n              Tras muchos años usando la VPN de la UGR mediante PPTP, al terminar de instalar Gentoo decidí probar la VPN mediante SSL, ya que es más cómoda de usar (Principalmente porque no hay que estar cambiando la contraseña cada vez que queremos conectarnos, VPN SSL funciona con nuestro usuario y contraseña de la UGR).\nEn la página de configuración para VPN SSL, se dan distintos métodos de instalación:\n\nAutomática: En mi caso no funcinó.\nManual: Instalando un programa llamado  Cisco AnyConnect.\n\nCon el segundo método conseguí hacer funcionar la VPN, pero sinceramente fue un latazo. Con el tiempo descubrí que hay un paquete llamado OpenConnect, la versión libre de Anyconnect, así que busqué en los repositorios de Gentoo a ver si estaba y lo instalé. Además instalé el plugin de OpenConnect para NetworkManager. De esta forma, configurar la VPN puede hacerse directamente desde NetworkManager.\nPaquetes a instalar\nEn Gentoo, los paquetes necesarios son:\n\nnet-misc/networkmanager-openconnect\nnet-misc/openconnect\n\nDesconozco el nombre de los paquete para otras distribuciones, pero deben llamarse de forma similar.\nConfiguración de OpenConnect para la VPN de la UGR\nTras instalar los paquetes, en NetworkManager, nos dirigimos a VPN Connections » Configure VPN y luego seleccionamos configurar una VPN con OpenConnect, como se muestra en la imagen:\n\n  \n\nTras esto, rellenamos la configuración como se muestra en la imagen:\n\n  \n\nListo, guardamos, y ahora en las conexiones VPN nos debe aparecer la que acabamos de crear, si la pulsamos nos aparecerá una ventana pidiendonos autenticación. Debemos introducir nuestro correo de la UGR y nuestra contraseña, tras esto, deberíamos estar conectados a la VPN de la UGR.\nPosibles problemas\nTuve un problema algo molesto cuando me conectaba a cualquier red WIFI o VPN durante un tiempo. Al conectarme y tratar de ejecutar cualquier aplicación gráfica, recibía el siguiente error:\n\r\nCan't Open Display: :0.0\r\n\nEste error se debe a que NetworManager cambia automáticamente el hostname de la máquina por alguna razón las aplicaciones gráficas no pueden autentificarse. Tras investigar un poco, descubrí cómo arreglarlo. Si tienes este problema échale un vistazo al artículo Cómo Resolver El Error “Can’t Open Display: :0.0” Al Conectarse a Una Red Wi-Fi.\nConclusión\nEspero que este artículo haya servido de ayuda y ahora puedas conectarte a la red de la UGR desde casa. Muy útil para visitrar libros electrónicos de la biblioteca, o descargar/leer papers y revistas de investigación, a los que solo se tiene acceso desde la IP de la universidad.\n                                      "], "listaEtiquetas": [], "listaCategorias": [" OSL "]}{"autor": ["German Martinez"], "titulo": ["Agenda actividades 19 al 23 de diciembre de 2016"], "contenido": ["\r\n              Llega la última semana antes de las vacaciones de Navidad, por eso esta semana será algo más relajada en cuanto al número de actividades, peroeso no quiere decir que no tengamos un par de actividades que seguramente os resultarán de interés.\n✴️MIÉRCOLES 21➡️ ‘Talleres de Software Libre Multimedia: Impresión 3D (nivel operador)’. Durante los últimos años hemos podido ver como las impresoras 3D se han popularizado debido a una gran bajada de precio, o incluso mejor, existiendo la posibilidad de montarnos nuestra propia impresora 3D a base de ensamblar componentes electrónicos y mecánicos con piezas impresas en cualquier otra impresora 3D. Todo esto ha favorecido la aparición de una gran comunidad que ha crecido enormemente rodeada de hardware libre y espíritu maker con la idea principal del DIY (Do It Yourself, Hazlo tú mismo); además, compartiendo con esa misma comunidad los conocimientos que adquiridos y los proyectos desarrollados. Desde hace un tiempo en la OSL disponemos de una impresora 3D modelo Prusa i3 y es por eso que tenemos experiencia el uso a nivel operador (montaje, calibración, distintos tipos de impresión, etc). Precisamente de eso tratará el taller impartido por Manuel Cogolludo, Técnico Informático de la Oficina de Software Libre de la UGR.\n💬 ORGANIZA. Oficina de Software Libre de la Universidad de Granada /Facultad de Bellas Artesde la Universidad de Granada\n🏢 LUGAR.Facultad de Bellas Artes Alonso Cano. Aula T3. Calle Periodista Eugenio Selles, s/n.\n⏰ HORA. 18:00-21:00\n🎫 REGISTRO.https://www.meetup.com/es-ES/Granada-Geek/events/236278009/\n\n✴️JUEVES 22➡️ ‘Granada Ágil’. Granada Ágil es una jornada dedicada a aprender y poner en práctica metodologías de desarrollo ágil, que contará con la participación de Fran Ávila (LinkedIn) y Pablo Arroyo (LinkedIn), antiguos alumnos de la ETSIIT y profesores y alumnos de la Universidad de Granada. Estará dedicada a aprender sobre estas tecnologías a través de personas que la han usado en diferentes empresas y a ponerlas en práctica en un proyecto real. El proyecto sobre el que se trabajará, así como la temática concreta y los participantes en la mesa redonda se irán concretando. Inscríbete en la jornada para estar al día y recibirás notificación de todas las actualizaciones.\n💬 ORGANIZA. Oficina de Software Libre de la Universidad de Granada\n🏢 LUGAR.Escuela Técnica Superior de Ingenierías Informática y de Telecomunicación. Calle Periodista Daniel Saucedo Aranda, s/n.\n⏰ HORA. 09:30-19:00\n🎫 REGISTRO.https://www.meetup.com/es-ES/Granada-Geek/events/235054689/\n\n                                      "], "listaEtiquetas": [], "listaCategorias": [" OSL "]}{"autor": ["German Martinez"], "titulo": ["Agenda actividades 9 al 15 de enero de 2017"], "contenido": ["\r\n              Este año ya está a punto de terminar, sin embargo ya queremos empezar el próximo con más fuerza todavía y por eso ya tenemos un par de actividades preparadas para la semana a la vuelta de Navidad.\n✴️MIÉRCOLES 11➡️ ‘Talleres de Software Libre Multimedia: Cura’. Cura es un programa de código abierto desarrollado por Ultimaker que permite transformar modelos 3D en formatos compatibles con la mayoría de impresoras 3D, permitiendo generar un objeto físico a partir de su modelo generado por ordenador. Gracias a esto tendremos las herramientas necesarias para crear nuestros propios modelos que bien sea para una necesidad personal específica o para algo más general nunca está de más liberar para que cualquier persona pueda reutilizar si se encuentra ante un necesidad similar; continuando con un enfoque hardware libre y espíritu maker a través de la idea principal del DIY (Do It Yourself, Hazlo tú mismo) que puede ser aplicado a multitud de campos como arquitectura, arte, educación, ingeniería, moda, medicina… El taller impartido por Manuel Cogolludo, Técnico Informático de la Oficina de Software Libre de la UGR.\n💬 ORGANIZA. Oficina de Software Libre de la Universidad de Granada /Facultad de Bellas Artesde la Universidad de Granada\n🏢 LUGAR.Facultad de Bellas Artes Alonso Cano. Aula T3. Calle Periodista Eugenio Selles, s/n.\n⏰ HORA. 18:00 – 21:00\n🎫 REGISTRO.https://www.meetup.com/es-ES/Granada-Geek/events/236373548/\n\n✴️VIERNES 13➡️ ‘Programa “Patrimonio Abierto”: Editatón de la Wikipedia, tema “Hospital Real”’. Con esta actividad, se lanza el programa “Patrimonio abierto” que hacen conjuntamente el Vicerrectorado de Extensión Universitaria a través del Secretariado de Bienes Culturalesy del Secretariado de Conservación y Restauraciónpor medio de Patrimonio UGR en colaboración con la Oficina de Software Libre de la Universidad de Granada. La idea es acercar el patrimonio cultural de la UGR a la comunidad universitaria y a los estudiantes, pero también acercar a la misma comunidad al concepto de cultura libre y dominio público.En esta primera actividad se hará una visita guiada al Hospital Real, sede central de la Universidad de Granada, donde se podrán hacer fotos y tomar notas para, a continuación, pasar a un aula en el Centro de Enseñanzas Virtuales donde se impartirá un taller sobre la Wikipedia y la cultura libre, conociendo la forma de la que cualquier pueda colaborar fácilmente y pudiendo además subir las fotos realizadas para más adelante trabajar sobre entradas de la Wikipedia relacionadas con el Hospital Real y la Universidad de Granada como las enlazadas un poco más arriba.\n💬 ORGANIZA. Oficina de Software Libre de la Universidad de Granada / Vicerrectorado de Extensión Universitariade la Universidad de Granada\n🏢 LUGAR. Hospital Real (delante la puerta principal). Avenida del Hospicio, s/n.\n⏰ HORA. 10:00 – 13:30\n🎫 REGISTRO.https://www.meetup.com/es-ES/Granada-Geek/events/236240687/\n\n✴️SÁBADO 14➡️ ‘Seminario LibreIM: Aprendizaje PAC y problemas de programación’.LibreIM es un grupo de alumnos de la titulación Doble Grado en Ingeniería Informática y Matemáticas en la UGR muy activos que tienen como objetivo crear una comunidad dedicada al estudio y divulgación de las matemáticas y la informática. En esta ocasión los temas a tratar serán por una lado “Introducción al aprendizaje PAC“ (Probably Approximately Correct learning – aprendizaje Correcto Probablemente Aproximado) que es el modelomatemático detrás aprendizaje automático; y por otro lado, problemas de programación de LeetCode, HackerRank o Project Euler,plataformas que plantean una serie de retos relacionados con la programación (y las matemáticas) que pueden ser muy útiles a la hora de prepararse para las entrevistas técnicas que es necesario realizar para la mayoría de trabajos relacionados con el campo de la informática.\n💬 ORGANIZA.LibreIM\n🏢 LUGAR. Facultad de Ciencias. Aula A11 (Edificio Aulario A). Avenida Fuente Nueva, s/n.\n⏰ HORA. 10:00-13:00\n🎫 REGISTRO.https://www.meetup.com/es-ES/Granada-Geek/events/236619780/\n\n\n✴️SÁBADO 14➡️ ‘Reunión Interferencias ENERO 2017’. Interferencias es un grupo ciberactivista sin ánimo de lucro abierto a todo el mundo que tiene como objetivo concienciar a la comunidad sobre la importancia de la privacidad, los derechos digitales y la seguridad informática, y que, ya después de Navidad vuelven a reunirse para hablar de los proyectos del 2017 y seguir discutiendo sobre los temas de interés del grupo,pero esta vez ya con la intención de ir concretando mejor las ideas que surgieron en la última reunión para ir plasmándolas en proyectos. En este enlacepodéis encontrar el resumen de su última reunión en la que además de debatir sobre temas de actualidad como el usode 2FA (Two Factor Authentication) en Twitter, la perspectiva de Trump en su mandato sobre la tecnología (y su privacidad) o cómo afecta la Custom and Border Protection a la tecnología; se quiso dar prioridad a la realización de charlas y talleres pronto sobreEttercap, Bitcoins, NFC y duplicación, seguridad informática, TOR y alternativas a los recursos de Google.\n💬 ORGANIZA. Interferencias\n🏢 LUGAR.Continental Café Pub Granada.Calle Seminario, 11.\n⏰ HORA. 20:00-22:00\n🎫 REGISTRO.https://www.meetup.com/es-ES/Granada-Geek/events/236693487/\n\n                                      "], "listaEtiquetas": [], "listaCategorias": [" OSL "]}{"autor": ["German Martinez"], "titulo": ["Agenda actividades 10 de diciembre al 17 de diciembre de 2016"], "contenido": ["\r\n              Debido a las festividades del Día de la Constitución y del Día de la Inmaculada Concepción la actividad normal de esta semana se ha visto alterado, es por eso que adelantamos la publicación del calendario de actividades para que tengáis más tiempo para planificar vuestro horario fácilmente y asistir a todas las que consideréis interesantes.\n✴️SÁBADO 10➡️ ‘Seminario de LibreIM: Latex en Telegram; Haskell y mónadas’.LibreIM es un grupo de alumnos de la titulación Doble Grado en Ingeniería Informática y Matemáticas en la UGR muy activos que tienen como objetivo crear una comunidad dedicada al estudio y divulgación de las matemáticas y la informática. Regularmente imparten seminarios con contenido que pueda ser especialmente útil para estudiantes de esta misma doble titulación, aunque también son abiertos a cualquier asistente que considere interesante el tema en cuestión que se trate. En esta ocasión los temas a tratar serán por una lado cómo usar el sistema de composición de textos LaTeX en el servicio de mensajes por Internet Telegram (cuyos clientes son código abierto), y por otro lado, ejemplos y aplicación matemática del lenguaje de programación funcional Haskell,donde en como todos los lenguajes funcional el paradigma de programación está basado en el uso de funciones matemáticas.\n💬 ORGANIZA.LibreIM\n🏢 LUGAR. Facultad de Ciencias. Aula F01 (Edificio Física). Avenida Fuente Nueva, s/n.\n⏰ HORA. 10:00-13:00\n🎫 REGISTRO.https://www.meetup.com/es-ES/Granada-Geek/events/236068524/\n\n\n✴️MARTES 13➡️ ‘Hackatón de reciclaje de hardware’.En la Oficina de Software Libre nos venimos encargando de retirar material informático de las diferentes dependencias de la Universidad de Granada para adecuarlos y preparar los equipos para su donación a diferentes ONGs y asociaciones. Este material recogido hay ocasiones en las que crece de forma desmesurada, por eso al menos una vez al año organizamos un hackatón de reciclaje; este hackatón consiste en que cualquier persona con ganas de “cacharrear” pueda por un día aventurarse a manipular sin miedo el hardware de un ordenador y aprender cómo funciona por dentro. Existetambién la posibilidad de llevarse como recuerdo componentes que por estar estropeados u obsoletos no se pueda hacer uso de ellos en el reciclaje y, además, también tendremos nuestro #TronoDeSilicio que sigue buscando a su legítimo dueño y en el que cualquiera puede sentarse para echarse una foto para rememorar este día.\n💬 ORGANIZA. Oficina de Software Libre de la Universidad de Granada\n🏢 LUGAR. Oficina de Software Libre de la Universidad de Granada. (Edificio CEVUG). C/ Real de Cartuja, 36-38.\n⏰ HORA. A partir de las 09:30\n🎫 REGISTRO.https://www.meetup.com/es-ES/Granada-Geek/events/235730151/\n\n\n\n✴️MIÉRCOLES 14➡️ ‘Primera reunión de “La Iglesia de Emacs” #granada’.Cada vez hay más gente que usa Emacs, el editor de texto (entre otras muchas cosas) sin el que muchos programadores no podrían vivir. Debido a la popularidad que ha ido adquiriendo este software y para presentarlo en un entorno más amigable, Richard Stallman (fundador de la Free Software Foundation, organización quepromueveel software libre a nivel internacional) creó la “Iglesia de Emacs”, una parodia sobre una religión para los usuarios de Emacs. La idea de estas reuniones es crear una comunidad que se reuna regularmente para hablar sobre los temas de interés y novedades relacionadas, pudiendo además ayudar a las personas que quieren empezar a usarlo, pero no se atrevan a hacerlo sin ayuda.\n💬 ORGANIZA.Oficina de Software Libre de la Universidad de Granada\n🏢 LUGAR.Escuela Técnica Superior de Ingenierías Informática y de Telecomunicación. Aula Usos Múltiples. Calle Periodista Daniel Saucedo Aranda, s/n.\n⏰ HORA. 11:30-12:30\n🎫 REGISTRO.https://www.meetup.com/es-ES/Granada-Geek/events/235926170/\n\n\n✴️MIÉRCOLES 14➡️ ‘Taller de anonimato’.Interferencias es un grupo de gente que busca reunir personas interesadas en privacidad, seguridad, vigilancia masiva y derechos en Internet para inicialmenteorganizar actividades divulgativas sobre las mismas. Para esto se ha organizado untaller para dar a conocer a cualquier persona interesada, informático o no, el uso de herramientas que se pueden usar para navegar por Internet de forma anónima y segura.En el taller veremos cómo funciona Tor (el sistema que nos permite usar Internet de forma anónima) y cómo montar una Onion Pi (punto de acceso seguro con Tor y Raspberry Pi); aprenderemos a instalar y usar Tails, la distribución GNU/Linux basada en Debian y que usa Tor para navegar de manera anónima que funciona sin instalación, lo que hace que sea el sistema operativo usado por Edward Snowden; y conocer en qué consiste GPG, la herramienta de cifrado y firmas digitales basada en software libre que sirve para cifrar mensajes de forma que puedan ser enviados de forma segura. Además de todo esto se discutirán algunos conceptos básicos de privacidad y derechos digitales.\n💬 ORGANIZA.Interferencias/Oficina de Software Libre de la Universidad de Granada\n🏢 LUGAR.Escuela Técnica Superior de Ingenierías Informática y de Telecomunicación. Aula Usos Múltiples. Calle Periodista Daniel Saucedo Aranda, s/n.\n⏰ HORA. 12:30-14:00\n🎫 REGISTRO. https://www.meetup.com/es-ES/Granada-Geek/events/235551773/\n\n\n✴️MIÉRCOLES 14➡️ ‘Talleres de Software Libre Multimedia: Processing’.Continúan los talleres de software multimedia orientados a presentar a estudiantes interesados diferentes herramientas libres orientadas principalmente al ámbito multimedia, dibujo, imagen y sonido. Esta semana corresponde a Processing, un lenguaje de programación y entorno de desarrollo integrado de código abierto basado en Java; como está orientado a diseñadores no es necesario tener conocimiento previos de programación para poder usarlo, por eso mismo es muy usado como medio para la enseñanza y producción de proyectos multimedia e interactivos de diseño digital usando simplemente software libre.El taller será impartido por unTécnico Informático de la Oficina de Software Libre de la UGR.\n💬 ORGANIZA. Oficina de Software Libre de la Universidad de Granada /Facultad de Bellas Artesde la Universidad de Granada\n🏢 LUGAR.Facultad de Bellas Artes Alonso Cano. Aula T3. Calle Periodista Eugenio Selles, s/n.\n⏰ HORA. 18:00-21:00\n🎫 REGISTRO.https://www.meetup.com/es-ES/Granada-Geek/events/236090247/\n\n\n✴️JUEVES 15➡️ ‘Aprende a crear webs seguras con Statik’.Continuando con el ciclo de talleres rápidos que se dan todos los jueves en la ETSIIT, esta semana se enseñará a crear una webs seguras con Statik, un generador de páginas web estáticas que aunque no es tan conocido como otros, tiene la ventaja de que no está orientado principalmente a crear un blog pasa con Jekyll, por ejemplo, (que a su vez es uno de los más usados). El problema de estos otros generadores es que están pensados para hacer pequeñas páginas personales con una estructura ya definida de artículos, páginas, etiquetas y categorías; pero una vez que se quiere salir de esa estructura, el asunto en cuestión se puede volver bastante complicado. Aquí es donde destaca Statik, permitiéndonos crear un división de contenido mucho más personalizable. El taller será impartido porAlejandro Núñez, estudiante deGrado en Ingeniería Informática en la UGR que además forma parte del grupo Interferencias.\n💬 ORGANIZA.Interferencias/Oficina de Software Libre de la Universidad de Granada\n🏢 LUGAR.Escuela Técnica Superior de Ingenierías Informática y de Telecomunicación. Aula -1.2 (Aula Polivalente). Calle Periodista Daniel Saucedo Aranda, s/n.\n⏰ HORA. 12:30-14:00\n🎫 REGISTRO.https://www.meetup.com/es-ES/Granada-Geek/events/235927881/\n\n✴️SÁBADO 17➡️ ‘Geek &amp; Tech Girls: “Guerreras del Teclado: las mujeres en el hacking y la seguridad informática’”. Geek &amp; Tech Girls es una comunidad que a través del Software Libre acerca la tecnología a mujeres de todas las edades, a la vez que lucha por una sociedad igualitaria e inclusiva; para ello han organizado ya diversas charlas que se enfocan en exponer el papel actual de la mujer en diferentes aspectos como son la programación, los vídeojuegos u otros campos relacionados con la tecnología en general. En esta ocasión, Paula de la Hoz, estudiante deGrado en Ingeniería Informática en la UGR, se encarga de conducir una charla-debate sobre seguridad, hacking y el papel de la mujer a lo largo de la historia en este tema.\n💬 ORGANIZA.Geek &amp; Tech Girls\n🏢 LUGAR.Facultad de Ciencias. Sala de Audiovisuales. Avenida Fuente Nueva, s/n.\n⏰ HORA. Mañana. Hora fija por determinar.\n🎫 REGISTRO.https://www.meetup.com/es-ES/Granada-Geek/events/236088167/\n\n✴️SÁBADO 17➡️ ‘Reunión Interferencias’. Otro mes más Interferencias se reúne para seguir debatiendo sobre la actualidad de la privacidad y los derechos en Internet. Después de haber dado charlas, hecho talleres y grabado vídeos siguenbuscando nuevas formas de hacer ruido y organizar proyectos que ayudena la gente a reflexionar de lo importante que es la seguridad en Internet. Una veztomadas las primeras iniciativas, lo siguiente que se debatirá es concretar unas bases e ideologías claras que sirvan como orientación básica para cumplir con el objetivo de concienciar y hacer cambiar de ideaa todo aquel que se encuentra en una postura pasiva frente a la seguridad pensando que no es “su problema”, ya que la seguridad y la privacidad sí son un problema, una responsabilidad y un derecho de todos; siendo bienvenidas las ideas u opiniones de cualquiera que quiera aportar cualquier cosa.\n💬 ORGANIZA. Interferencias\n🏢 LUGAR.Continental Café Pub Granada.Calle Seminario, 11.\n⏰ HORA. 20:00-22:00\n🎫 REGISTRO.https://www.meetup.com/es-ES/Granada-Geek/events/236092839/\n\n                                      "], "listaEtiquetas": [], "listaCategorias": [" OSL "]}{"autor": ["José Alonso"], "titulo": ["Premio Ingenio “Mejor Proyecto Asociativo” Campus Tecnológico UGR para Chicas"], "contenido": ["\r\n              ¿No te habías enterado?\nEl Colegio de Graduados e Ingenieros Técnicos de Telecomunicación, han considerado galardonar a la Universidad de Granada con el distintivo de ‘Mejor Proyecto Asociativo’ por el Campus Tecnológico UGR para Chicas.\nUn proyecto, que se coordina desde la Oficina de Software libre de la Universidad de Granada, en el que han participado diferentes unidades de la Universidad, como la Unidad de Igualdad del Vicerrectorado de Igualdad, Inclusión y Responsabilidad Social; la Escuela Técnica Superior de Ingenierías Informática y de Telecomunicación, y el Campus de Excelencia Internacional CEI Bio Tic, y que ha contado este año con su 3ª edición.\nMás información en el siguiente enlace:\nPremiosIngenio\n                                      "], "listaEtiquetas": [], "listaCategorias": [" OSL "]}{"autor": ["Alejandro García Montoro"], "titulo": ["Última llamada para el Certamen de proyectos libres de la UGR"], "contenido": ["\r\n              ¿Aún no sabes si apuntarte o no al Certamen de proyectos libres de la UGR? Proyectos libres, comunidad, experiencia para tu currículum y, sí, ¡también tenemos premios! SiEl 7 de diciembre termina la fase de inscripción de la edición 2016/2017, ¡así que date prisa e inscríbete! Aquí te recordamos todo lo que necesitas saber.\n¿Puedo participar?\nSi eres estudiante de secundaria, formación profesional, grado o máster (de cualquier universidad pública o privada europea, Marruecos o Cuba) y quieres contribuir al desarrollo del software libre, no lo dudes: inscríbete en este formulario de Google.\n¿Qué puedo presentar?\nCualquier proyecto software, hardware o de documentación que sea publicado con una licencia libre es bienvenido.\nEl jurado valorará el trabajo realizado según los siguientes criterios:\n\nValor Social: 2/10 (20%); se valora la utilidad del proyecto, objetivos que se pretenden y problemas que soluciona\nTecnologías usadas y calidad de desarrollo: 2,5/10 (25%); se valora la tecnología que se utiliza, la implementación, limpieza de código y reusabilidad-\nGrado de aceptación por parte de la comunidad de software libre: 1,5/10 (15%); se valora la participación en otros proyectos y los comentarios y aportaciones externos recibidos-\nGrado de finalización: 2/10 (20%); se valora el grado de finalización, disponer de una versión de prueba o final-\nAccesibilidad y usabilidad: 2/10 (20%); se valora la accesibilidad del proyecto, facilidad de uso y perspectiva de usuarios-\n\nVayamos a lo importante: ¿qué puedo ganar?\nSabemos que la pasión por el software libre no está reñida con la satisfacción de ganar algo de dinero por tu trabajo. Así que no te preocupes, que tenemos 1500€ en premios repartidos de la siguiente manera:\n\nPrimer premio: 650€\nSegundo premio: 500€\nTercer premio: 300€\n\n\n¿Y cuáles son los plazos?\n\nCierre del plazo de inscripción: 7 de diciembre de 2016.\nPrimer hackathon: del 10 al 13 de marzo de 2017.\nSegundo Hackathon: del 21 al 24 de abril de 2017.\nLímite de entrega del Informe Obligatorio de Proyecto: 19 mayo de 2017.\nComienzo de la evaluación por parte del jurado: 22 mayo de 2017.\nFinal del Certamen: 2 de junio de 2017.\n\n\n¿Dónde puedo conseguir más información?\nEn las bases está todo lo que necesitas. Si tienes alguna duda más, no dudes en contactar con nosotros por correo o haciéndonos una visita a la oficina. ¡Estaremos encantados de ayudarte!\n                                      "], "listaEtiquetas": [], "listaCategorias": [" Certamen UGR de proyectos Libres "]}{"autor": ["Pablo Hinojosa"], "titulo": ["Formación en Transparencia Y Open Data (crónica)"], "contenido": ["\r\n              El Open Data y la Transparencia son más que un par de conceptos que están de moda. Desde el compromiso que la Universidad de Granada tiene con la Transparencia y la asunción de los Datos Abiertos como herramienta, la Oficina de Software Libre no sólo impulsa y administra los portales de Open Data y Transparencia, sino que también acomete actividades dedicadas a la formación y promoción de estos conceptos.\n\nDurante estas dos últimas semanas esta oficina ha estado llevando a cabo la primera edición de un curso de formación en Transparencia y Open Data para el Personal de Administración y Servicios de la Universidad de Granada. Se han visto los aspectos técnicos y legales, pero también las cuestiones políticas, administrativas y filosóficas relacionadas.\nDe lunes a jueves, los alumnos han estado aprendiendo de las mismas personas que han construido y administran los portales de transparencia y datos abiertos de la UGR.\nEl programa del curso ha consistido en los siguientes temas:\n\n¿Qué son la transparencia y el gobierno abierto?.\nTransparencia, datos abiertos e inteligencia institucional.\n\n\nLa Ley de Transparencia en España.\nNormativa.\nDerechos y obligaciones.\nPrivacidad.\nTransparencia en otros países.\n\n\n¿Qué es Open Data?\nRequisitos técnicos y legales.\nNiveles Open data.\n\n\nTipos de datos.\nObtención de datos.\nBúsqueda y extracción de datos.\nHerramientas online para convertir formatos.\nCrawling y Scraping.\nScraping práctico básico.\n\n\nCKAN y los portales de datos.\nFuentes de datos, reutilización y licencias.\nDatasets, APIs.\nEjemplos de fuentes de datos.\n\n\nReutilización de datos, valor y oportunidades.\nSociedad y democracia.\nModelos de negocio.\n\n\nOpendata y Transparente: El sistema de transparencia y datos abiertos de la UGR.\nImplementación técnica.\nOrganización y gestión.\nCómo proveer datos.\nCómo solicitar datos.\n\n\nPráctica de uso de Datos Abiertos de la UGR.\nObtener los datos de CKAN.\nManipulación y procesado de datos.\nRepresentación gráfica.\n\nComo se puede ver, se trata de un programa ambicioso que pretende abarcar todos los aspectos de la transparencia y los datos abiertos, aunque, naturalmente, prestando especial atención a los sistemas de transparencia y open data de la Universidad de Granada.\nSe ha hablado de las leyes que impulsan o limitan la publicación de datos, de la necesidad política y democrática de la transparencia, de la utilidad social y comercial de los datos abiertos.\nLos alumnos también han participado en diversos ejercicios prácticos de obtención y gestión de datos, de uso de la plataforma CKAN y han conocido a fondo el funcionamiento de los portales de Transparencia y Datos Abiertos de la Universidad de Granada, tanto en sus aspectos técnicos como en el día a día de su organización y gestión.\nHa sido una buena e interesante experiencia que ha requerido que los profesores adapten continuamente los contenidos a los conocimientos e intereses de los alumnos, que han sido muy participativos. Seguimos mejorando y esperamos que se repita en futuras ediciones.\nEl material que se ha utilizado para el curso puede descargarse de los siguientes enlaces:\n\nPresentación del curso “FORMACIÓN EN OPEN DATA”\nTransparencia y Corrupción\nExtracción de datos(I)\nExtracción de datos(II)\nOpen Data: Qué es y para qué sirve\nLey de Transparencia\n\nTodo este material se publica bajo licencias libres que permiten su reutilización.\n                                      "], "listaEtiquetas": [], "listaCategorias": [" Cronica ", " Cursos ", " Datos abiertos ", " Formación ", " PAS "]}{"autor": ["German Martinez"], "titulo": ["Agenda semana 28 de noviembre al 4 de diciembre de 2016"], "contenido": ["\r\n              Esta semana hay varios eventos que seguramente os resultarán interesantes:\n✴️ MARTES 29 ➡️ ‘Demo de la IceZUM Alhambra’. IceZUM Alhambra es una FPGA (Field-Programmable Gate Array, un circuito integrado diseñado para ser programado a nivel físico de forma que sus puertas lógicas hagan lo que deseemos) con la particularidad de que por primera vez el diseño de una placa de este tipo es libre, pudiendo además utilizar una serie de herramientas libres que se han desarrollado específicamente para poder usarse para su programación. Con el motivo de la entrega de las primeras unidades, José Antonio Vacas, uno de sus probadores, dará un mini-taller sobre cómo funciona y qué se puede hacer con ella.\n💬 ORGANIZA. Oficina de Software Libre de la Universidad de Granada\n🏢 LUGAR. Oficina de Software Libre de la UGR (Edificio CEVUG, Planta baja). C/ Real de Cartuja, 36-38.\n⏰ HORA. 09:00\n🎫 REGISTRO. https://www.meetup.com/es-ES/Granada-Geek/events/235861843/\n✴️ MARTES 29 ➡️ ‘”Ganchos” de git en Perl: Git::Hooks’. Como todos los meses los Perl Mongers (usuarios de Perl) de Granada nos reunimos para tratar temas de interés general sobre dicho lenguaje, esta vez en concreto vamos a hablar sobre cómo automatizar tareas en un repositorio del sistema de control de versiones ‘git’ mediante ‘hooks’ (scripts que se ejecutan automáticamente cuando se produce cierto evento). Si no estás familiarizado con Perl no te preocupes, el nivel de las charlas es muy básico; pero en cualquier caso no deberías dejar de pasar la oportunidad de acercarte a este lenguaje de propósito general que sirve para prácticamente todo y es actualmente uno de los más populares con una demanda de empleo considerable. Charla impartida porJJ Merelo (Director de la Oficina de Software Libre de la UGR).\n💬 ORGANIZA. Oficina de Software Libre de la Universidad de Granada\n🏢 LUGAR. Oficina de Software Libre de la UGR(Edificio CEVUG, Planta baja). C/ Real de Cartuja, 36-38.\n⏰ HORA. 12:30\n🎫 REGISTRO. https://www.meetup.com/es-ES/Granada-Geek/events/235179879/\n✴️ MIÉRCOLES 30 ➡️ ‘Talleres de Software Libre Multimedia: Blender’. Continúan los talleres de software multimedia orientados a presentar a estudiantes interesados diferentes herramientas libres orientadas principalmente al ámbito multimedia, dibujo, imagen y sonido. Esta semana corresponde a Blender, un programa usado para principalmente para modelado, iluminación, renderizado, animación y creación de gráficos tridimensionales, que además se puede usar para crear videojuegos y que cuenta con una gran comunidad detrás. El taller será impartido por Jesús Pertíñez, profesor del Departamento de Dibujo de la Facultad de Bellas Artes.\n💬 ORGANIZA. Facultad de Bellas Artes / Oficina de Software Libre de la Universidad de Granada\n🏢 LUGAR. Facultad de Bellas Artes Alonso Cano. Aula T3. Calle Periodista Eugenio Selles, s/n.\n⏰ HORA. 18:00\n🎫 REGISTRO. https://www.meetup.com/es-ES/Granada-Geek/events/235877837/\n✴️ MIÉRCOLES 30➡️ ‘I DataBeersGRX’. En la era del Big Data hay mucha gente interesada en todo lo relacionado con el análisis de datos, esto también ocurre en Granada y es por eso que se ha creado un grupo que reúna a gente interesada en el tema para debatir sobre la importancia de los datos en la sociedad y cómo evoluciona su uso. Este primer evento consistirá en una serie de ponencias en las que personas relacionadas con el campo de la tecnología provenientes del mundo empresarial y de la docencia hablarán sobre su experiencia en el tema. JJ Merelo (Director de la Oficina de Software Libre de la UGR) dará la charla “All hail the data cloud” sobre la importancia de los datos en la ‘nube’.\n💬 ORGANIZA. DataBeersGRX\n🏢 LUGAR. CottonClub. C/ Pintor López Mezquita, 13.\n⏰ HORA. 19:00\n🎫 REGISTRO. https://www.meetup.com/es-ES/DataBeersGRX/events/235460154/\n✴️ JUEVES 1 ➡️ ‘Aprende a crear tu web personal en unos minutos’. Continuando con el ciclo de talleres rápidos que se dan todos los jueves en la ETSIIT, esta semana se enseñará a crear una web personal basada en las páginas personales que se pueden crear en GitHub, la plataforma de desarrollo colaborativo que se ha convertido en la red social de los programadores. Precisamente para exponer nuestro trabajo una web personal siempre es una perfecta carta de presentación, y en este caso en concreto, aunque no seas informático, las páginas personales de GitHub facilitan enormemente la creación al existir una gran variedad de plantillas libres y proporcionarnos el sitio donde alojar nuestra web. Charla impartida por JJ Merelo.\n💬 ORGANIZA. Oficina de Software Libre de la Universidad de Granada\n🏢 LUGAR. Escuela Técnica Superior de Ingenierías Informática y de Telecomunicación. Aula -1.2 (Aula Polivalente). Calle Periodista Daniel Saucedo Aranda, s/n.\n⏰ HORA. 13:30\n🎫 REGISTRO. https://www.meetup.com/es-ES/Granada-Geek/events/235816453/\n✴️ VIERNES 2 ➡️ ‘1º PyDay – Python Granada’. Los PyDay son eventos organizados para dar visibilidad a las comunidades de Python a nivel local. Dichos eventos consisten en un serie de charlas/talleres que sirven tanto de introducción como de divulgación sobre diversos aspectos de dicholenguaje, que además, es actualmente el lenguaje de desarrollo más popular debido entre otras cosas a que es un lenguaje sencillo de aprender, que requiere menos código que otros en tareas sencillas, y todo ello acompañado de una sintaxis muy simple. Ángel Pablo Hinojosa (Técnico Informático de la Oficina de Software Libre de la UGR) dara la charla “Introducción a Python: Lo bueno, lo feo y lo malo” donde comentará los aspectos a tener en cuenta cuando se quiere empezar a programar en Python.\n💬 ORGANIZA. Python Granada\n🏢 LUGAR. Facultad de Ciencias. Sala de Audiovisuales. Avenida Fuente Nueva, s/n.\n⏰ HORA. 16:30\n🎫 REGISTRO. https://www.meetup.com/es-ES/Granada-Geek/events/234947278/\nAdemás os recordamos que seguimos con los #JuevesEnLaETSIIT y los #ViernesEnCiencias para proporcionar soporte de software libre a todo la comunidad universitaria.\n✴️ #JuevesEnLaETSIIT:Escuela Técnica Superior de Ingenierías Informática y de Telecomunicación. Sala de Juntas. Calle Periodista Daniel Saucedo Aranda, s/n.:30-14:00.\n✴️ #ViernesEnCiencias:Facultad de Ciencias. Aula MS2 (Edificio Matemáticas). Avenida Fuente Nueva, s/n.:00-14:00\n                                      "], "listaEtiquetas": [], "listaCategorias": [" Eventos ", " OSL ", " Presentaciones ", " Software Libre ", " Talleres "]}{"autor": ["José Alonso"], "titulo": ["TALLERES DE SOFTWARE LIBRE MULTIMEDIA. 3ª EDICIÓN"], "contenido": ["\r\n              Orientado a estudiantes de Bellas Artes, Conservación y Restauración de Bienes Culturales, Comunicación Audiovisual, Arquitectura, Informática y otros posibles interesados, del 26 de octubre de 2016 al 25 de enero de 2017 tendrán lugar en la Facultad de Bellas Artes de Granada una serie de talleres relacionados con diferentes herramientas digitales libre. Esta enfocado a aplicaciones relacionadas con multimedia, dibujo, imagen y sonido. Los talleres tienen un enfoque práctico y en los mismos los asistentes podrán llevar su propio ordenador para llevar los ejemplos a cabo. Los talleres son gratuitos, y serán impartidos por profesorado de la UGR, personal de la misma y técnicos de la OSL.Más información sobre el programa y formulario de inscripción en\nhttp://bellasartes.ugr.es/pages/tablon/*/cursos-seminarios-talleres-/talleres-de-software-libre-multimedia-3a-edicion\n                                      "], "listaEtiquetas": [], "listaCategorias": [" Administrativa ", " Eventos ", " Formación ", " OSL ", " Software Libre "]}{"autor": ["José Alonso"], "titulo": ["La OSL en las Jornadas de Recepción de Estudiantes 2016-2017"], "contenido": ["\r\n              Como todos los años, la Oficina de Software Libre estará presente en las Jornadas de Recepción de Estudiantes 2016-2017, que tendrán lugar en los paseillos universitarios, donde estaremos encantados de contaros las diferentes actividades que hacemos en el día a día en la OSL, desde cursos a asistencia en software libre como talleres o hackatones.\nDesde la OSL tenemos preparada una sorpresa de la que solo podemos adelantar que esta muy relacionado con nuestro deseo de ayudaros a aprender y que será de gran utilidad a la hora de aprender a programar , como por ejemplo en Python.\nSolo podemos deciros que estéis muy atentos a las redes sociales,principalmente a nuestro Twitter: https://twitter.com/OSLUGR y mañana por la mañana podréis averiguar que tenemos preparado.\n \n\n                                      "], "listaEtiquetas": [], "listaCategorias": [" OSL "]}