{"autor": ["José Alonso"], "titulo": ["III Campaña UGR-UNIA de Ordenadores Libres con Software Libre "], "contenido": ["Tras las múltiples peticiones en las dos campañas anteriores de asociaciones y ONGs, así como las necesidades específicas de las mismas, la ", " junto con la ", " (parte del ", ") y la ", " lanzan la III Campaña UGR-UNIA de ", ", las bases de la misma se pueden consultar ", "Se donarán 20 equipos informáticos con software libre asi como otro tipo de material informático (pantallas, proyectores, impresoras, portátiles)a diferentes asociaciones y ONGs, evaluadas según un orden de prioridad dentro de las solicitantes para lo que se estudiará las que tengan un mayor grado de necesidad para la realización de su actividad cotidiana. Para solicitar uno de estos lotes, solo hay que rellenar este ", " a partir del 3 de noviembre de 2017.", "Durante la primera semana de diciembre se comunicará a los solicitantes el resultado de su solicitud de concesión o no de dicho material informático. La recogida de los ordenadores se realizara en la Oficina de Software Libre, para lo que deberá acudir una persona responsable designada por los solicitantes a la Oficina de Software Libre (", "), tras un pequeño taller impartido por el personal de la propia Oficina de Software Libre en el que se explicará el sistema operativo y el resto de software libre instalados, los beneficiarios podrán proceder a retirar los equipos. La asistencia al taller es obligatoria, para cualquier duda o incidencia se puede consultar por correo a la dirección ", "."], "listaEtiquetas": [], "listaCategorias": [" OSL "]}{"autor": ["José Alonso"], "titulo": ["Linux Lite 3.4. “Simple, fast, free”   "], "contenido": ["Desde la Oficina de Software Libre una de las actividades que más tiempo llevamos realizando es la ", " y equipado con Software Libre. El fin es ayudar a asociaciones sin ánimo de lucro, ONGs o asociaciones de madres y padres de centros de enseñanza dotándolos con este material.", "En estas ", ", patrocinadas por UGR SOLIDARIA o la Universidad Internacional de Andalucía, UNIA, se donan ordenadores, monitores, impresoras y proyectores para que puedan seguir desarrollando su labor social o educativa.", "Se trata de material descatalogado, principalmente por parte de la Universidad de Granada así como de diferentes particulares, que tras ser recogido, reparado (si fuera necesario) y puesto en funcionamiento con Software Libre por los técnicos de la Oficina permitiendo optimizar el rendimiento de estos equipos y devolver en muchos casos el material donado a su vida útil.", "Para el año 2017, se ha utilizado como sistema operativo Linux Lite 3.4. que como su mismo eslogan indica es ", " (", "). Se trata de una distribución especialmente indicada para instalar en equipos con bajos recursos y que rinden mejor con este tipo de distribuciones.", " ", "Si hablamos de Linux Lite, tenemos que comenzar señalando que es una distribución ", " basada en ", " (Long Term Support)", "Al ser una versión LTS, se ofrece soporte para al menos 5 años", "  Esta distribución posee un escritorio catalogado como Xfce (", ", que está especialmente indicado para usuarios que no han utilizado antes sistemas basados en ", " o aquellos que quieren dar una segunda oportunidad a esos equipos ", ".", "Otro punto a favor es que trae instaladas una gran variedad de herramientas (Firefox, LibreOffice, VLC y Thunderbird entre otros), lo que permite poder a trabajar con el equipo desde un primer momento.", "Como punto final, destacar que tan sólo es necesario 512 MB y un simple procesador de 700 MHz, y que se dispone tanto de una extensa documentación como de un un propio gestor de software, que nos facilita la tarea de tener nuestro equipo perfectamente actualizado.", "\nPara quienes se han decidido a probarla o quieren más información, en este", " podrán descargarla. Más información en"], "listaEtiquetas": [], "listaCategorias": [" Distribuciones ", " Donación de equipos ", " OSL ", " Software Libre "]}{"autor": ["Bryan Moreno"], "titulo": ["Firefox Quantum: El zorro más veloz de Internet."], "contenido": ["Hace unos días, llegaba a nuestros equipos la nueva actualización del navegador de Mozilla, el denominado Firefox Quantum, bajo el lema ", " (Ahora Es Mejor) y con unos cuantos videos promocionales en clave de humorístico bajo la manga, con los que la compañía ha querido mostrarnos su nuevo producto.", "Si bien a simple vista parece el mismo navegador de siempre, cuando hacemos un análisis un poco más meticuloso vemos que hay notables mejorías que contamos a continuación de forma muy resumida.", "Para empezar, la gente de Mozilla ha decidido cambiar el motor del navegador por uno nuevo y, en teoría, más veloz que el anterior. Esto se ha realizado con múltiples cambios entre los que destacan el uso de un motor CSS multinúcleo (Stylo) así como un nuevo sistema de prioridades en cargas de pestañas y ventanas, además de preparaciones para futuras incorporaciones como ", " que harán de Firefox un navegador más rápido y fiable según promete la compañía.", "Si todo sale como la compañía espera, los cambios van a hacer que el navegador sea hasta dos veces más rápido y un 30% más ligero que su versión anterior e incluso que Google Chrome. Nosotros, después de unos días probando, no podemos afirmar que sea el doble de rápido, pero sí hemos notado una mejoría notable en la fluidez entre pestañas y ventanas.", "Tras unas breves pesquisas e indagaciones por numerosos blogs de tecnología, podemos ver que, si bien los cambios y mejoras suponen un paso adelante comparándolo con versiones anteriores, ", " sigue teniendo algunos problemas con el uso excesivo de memoria si se utilizan múltiples pestañas/ventanas. En la mayoría de los casos podemos ver que efectivamente sigue siendo más rápido que sus competidores directos, aunque aún queda un largo camino por recorrer. No obstante, parece que la compañía del zorro rojo se ha puesto manos a la obra e intenta quitar de su puesto de rey a su archienemigo Chrome, esperamos que en las siguientes versiones la velocidad y mejoras de rendimiento se noten aún más.", "Este navegador sigue siendo software libre y multiplataforma y esta nueva versión se puede descargar desde ", ".", " ", " "], "listaEtiquetas": [], "listaCategorias": [" Software Libre "]}{"autor": ["admin"], "titulo": ["Grupos de Telegram de la comunidad de software, hardware y conocimiento libre en Granada"], "contenido": ["En los últimos meses han surgido una serie de grupos de Telegram centrados en el software y hardware libre en Granada y alrededores. Todos los grupos son abiertos, se puede acceder a ellos sin invitación y está bien conocerlos. Aunque todos tienen énfasis en un tema determinado, no hace falta tener un máster en el mismo, son grupos para todos los niveles."], "listaEtiquetas": [], "listaCategorias": [" Eventos ", " Mundo Libre ", " Software Libre "]}{"autor": ["José Alonso"], "titulo": ["Formulario de solicitud  III Campaña UGR-UNIA de Ordenadores Libres con Software Libre"], "contenido": [], "listaEtiquetas": [], "listaCategorias": [" OSL "]}